[
  {
    "id": "91645840-7a72-49ba-ab32-7d1d5ef134f3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/91645840-7a72-49ba-ab32-7d1d5ef134f3",
    "created_at": "Wed Mar 27 22:06:56 UTC 2019",
    "company": "Expensify",
    "company_url": "http://www.we.are.expensify.com",
    "location": "San Francisco,CA; Portland, OR; London, UK; Remote",
    "title": "Full Stack Engineer",
    "description": "<p>Your Mission, Should You Choose to Accept:</p>\n<p>Expensify prides itself in solving a real world problem with a team of top notch engineers. Expense reports have long been a burden on the business world and working at Expensify means helping us automate every step of the process from the moment people incur their business expenses to the moment they get reimbursed with money in the bank (and everything in between!).</p>\n<p>Joining our team means you will be working in our fast paced environment and you are fearless of our next big challenge. Even though we work hard at Expensify, we make sure our employees are happy. Our most discussed perk is our offshore where we spend a month abroad working from a remote location as a team. This year we went to Uruguay, do you want to join?</p>\n<p>About You</p>\n<p>Whether you’re building features like calendar integrations, importing credit card transactions, or pulling information from receipts, you’re self-driven and collaborative. You’re an autonomous individual who is passionate about making code beautiful and effective, and you’re open to working with other engineers and designers to make dreams into reality.</p>\n<ul>\n<li>As a Full Stack Engineer, your responsibilities include:</li>\n<li>Squashing bugs: big, small, and hairy!</li>\n<li>Building features like accounting integrations, travel budgets, and more.</li>\n<li>Guiding and enabling others in the technical organization: we'll share our editor tricks, dotfiles and productive workflow. Share yours!</li>\n<li>Asking questions about things you don’t understand and challenging the status quo</li>\n</ul>\n<p>For the best possible fit, we are looking for someone who:</p>\n<ul>\n<li>Has experience writing real-world software to solve real-world solutions.</li>\n<li>Communicates well, both in the code (WE &lt;3 COMMENTS!) as well as with our team and industry partners\n-Is a natural problem solver</li>\n<li>Wants to develop and grow their skills in programming and leadership within the organization</li>\n</ul>\n<p>While we use a number of different technologies and languages, for this role we are looking for people who already have a strong understanding of JavaScript, PHP, C++, Java, algorithms, and design patterns. This position is the foundation for launching a career with Expensify, with the expectation you’ll carry these skills into new domains.</p>\n<p>Compensation &amp; Benefits</p>\n<ul>\n<li>Full-time, salaried position</li>\n<li>401k with employer match</li>\n<li>100% Medical/Dental/Vision contributions</li>\n<li>Commuter benefits</li>\n<li>Free lunch</li>\n<li>Flexible vacation policy</li>\n<li>Work From Home when you need it</li>\n</ul>\n<p>Next Steps</p>\n<p>Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way is to help us out by answering the following questions:</p>\n<ol>\n<li>What's the URL of your website? If you don't have one, why not?</li>\n<li>What's your coding history? When did you start, and what have you done between then and now?</li>\n<li>What do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals?</li>\n<li>How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.</li>\n</ol>\n<p>Resume not your thing? That’s great, we don’t really read them anyway! Forward your responses to the questions to <a href=\"mailto:jobs@expensify.com\">jobs@expensify.com</a>. We're excited to hear from you!</p>\n",
    "how_to_apply": "<p><a href=\"https://we.are.expensify.com/apply\">https://we.are.expensify.com/apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhqIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0f5e5cfaa80a8e669a16f154be27e572b2deace3/expensify-mobileapp-logo.png"
  },
  {
    "id": "70cba88e-230b-460c-8e56-dbf7fd3f0372",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/70cba88e-230b-460c-8e56-dbf7fd3f0372",
    "created_at": "Fri Apr 26 18:27:40 UTC 2019",
    "company": "Vitamin",
    "company_url": "http://www.vitaminisgood.com",
    "location": "Baltimore, MD",
    "title": "Front-End Developer",
    "description": "<p><strong>Overview</strong></p>\n<p>Are you ready to work in a new environment? Let’s do this! Now is the time to make that move to an agency position that empowers you to own your work from start to finish, create great things and work on challenging digital projects. Here at Vitamin, we love WordPress. We love attention to detail. And we love bringing our designs to life with polished front-end code that is mobile-first, SEO-friendly, accessible, and light weight. Javascript skills? Check! PHP and MySQL skills? Check! Experience with JS animation libraries and JS frameworks? Now we’re talking. We enable our developers to leverage their complete talent sets by bringing a process that results in solid build work and strong creative. You will have direct access to clients and be involved in kick-off meetings and design presentations. We offer a competitive salary and benefits package and a unique client roster that spans a variety of industries to keep things fresh and challenging. The ideal candidate will have 2-5 years experience in an agency or in-house setting.</p>\n<p><strong>Must-Haves</strong></p>\n<ul>\n<li>Thorough knowledge of HTML, CSS, and Responsive design</li>\n<li>Experience with Javascript and jQuery</li>\n<li>A working knowledge of PHP, MySQL</li>\n<li>Experience with WordPress – the more the better</li>\n<li>2-5 years professional experience</li>\n<li>4-year degree</li>\n<li>Understanding of typography and the ability to utilize type effectively</li>\n<li>Passion to learn and succeed; ability to take well to constructive criticism</li>\n<li>Motivation to work individually and as a team in a fast-paced, client-centric business environment</li>\n<li>Attention to detail along with the ability to self manage and follow directions</li>\n</ul>\n<p><strong>Nice-to-Haves</strong></p>\n<ul>\n<li>Experience with JS frameworks (React, Vue)</li>\n<li>Experience with JS animation libraries (GSAP, anime.js)</li>\n<li>Experience with eCommerce platforms such as WooCommerce, BigCommerce, Shopify, Magento</li>\n<li>Experience with HubSpot, Marketo, other Marketing Automation platforms</li>\n<li>Agency background is a plus</li>\n</ul>\n<p><strong>The Position Requires</strong></p>\n<ul>\n<li>Ability to concurrently balance and execute upon on multiple projects</li>\n<li>Ability to understand, manage and meet deadlines</li>\n<li>Passion for detail</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>We all work to make money. And when you join the Vitamin team, you will be compensated well in exchange for the time and talent you are devoting to your career and to our success, as an agency. We also offer a comprehensive benefits package, inclusive of medical, dental and vision; 401(k) with employer match; 3-week vacation to start with escalation; Summer Fridays, Takeout Tuesday; Mental Health Days, and much more beyond those “standard” employment benefits. Some of the perks our team appreciates the most, and gets super excited about include:</p>\n<ul>\n<li>\n<p><strong>Location:</strong> the opportunity to work in an exciting location, in office space that is warm, inviting, and inspiring. Our office is positioned just one short block from the Creative Alliance, which is buzzing weekly with new art exhibitions, dance and music performances, movie showings, poetry readings, educational programs and other events that will keep any creative person’s heart content.</p>\n</li>\n<li>\n<p><strong>Work Environment:</strong> Most days, we’ve got the music pumping. And while we work hard, we also realize taking breathers throughout the day is not only necessary, but also gives us the chance to build personal relationships with those we work with side-by side. Plus, we know these little breathers ultimately make us more productive.</p>\n</li>\n<li>\n<p><strong>Parking:</strong> It’s plentiful, and it’s free.</p>\n</li>\n<li>\n<p><strong>Daily Style:</strong> We believe comfort is key and encourage you to dress in a way that is polished and professional for meetings, and work-appropriate the rest of the time.</p>\n</li>\n<li>\n<p><strong>Coffee is Key:</strong> We know it, and you know it. If you’re a coffee aficionado like many of us, you’ll quickly join the daily grind at our QuickMill Anita espresso machine.</p>\n</li>\n<li>\n<p><strong>Lunchtime Options:</strong> We’re a quick hop, skip, or jump away from some pretty cool and eclectic hot spots, from Canton Square and Patterson Park to local favorites like Atwater’s, DiPasquale’s, Matthew’s Pizza, and Snake Hill Tavern. We love food!</p>\n</li>\n<li>\n<p><strong>Bragging Rights:</strong> We crank out award-winning work. And at the end of the day, when your name is on it, you can say you were part of making it all happen.</p>\n</li>\n</ul>\n<p><strong>About Vitamin</strong></p>\n<p>Wondering what Vitamin is all about? We are a Baltimore-based agency, delivering deeply branded integrated marketing-communications solutions for clients who need and want to bring their unique differences to life digitally and beyond. Growing and evolving each and every day for more than 15 years, we manage only the best, most collaborative and high-performing client-agency relationships. We develop and deliver strategies, campaigns and programs that aren’t just out of the box; they’re nowhere near the box. They lead to trackable, measurable results that make us, as well as the clients we serve, extremely proud. That said, when the time comes for us to recruit new talent to join our tight-knit team, we are looking for the best of the best. It’s what we want and absolutely need, and it’s what our clients demand.</p>\n",
    "how_to_apply": "<p>Submit your resume, online portfolio (PDF and/or URL) and salary requirements to <a href=\"mailto:careers@vitaminisgood.com\">careers@vitaminisgood.com</a> with the subject line: Front-End Developer.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--701842a15323dbf047deba184993c0c7f9f2ee68/paul_careers.jpg"
  },
  {
    "id": "ad1a1a9e-605a-4841-a985-2314bf4561c5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ad1a1a9e-605a-4841-a985-2314bf4561c5",
    "created_at": "Fri Apr 26 17:07:59 UTC 2019",
    "company": "BLADE",
    "company_url": "http://flyblade.com",
    "location": "New York City",
    "title": "Full-Stack Rails Software Engineer",
    "description": "<p>=== US ===</p>\n<p>BLADE is changing the way people travel, opening up new routes and making options like helicopters and seaplanes affordable though technology. We provide helicopter and fixed wing flights between Manhattan, the Hamptons, LA, and a growing number of other destinations. Our app offers the ability to simply grab a single seat or launch your own crowdsourced flight.</p>\n<p>We've had an incredibly successful first few years and are building out the team to take us to the next level.</p>\n<p>=== YOU ===</p>\n<p>We're looking for Senior and Junior full stack engineers experienced in Ruby on Rails and Javascript to help us build the experience that changes the aviation game.</p>\n<p>=== REQUIREMENTS ===</p>\n<ul>\n<li>1+ years experience in shipping software features for a company - We're looking for both Junior and Senior Rails engineers.</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:bernadette@flyblade.com\">bernadette@flyblade.com</a>. Include a brief cover letter about your experience, why you're interested in BLADE, and a link to your Github.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkpsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a3b6b3120e7075a8d6836cf795f387d77cef0a9c/blade%20logo.png"
  },
  {
    "id": "cba8d27a-8c85-477f-b96b-001160c5c827",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cba8d27a-8c85-477f-b96b-001160c5c827",
    "created_at": "Fri Apr 26 14:43:50 UTC 2019",
    "company": "A-Gas - Portbury",
    "company_url": "https://www.agas.com/about-us/careers/",
    "location": "Portbury, Bristol",
    "title": "Senior MS SQL Server Developer",
    "description": "<p><strong>Day rate or 1-year fixed term PAYE contract available</strong></p>\n<p>SELECT TOP(1) C.SQLServerDeveloper FROM Candidates C WHERE C.Skills = 'excellent' AND C.Attitude = 'amazing'</p>\n<p>ORDER BY C.DayRate ASC</p>\n<h2><strong>What you’ll love about working in the IT team at A-Gas Europe</strong></h2>\n<p>You’ll work on a project that has a specific aim. That’s to deliver changes to our bespoke systems in order to scale them out across Europe ready for a greenfield SAP ERP implementation which brings all operational aspects of HR, Finance, Operations and Sales and Service together in one common platform.</p>\n<p>Rather than a general “can you develop in X, Y and hopefully, Z set of requirements”. You’ll use SQL technologies to enable us to get the most of our current bespoke and off the shelf software solutions used to improve business processes.</p>\n<p>You’ll be expected to review, develop and adapt our systems to ensure they’re able to operate continuously without significant disruption for the looming SAP solution.</p>\n<p>You’ll be working within a small friendly team, so if you’re someone who enjoys that close-knit environment you will fit in nicely.</p>\n<p>If you have a ‘can-do‘ attitude, enjoy tasks varying from one day to the next and are able to make commercially sensible judgements then you may be exactly what we’re looking for.</p>\n<p>You’ll be based at our new site in Portbury which is 3 times as large as our existing site. It will have a large canteen, purpose-built m/f locker rooms, nice views of the bustling Portbury docks and the potential for onsite gym/ picnic area.</p>\n<p>You’ll improve the way our people spend their working days. On a European-scale.</p>\n<h2><strong>What you’ll get in return</strong></h2>\n<p>We offer a competitive starting salary or day rate. If you opt for the fixed term contract, you’ll be entitled to a very good profit-related bonus and pension scheme.</p>\n<p>You’ll open the door to European opportunities in the UK, Netherlands and Germany.</p>\n<h2><strong>And who are we…?</strong></h2>\n<p>We’re the European region of A-Gas, a global gases business with significant private equity backing. We have a market leading position and are growing globally. Our aim is to grow our position as a leading supplier of refrigerants.</p>\n<p>Today we’re represented across the globe, with ambition to treble our current size in Europe over the next three years.</p>\n<p>Which means huge opportunity for the people in our business. People like you.</p>\n<p>What are you waiting for?</p>\n<p>Apply today via the applicationform and let’s start talking about where you want to take your career.</p>\n<h2><strong>FAO Agencies:</strong></h2>\n<p>We do not appreciate applications and/or CVs from recruitment agencies unless expressly agreed otherwise by the Talent Acquisition team.</p>\n<p>For the avoidance of doubt any applications and/or CVs provided outside of the process shall be considered speculative and shall not constitute a valid Introduction. Any subsequent engagement arising out of such applications and/or CVs shall not therefore attract any Introduction Fee save where A-Gas expressly agrees otherwise.</p>\n<h2><strong>Requirements</strong></h2>\n<p><strong>Who you are?</strong></p>\n<p>You’re already in an MS SQL Server Developer role. Your most recent experience is broad and covers the breadth of things like relational database design and development with Microsoft SQL and T-SQL, and SSRS (versions between 2008 -2017) and Source Control. If you’ve understanding of DBA including MS Query Analyser and TSQLT or SQL testing, then you’ll have a head start.</p>\n<p>You’ve worked on an integration project before and have experience implementing and maintaining multi-site / country systems.</p>\n<p>You’re experienced in contracting or prioritising the job in hand and want to get on with it.</p>\n<p>You’re curious, ask questions and like to solve problems. Finding out how things work is interesting to you.</p>\n<p>Sound like you?</p>\n<p>Then we might just be a fit</p>\n<p><a href=\"http://tinyurl.com/yxnwdlf9\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"http://tinyurl.com/yxnwdlf9\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVpsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ea9faa5102b5711430bb462fc662526d696780b5/a-gas%20logo.png"
  },
  {
    "id": "ebd844f9-6af5-4d4e-9a11-00a34695121c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ebd844f9-6af5-4d4e-9a11-00a34695121c",
    "created_at": "Fri Apr 26 13:10:12 UTC 2019",
    "company": "Compano",
    "company_url": "https://www.compano.com/",
    "location": "Sneek",
    "title": "Front-end Developer",
    "description": "<p><strong>Compano zoekt collega (m/v) voor kantoor Sneek</strong></p>\n<p><strong>Front-end Developer</strong>\n<strong>32-40 uur per week</strong></p>\n<p><strong>Over de functie</strong>\nSteeds meer klanten zien het belang van goede artikel- en productdata. Compano heeft uitstekende software om data te verrijken (PIM) of te gebruiken (MDM en calculatie). Om data te delen is Artikelbeheer.nl een bekende datapool in de markt.</p>\n<p>Voor het ontwerpen en ontwikkelen van een nieuw user-interface zoeken wij een front-end developer met kennis van de gangbare web-development technieken.</p>\n<p>Voor de realisatie van dit user-interface/front-end is een goede samenwerking met de back-end ontwikkelaars van belang voor de integratie met de huidige applicatie.</p>\n<p>Het ontwerp zal afgestemd moeten worden met klanten/consultants en productontwikkeling.</p>\n<p>Je gaat zelfstandig dit interface ontwerpen en ontwikkelen binnen het huidige ontwikkelteam met standplaats Sneek.</p>\n<p><strong>Wat vragen wij van jou?</strong></p>\n<ul>\n<li>Je beschikt over een flexibele, service- en klantgerichte instelling</li>\n<li>Je kunt goed in teamverband werken</li>\n<li>Opleiding op HBO niveau.</li>\n<li>Relevante kwalificaties of werkervaring</li>\n<li>Minimaal 3 jaar professionele ervaring in development.</li>\n<li>Uitstekende beheersing van HTML, CSS, JavaScript, Json. Kennis van Typescript is een pré</li>\n<li>Bekend met minimaal één groot front-end framework bij voorkeur Angular.</li>\n<li>Uitstekend Nederlands en Engels.</li>\n<li>Een verlangen om jezelf constant te verbeteren</li>\n</ul>\n<p><strong>Wat bieden wij jou?</strong></p>\n<ul>\n<li>Uitdagende en afwisselende functie in een professionele en stimulerende omgeving</li>\n<li>Meegroeien met het bedrijf</li>\n<li>Veel ruimte om zelf te bepalen hoe je invulling geeft aan je werk en functie</li>\n<li>Persoonlijke, informele klant/resultaatgerichte werksfeer</li>\n<li>Een kennis gedreven werkomgeving</li>\n<li>We werken met uitdagende en leuke (internationale) klanten</li>\n<li>Je ontvangt een goed salaris afhankelijk van kennis en ervaring.</li>\n<li>Relevante opleiding voor (toekomstige) functie altijd bespreekbaar.</li>\n</ul>\n<p><strong>Over Compano, producten en diensten</strong>\nCompano is dé specialist op het gebied van online software voor de bouw- en installatiebranche. Onze klanten zijn actief als producent, handelaar of installateur. Met ons Product Informatie Management (PIM) systeem verbeteren producenten hun productdata waardoor hun eindklanten beter kunnen kiezen. Het Master Data Management (MDM) systeem zorgt voor eenvoudig assortimentsbeheer, inclusief inkoop- en verkoopcondities voor groothandelaren en inkoopverenigingen. Op datapool <a href=\"http://www.artikelbeheer.nl\">www.artikelbeheer.nl</a> wisselen bedrijven op eenvoudige wijze product- en artikeldata uit, op basis van de ETIM-standaard. Data van artikelbeheer.nl kan ook direct in onze online calculatiesoftware worden gebruikt of in (bedrijfs)software van derden.</p>\n<p><strong>Compano, het bedrijf</strong>\nIs opgericht in 1998 en heeft passie voor data. Compano is begonnen in Sneek en telt nu in totaal 20 medewerkers, verspreid over de vestigingen Arnhem en Sneek. Vestiging Arnhem zorgt voor de marketing, verkoop, consultancy en implementatie van projecten. Sneek zorgt voor de productontwikkeling, administratie, de ICT-infrastructuur en biedt support voor al onze klanten.</p>\n<p>Compano heeft al 20 jaar een open en sociale bedrijfssfeer. We zijn authentiek en betrokken, in zowel de omgang met opdrachtgevers als met collega's en willen excelleren in ons werk. Hoewel datamanagement als vakgebied complex kan zijn, willen we vooral pragmatische en resultaatgerichte oplossingen bieden aan onze klanten. Compano is ondernemend en onze medewerkers zijn professioneel en gaan goed om met hun eigen verantwoordelijkheid. We kiezen voor langlopende samenwerkingen boven gewin op korte termijn, zowel met onze klanten en partners als met ons personeel.</p>\n<p><strong>Interesse en solliciteren?</strong>\nVoor meer informatie over de functie kan je bellen naar Henk Koops (Technisch Directeur) op nummer 06 – 218 66 161</p>\n<p>Als je wilt solliciteren, mail dan je CV en een korte toelichting via onze <a href=\"https://compano-online-software.onlinevacatures.nl:443/nl/Vacancy/Postulate/130609?jid=2021\">sollicitatiepagina</a></p>\n<p>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n",
    "how_to_apply": "<p>Als je wilt solliciteren, mail dan je CV en een korte toelichting via onze <a href=\"https://compano-online-software.onlinevacatures.nl:443/nl/Vacancy/Postulate/130609?jid=2021\">sollicitatiepagina</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDVsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8aa0a47b17a675f5063c328c2db4f12fd3ec1749/Logo%202019.jpg"
  },
  {
    "id": "e0c55f96-d8a9-40b4-89f0-5ab8139c2818",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e0c55f96-d8a9-40b4-89f0-5ab8139c2818",
    "created_at": "Fri Apr 26 11:39:38 UTC 2019",
    "company": "Koninklijke Bibliotheek",
    "company_url": "https://ltpx.nl/q5MdtTj",
    "location": "Den Haag",
    "title": "Software Engineer voor de Cloud",
    "description": "<p><strong>Software Engineer voor de Cloud</strong>\n<em>Den Haag</em></p>\n<p><strong>Wat ga je bij ons doen?</strong>\nAls ervaren softwareontwikkelaar ben je toe aan een ontwikkelstap. Jij gaat bij ons cloud-technologie leren, realiseren en toepassen zodat onderzoekers hier eenvoudig gebruik van kunnen maken en zich kunnen richten op hun eigen onderzoek. In je rol van Software Engineer voor het CLARIAH project houd je je bezig met het ontwerpen en realiseren van applicaties voor tekstonderzoek in een cloud-omgeving. Je leert bij ons alle fijne kneepjes van Kubernetes, want hiermee ga je de cloud-omgeving opzetten en de componenten bouwen.</p>\n<p>In deze veelzijdige baan voer je niet alleen de realisatie uit, maar ondersteun je ook de besluitvorming over de te maken technische keuzes. Je leert ook functionele eisen te vertalen en de gewenste architectuur te realiseren in werkende producten en componenten voor de cloud. Je bent gewend om gestructureerd en zelfstandig in teamverband te werken en hebt ervaring met Agile en Scrum. Je krijgt ruimte om te pionieren en nieuwe ontwikkelingen te verkennen en dit te vertalen naar nieuwe, bruikbare oplossingen. </p>\n<p><strong>Wat bied jij?</strong></p>\n<ul>\n<li>Minimaal <strong>hbo</strong>-<strong>werk</strong> -en -<strong>denkniveau</strong>.</li>\n<li>Leergierig en gedreven om het vak van Cloud Engineer te leren.</li>\n<li>\n<strong>Aantoonbare</strong> relevante <strong>werkervaring</strong> met <strong>softwareontwikkeling</strong>.</li>\n<li>Een goed <strong>analytisch</strong> vermogen, <strong>pragmatisch</strong>, <strong>oplossings</strong>- en <strong>resultaatgericht</strong>, <strong>proactief</strong>, <strong>creatief</strong>.</li>\n<li>Kennis van <strong>Python</strong>, <strong>Java</strong> en/of <strong>Shell</strong>-<strong>scripting</strong> en bent bekend met broncode-versiebeheer systemen zoals <strong>GIT</strong> en <strong>SVN</strong>.</li>\n<li>Zakelijk/technisch communicatief vaardig, zowel in het Nederlands als in het Engels.</li>\n<li>Als je kennis hebt van <strong>Linux</strong> systeem-administratie en van <strong>CI</strong>/<strong>CD</strong>, Ansible en/of <strong>DevOps</strong> is dat een pre.</li>\n</ul>\n<p><strong>Wat bieden wij?</strong></p>\n<ul>\n<li>Een tijdelijk dienstverband voor 40 uur per week, in eerste instantie voor de periode van 1 jaar, met uitzicht op een verlenging.</li>\n<li>Een goed salaris tussen € 2.736,- en € 4.339,- bruto per maand (schaal 10) op basis van 40 uur, een dertiende maand (8,33%) en volledige vergoeding van je dagelijkse reiskosten.</li>\n<li>Je bouwt pensioen op via het pensioenfonds ABP.</li>\n<li>Een aantrekkelijk arbeidsvoorwaardenpakket dat je deels zelf kunt samenstellen, waaronder het kopen en verkopen van vakantiedagen.</li>\n<li>Een goede balans tussen werk en privé vinden wij belangrijk. Daarom kun je afspraken maken over flexibele werktijden, heb je veel vakantiedagen (42 dagen per jaar bij een volledige baan) en wordt ouderschapsverlof gedeeltelijk doorbetaald. In veel functies behoort ook thuiswerken tot de mogelijkheden.</li>\n<li>Alle ruimte om te leren en je verder te ontwikkelen.</li>\n<li>Een werkplek in hartje Den Haag op drie minuten lopen vanaf het Centraal Station.</li>\n</ul>\n<p><strong>Koninklijke Bibliotheek</strong>\nDe Koninklijke Bibliotheek is een nationaal en internationaal bekend instituut: we zijn één van de grote Nederlandse erfgoed- en wetenschapsinstellingen en hebben een belangrijke coördinerende rol in het netwerk van openbare bibliotheken. Tot de taken behoren onder meer het bewaren, verzamelen en beschikbaar stellen van alle publicaties die in of over Nederland worden uitgegeven en het bouwen aan de nationale digitale bibliotheek. </p>\n<p><strong>Waar kom je bij ons werken?</strong>\nJe werkt in een team IT-ontwikkeling met 20 gedreven software engineers, waar gewerkt wordt aan projecten en componenten die de landelijke diensten voor Openbare Bibliotheken realiseren, maar ook aan KB-diensten zoals Delpher en een Digitaal Magazijn voor het Nederlands geschreven woord. Binnen dit team ben jij de pionier voor cloudtechnologie op basis van Kubernetes. Als lid van het CLARIAH projectteam werk je samen met onderzoekers, architecten en ontwikkelaars aan de realisatie van een onderzoeksinfrastructuur voor grootschalige tekstbestanden.</p>\n<p><strong>Hebben we je interesse gewekt?</strong>\nStuur je cv en een motivatie waarom jij de ideale kandidaat bent voor de functie van Software Engineer voor de Cloud via het <a href=\"https://ltpx.nl/UUJBQof\"><strong>online sollicitatieformulier</strong></a>. Het vacaturenummer is vacaturenummer 19-09-012-H.</p>\n<p>Om je alvast beter te leren te kennen willen we je vragen om in je motivatiebrief ons iets te vertellen over je huidige kennis van cloudtechnologie en vooral waarom je dat bij ons wil leren.</p>\n<p>De selectieprocedure bestaat uit twee gespreksrondes. Na ontvangst van je sollicitatie laten wij je snel weten of je voor een eerste gesprek wordt uitgenodigd.</p>\n<p><strong>Wil je eerst meer weten?</strong>\nBel dan met Harrie Hazewinkel (Teamleider IT-ontwikkeling), tel. 070 314 03 78. Bel voor algemene vragen naar 06 2149 3839. Of kijk op <a href=\"https://www.academictransfer.com/en/employer/KB/\"><strong>www.academictransfer.com/en/employer/KB/</strong></a> voor meer informatie.</p>\n<p><em>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</em><img src=\"https://camo.githubusercontent.com/eef559878a11ed0879a31b3a01e65d961704263b/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d3935343239\"></p>\n",
    "how_to_apply": "<p><a href=\"https://ltpx.nl/ulNtIoh\">Click to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--646e53a9576b137b525354f9eb2cf0ce38032a00/KB%20nieuw%20logo.png"
  },
  {
    "id": "06280210-e6fc-4cb1-ba80-dbc6263e81e0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/06280210-e6fc-4cb1-ba80-dbc6263e81e0",
    "created_at": "Fri Apr 26 11:23:20 UTC 2019",
    "company": "Cobiro ApS",
    "company_url": "http://www.cobiro.com",
    "location": "Copenhagen",
    "title": "QA Engineer",
    "description": "<p><strong>Be a part of an exciting journey</strong></p>\n<p>At Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing easy-to-use, accessible and high-performing for everyone, and we're starting with Google Ads.</p>\n<p>Working at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Flexible working hours</li>\n<li>An agile work environment</li>\n<li>Focus on quality solutions</li>\n<li>Options to attend relevant courses and conferences</li>\n<li>A team of passionate, skilled and experienced colleagues</li>\n<li>All the gear and food you need: breakfast on Fridays, lunch every day, sodas, fruit, vegetables and sweets</li>\n<li>On-site massage</li>\n<li>Frequent social company activities, Friday bar included</li>\n<li>Good working equipment</li>\n<li>A great working location at Esplanaden, Central Copenhagen</li>\n</ul>\n<p><strong>The opportunity</strong></p>\n<p>We are looking for a QA Engineer to assess software quality through manual and automated testing. You have documented professional experience as a QA Engineer or a similar role - preferably with large-scale enterprise and/or cloud solutions.</p>\n<p>Within the first couple of months you will be getting a thorough introduction and overview of our product and systems, and will continue to work in an increasingly independent role with growing responsibilities. You will become responsible for documenting and troubleshooting errors, and will join a growing QA team within our engineering department. Once a pull request has been approved it is up to the QA to merge it onto a test server and manage the rest of the release flow (testing - building - releasing) in collaboration with the developers.</p>\n<p>You should have a keen eye for detail and excellent communication skills, as well as being competent in executing test cases and being passionate about quality. If you are also an open-minded team-player who is kind, intelligent, driven to build great solutions, with a good sense of humor we’d like to meet you.</p>\n<p>Ultimately, you will ensure that our products, applications and systems work correctly.</p>\n<p><strong>For this position, you will need:</strong></p>\n<ul>\n<li>Knowledge of SQL</li>\n<li>Knowledge of JavaScript</li>\n<li>Experience with building an automated test framework (Selenium tests), as well as the ability to write automated tests</li>\n<li>An understanding of JSON</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Experience with Github</li>\n<li>Experience with Postman test</li>\n</ul>\n",
    "how_to_apply": "<p>We are looking forward to receiving your application through our application system - simply click on \"Apply for this job\" and attach your CV and/or Linkedin account.</p>\n<p><a href=\"https://cobiro.bamboohr.com/jobs/view.php?id=58\">https://cobiro.bamboohr.com/jobs/view.php?id=58</a></p>\n<p>You will always get a reply when applying through our system.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHBsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3fb869c6fbbfcbb9c92cb3cf9fdb7c2202294ec9/cobiro_image.png"
  },
  {
    "id": "a22a283d-9a66-4e21-8a69-44a22f0f05f7",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a22a283d-9a66-4e21-8a69-44a22f0f05f7",
    "created_at": "Fri Apr 26 10:17:19 UTC 2019",
    "company": "Cobiro ApS",
    "company_url": "http:",
    "location": "Copenhagen",
    "title": "Data Engineer",
    "description": "<p><strong>Be a part of an exciting journey</strong></p>\n<p>At Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing easy-to-use, accessible and high-performing for everyone, and we're starting with Google Ads.</p>\n<p>Working at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Flexible working hours</li>\n<li>An agile work environment</li>\n<li>Focus on quality solutions</li>\n<li>Options to attend relevant courses and conferences</li>\n<li>A team of passionate, skilled and experienced colleagues</li>\n<li>All the gear and food you need: breakfast on Fridays, lunch every day, massages, sodas, fruit, vegetables and sweets</li>\n<li>Frequent social company activities, Friday bar included</li>\n<li>Good working equipment</li>\n<li>A great working location at Esplanaden, Central Copenhagen</li>\n</ul>\n<p><strong>The opportunity</strong></p>\n<p>Cobiro is automating online advertising and our AI team is looking for an ambitious Data Engineer looking to get real-life-experience building big data infrastructure. You will be the second Data Engineer in the team working with experienced industry professionals building scalable big data systems for analytics and AI applications. We are currently working on Google Ads and will expand to other platforms this year.</p>\n<p>In your role as a Data Engineer, you will work closely with talented professionals in designing and implementing high performance and flexible data tools using cloud computing services. We expect you to be a team player who is comfortable using agile methodologies to capture the optimal designs and architectures for our solutions. You are already in the habit of learning, prototyping, and deploying emerging data technologies on a daily basis. The position offers the opportunity to get hands-on domain experience right from the start.</p>\n<p>Not required, but nice to have would be experience with NoSQL databases (e.g. DynamoDB, Cassandra), experience developing and deploying applications on Linux-based technologies (e.g. containers), as well as knowledge and experience with data visualization tools (e.g. Quicksight, Tableau, Grafana).</p>\n<p>Working at Cobiro you will work alongside colleagues with backgrounds in Software / Computer Engineering, Data Science, Informatics, Machine Learning, Robotics, Linear Programming, Natural Language Processing, and Gaming.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Implement, extend, and maintain our current data infrastructure</li>\n<li>Support AI team in realizing new data sources</li>\n<li>Design, along with AI engineers and business stakeholders, the appropriate data models and ETL pipelines to satisfy our novel Machine Learning models and Business Analytics insights.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>MSc degree in Computer Science / Engineering, Software Engineering, Information Technology, or a related field</li>\n<li>Experience with data lakes / warehouse, ETL pipelines and scalable systems</li>\n<li>Strong skills and working experience in Python programming</li>\n<li>Experience working in cloud computing services, preferably AWS</li>\n<li>Experience with SQL and relational databases (e.g. MySQL, Postgres)</li>\n</ul>\n",
    "how_to_apply": "<p>We are looking forward to receiving your application through our application system - simply click on \"Apply for this job\" and attach your CV and/or Linkedin account.</p>\n<p><a href=\"https://cobiro.bamboohr.com/jobs/view.php?id=57\">https://cobiro.bamboohr.com/jobs/view.php?id=57</a></p>\n<p>You will always get a reply when applying through our system.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGRsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--90eb9e3046c8f22052ecabd60a95dbd4130b6d14/cobiro_image.png"
  },
  {
    "id": "007aec48-b67a-4372-b1bd-44e23eb09a2b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/007aec48-b67a-4372-b1bd-44e23eb09a2b",
    "created_at": "Fri Apr 26 09:02:48 UTC 2019",
    "company": "Zimmer Biomet",
    "company_url": "http://www.biomet.nl/nl-home",
    "location": "Delft",
    "title": "UX Designer",
    "description": "<h2>Job Summary</h2>\n<p>Clinical Graphics is a software company and part of Zimmer Biomet, a globally leading player in products for orthopedic surgery. Clinical Graphics specializes in pre-operative planning and image segmentation software. For example, the Move Forward service provides custom-tailored interactive 3D bone models and patient specific range of motion simulations to orthopedic surgeons by analyzing medical scans of hip joints. Surgeons can see in 3D motion how well a joint moves, and what the effects of surgery may potentially be. Have a look:</p>\n<p><a href=\"https://www.zimmerbiomet.com/medical-professionals/hip-preservation/3d-motion-hip-analysis.html\">https://www.zimmerbiomet.com/medical-professionals/hip-preservation/3d-motion-hip-analysis.html</a></p>\n<p>Reporting to the Project Manager, the candidate will be based in the Clinical Graphics team (Delft). As a UX Designer at Clinical Graphics you will be responsible for designing user-friendly software.</p>\n<h2>Principal Duties and Responsibilities</h2>\n<ul>\n<li>Gather inputs from users and stakeholders (based on business objectives and technical capabilities)</li>\n<li>Creation of UX outputs (user personas, user journeys, user process flows, wireframes/sketches/prototypes, etc)</li>\n<li>Conduct workshops &amp; brainstorming sessions with team members or with users to define design direction and concepts</li>\n<li>Validate prototypes through formative and summative usability tests with surgeons</li>\n<li>Creation &amp; maintenance of Design History Files (DHF) through the product life cycle</li>\n</ul>\n<ul>\n<li>Creation and maintenance of Design and Development Plans</li>\n<li>Determining and documenting the User Needs and Design Inputs</li>\n<li>Performing Design Verification and Design Validation activities and documenting evidence from those activities</li>\n<li>Represent the voice of the user toward the software development team</li>\n</ul>\n<h2>Expected Areas of Competence</h2>\n<ul>\n<li>Experienced and up to date with UX design methods and tools</li>\n<li>Full working knowledge of and moderate level of experience with new product development and maintenance of existing products</li>\n<li>Shows ability to balance Product Management, Software Development and Design requirements to meet project requirements</li>\n<li>Demonstrated ability to methodically investigate, determine appropriate solution and resolve problems using current technology</li>\n<li>Professional, concise, tactful and sensitive in communications. Accomplishes objectives when communicating with internal personnel, and external customers and vendors.</li>\n</ul>\n<h2>Education/Experience Requirements</h2>\n<ul>\n<li>Minimum B.S. degree in one of the following engineering disciplines, 3-5 years of experience: Industrial Design, Mechanical Engineering, Biomedical Engineering or Aerospace Engineering</li>\n<li>Medical device, particularly Orthopedic industry, experience preferred</li>\n<li>English (business fluent); Dutch (business fluent preferred)</li>\n</ul>\n<h2>Travel Requirements</h2>\n<p>Up to 10% international travel will be required, including weekend travel</p>\n<h2>Interested</h2>\n<p><a href=\"https://zimmerbiomet.redirect.your-jobresponse.com/ux_designer_delft/247345/V819/solliciteren\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://zimmerbiomet.redirect.your-jobresponse.com/ux_designer_delft/247345/V819/solliciteren\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--984b726022e5d32df4400d7dde208457a9bb768e/Zimmer%20Biomet.png"
  },
  {
    "id": "d0e2888b-345a-4616-833a-3f1f51adc728",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d0e2888b-345a-4616-833a-3f1f51adc728",
    "created_at": "Thu Apr 25 22:18:43 UTC 2019",
    "company": "Avendra",
    "company_url": "http://www.avendra.com",
    "location": "Irvine",
    "title": "Full Stack Web Engineer / .NET ",
    "description": "<h2><strong>Full Stack Web Engineer / .NET</strong></h2>\n<h2><strong>About Aramark:</strong></h2>\n<p><strong>Aramark</strong> (NYSE: ARMK) proudly serves Fortune 500 companies, world champion sports teams, state-of-the-art healthcare providers, the world’s leading educational institutions, iconic destinations and cultural attractions, and numerous municipalities in 19 countries around the world.  Our 270,000 team members deliver experiences that enrich and nourish millions of lives every day through innovative services in food, facilities management and uniforms. We operate our business with social responsibility, focusing on initiatives that support our diverse workforce, advance consumer health and wellness, protect our environment, and strengthen our communities.  Aramark is recognized as one of the World’s Most Admired Companies by FORTUNE, as well as an employer of choice by the Human Rights Campaign and DiversityInc. Learn more at <a href=\"http://www.aramark.com\">www.aramark.com</a> or connect with us on Facebook and Twitter.</p>\n<h2><strong>About Avendra:</strong></h2>\n<p><strong>Avendra</strong> is North America’s leading hospitality procurement services provider. Avendra was founded in 2001 by hospitality management companies looking to leverage buying power and create efficiencies in supply chain management. Acquired by Aramark in 2017, Avendra now manages supplier contracts and sourcing responsibilities for Aramark businesses in North America, other group purchasing organizations owned by Aramark, as well as our traditional hospitality clients. We combine years of hospitality expertise, purchasing power, services and software to help customers impact the bottom line, improve operational performance, and better serve guests and customers. Avendra is headquartered in Rockville, Maryland and employs about 400 associates.</p>\n<p><strong>Avendra</strong> develops and operates state of the art eProcurement and supply chain management solutions which enable our company to deliver benefits beyond great savings—impacting the bottom line, improving operational performance and allowing our customers to better serve their guests.</p>\n<p>The scope of your job here will be much broader than you’ll find at other companies – you won’t be pigeon holed into doing just one category of work or learning one technology.  We have a small, nimble eCommerce team that covers the entire spectrum of business analysis, development and operations for our proprietary eProcurement systems.</p>\n<p>We connect thousands of suppliers with thousands of customers, and leverage machine learning, sophisticated data modeling and warehousing to analyze, audit and ensure quality and savings are delivered at every level.</p>\n<h2><strong>About iBuyEfficient:</strong></h2>\n<p><strong>iBuyEfficient</strong>, our proprietary cloud-based purchase order technology provides our customers withan industry leading hub that is always “one click” away from all of their suppliers. This one-stop purchasing solution delivers robust controls to drive down purchasing costs and maximizes performance and profitability for each of our clients.</p>\n\n<h2><strong>About the Role:</strong></h2>\n<ul>\n<li>Develop and maintain the current iBuyEfficient Platform in C# ASP.Net and JavaScript/Typescript</li>\n<li>Design, implement and test API and custom integrations with our customers and supplier partners</li>\n<li>Participate in work related to advanced eProcurement &amp; eCommerce technologies including Procure-to-Pay and AP/AR integrations</li>\n<li>Take ownership of all aspects of our software product – architecture, quality, user experience</li>\n<li>Work closely and collaboratively with the iBuyEfficient product development team in implementing customer requirements</li>\n<li>Work with V.P. of Development to architect, design and implement the future state of the platform using modern web frameworks including ReactJS, Typescript, Server-side Rendering, CSS in JS, etc.</li>\n</ul>\n<h2><strong>Environment:</strong></h2>\n<ul>\n<li>60% on-site at Avendra's facility in Aliso Viejo, CA</li>\n<li>40% work from home potential</li>\n</ul>\n<h2><strong>Requirements:</strong></h2>\n<ul>\n<li>5+ years, Professional experience in C#/ASP.Net web development including JavaScript</li>\n<li>A good understanding of OO, design patterns and an interest in other development paradigms (i.e. Functional Programming, Declarative vs. Imperative, etc.)</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Knowledge of agile software development processes and tools like Git, Jenkins, TeamCity and Jira or TestTrack</li>\n<li>Understanding of database concepts / ORM</li>\n<li>Solid understanding of testing, continuous integration and deployment practices</li>\n<li>Self-motivated. Creative. Continuous Learner.</li>\n</ul>\n<h2><strong>Bonus Points:</strong></h2>\n<ul>\n<li>Familiar with Typescript or other typed JavaScript tools</li>\n<li>Familiar with ReactJS or other component-based UI frameworks</li>\n<li>Familiar with responsive design techniques</li>\n<li>Passionate about new technologies, languages, frameworks etc.</li>\n</ul>\n<h2><strong>Technologies We Use:</strong></h2>\n<ul>\n<li>C#, ASP.Net, JavaScript, Typescript</li>\n<li>AWS</li>\n<li>Oracle, RavenDB</li>\n<li>Devart, EntityFramework, LLBLGEN</li>\n<li>KendoUI, Angular, SASS</li>\n</ul>\n",
    "how_to_apply": "<p>To apply, please visit\n<a href=\"https://uscareers-aramark.icims.com/jobs/226052/full-stack-engineer---avendra-%28remote-on-site%29/job\">uscareers-aramark.icims.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczlsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f750dfd48cfc0edcc4c1168a87fc947836ce5d5/logo124.png"
  },
  {
    "id": "36fdf6d6-fbc0-42a3-8036-c19d18072a63",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/36fdf6d6-fbc0-42a3-8036-c19d18072a63",
    "created_at": "Thu Apr 25 21:29:15 UTC 2019",
    "company": "Ritchie Bros.",
    "company_url": "https://www.ritchiebros.com/",
    "location": "Burnaby, BC",
    "title": "Software Developer ",
    "description": "<p>We are looking for Software Developer to join our team in Burnaby, BC.</p>\n<p>The Opportunity:</p>\n<p>The Software Developer’s role is to provide research, design, development and testing of software systems. This includes coding, developing, and documenting technical specifications throughout the project life cycle. Once the system has been deployed the Software Developer will maintain the system as appropriate to assignment. The Software Developer will have knowledge of a variety of computer programming languages and applications. The Software Developer will provide support to other projects where required. The Software Developer will be assigned to projects by the Software Development Manager and work on the project under the direction of a Project Manager as a member of an agile team. Within the Software organization the Software Developer will be member of a small home room team to aid in their development.</p>\n<p>In this role you’ll:\n•Collaborate with architects, programmers and designers in conceptualizing and development of new software programs and applications.\n•Liaise with network administrators and business analysts to assist in resolving problems with software products or company software systems.\n•Analyze and assess existing business systems and procedures.\n•Assist in the definition, development, and documentation of software business requirements, objectives, deliverables, and specifications on a project-by-project basis in collaboration with internal users and departments.\n•Assist in defining software development project plans, including scoping, scheduling, and implementation.\n•Research, identify, analyze, and fulfill requirements of all internal and external program users.\n•Consistently write, translate, and code software programs and applications according to specifications.\n•Write code in Javascript and other languages to enhance functionality and/or performance of company applications as necessary.\n•Design, run and monitor software performance tests on new and existing programs for the purposes of correcting errors, isolating areas for improvement, and general debugging.\n•Administer critical analysis of test results and deliver solutions to problem areas.\n•Provide estimates and status Project Manager.\n•Develop and maintain user manuals and guidelines.\n•Train end users to operate new or modified programs.\n•Install software products for end users as required.\n•Creation and execution of Unit Test Cases.\n•Collaboration with the QA team.\n•Provide effort / time estimates on development tasks.\n•After hours, on-call support is required on a rotational basis.\n•Sundry duties as assigned.</p>\n<p>Here’s what you bring:\n•College diploma or university degree in the field of computer science, information systems, or software engineering or equivalent experience.\n•At least 5 years of software development experience.\n•Experience working in an Agile software development environment.\n•Depending on the position requirements technically fluent in Python, and Javascript.\n•Familiar with database programming languages, including. PostgreSQL, SQL or PL/SQL.\n•Familiar with Couchbase and Kafka.\n•Experience with n-tier design patterns.\n•Familiarity with Test Driven design.\n•Knowledge of current Internet technologies; web application design and integration experience.\n•Hands-on software troubleshooting experience.\n•Experience with XML, JSON and web services architectures.\n•Experience with Git or other similar source control tools.\n•Ability to work in a project focused multi-disciplined team.\n•Proven analytical and problem-solving abilities.\n•Must be able to learn, understand, and apply new technologies.\n•Strong written and oral communication skills.\n•Strong interpersonal skills.\n•Customer service skills an asset.\n•Highly logical; Highly self motivated and directed.\n•Keen attention to detail.\nThis job will require you to:\n•Occasional ability to work from home.\n•Occasional on-call availability.\n•Occasional evening and weekend work to meet deadlines.\n•Dexterity of hands and fingers to operate a computer keyboard, mouse, and to handle other computer components.\n•Lifting and transporting of moderately heavy objects, such as computers and peripherals.\n•Some travel may be required for the purpose of off-site software and system applications management, and meetings.</p>\n<p>What We Offer:</p>\n<p>Our success is built on the drive and dedication of our people. As we grow around the globe, there will be many opportunities to advance your career – we’ve proven this throughout our 60+ years in business. And, we'll take care of you along the way.  Here’s how:\n•Base salary + paid overtime\n•Comprehensive medical and dental benefits.\n•RRSP and an Employee Share Plan, both with company match.\n•Ongoing training, professional development and tuition reimbursement.</p>\n<ul>\n<li>A multi-award winning LEED gold certified facility, in an exceptional park-like setting, featuring: ◦A subsidized, multi-award winning childcare centre.\n◦A subsidized cafeteria, dry cleaning services, and free parking.\n◦A workout facility, featuring advanced gym equipment, bike room, shower and changing facilities, and nutrition and fitness programs.\n◦Proximity to miles of Fraser River walking paths, plus shops, restaurants and services.</li>\n</ul>\n<p>To get an idea of what our auctions are like, you can check out some auction videos on YouTube right here: <a href=\"http://bit.ly/KKL9Fz\">http://bit.ly/KKL9Fz</a>.</p>\n<p>To learn more about the company? Visit our Career site, LinkedIn Or, connect with our recruiters by visiting our Facebook.</p>\n<p>Established in 1958, Ritchie Bros. (NYSE and TSX: RBA) is a global asset management and disposition company, offering customers end-to-end solutions for buying and selling used heavy equipment, trucks and other assets. Operating in a multitude of sectors, including construction, transportation, agriculture, energy, oil and gas, mining, and forestry, the company’s selling channels include: Ritchie Bros. Auctioneers, the world’s largest industrial auctioneer offers live auction events with online bidding;  IronPlanet,, an online marketplace with featured weekly auctions and providing its exclusive IronClad Assurance® equipment condition certification;Marketplacee, an online marketplace offering multiple price and timing options;  Mascus, a leading European online equipment listing service; and Ritchie Bros. Private Treaty, offering privately negotiated sales. The company also offers sector-specific solutions including GovPlanet, TruckPlanet, Kruse Energy Auctioneers, and Cat® auctions, plus equipment financing and leasing through  Ritchie Bros. Financial Services. For more information about the unprecedented choice provided by Ritchie Bros, visit  RitchieBros.com.</p>\n<p>Ritchie Bros. is an equal opportunity employer and ensures nondiscrimination in all activities in accordance with all applicable laws. This position is open to all qualified applicants who are legally entitled to work in the country in which this job is located. Candidate selection is made by Talent Acquisition. Only electronic applications can be accepted. No agency calls please.</p>\n",
    "how_to_apply": "<p>To Apply: Email your resumes to <a href=\"mailto:orusu@ritchiebros.com\">orusu@ritchiebros.com</a></p>\n",
    "company_logo": null
  },
  {
    "id": "a388b17e-eb47-48b3-9a20-fcf68c120a6b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a388b17e-eb47-48b3-9a20-fcf68c120a6b",
    "created_at": "Thu Apr 25 18:12:35 UTC 2019",
    "company": "Dhos Inc",
    "company_url": "http://http",
    "location": "Boulder CO",
    "title": " React.js Developer at DHOS",
    "description": "<p>Why DHOS?</p>\n<p>The DHOS platform is making history by building a decentralized ecosystem designed to minimize the role of intermediaries in services and return lost value to brands and consumers. Systems today are designed in favor of the middlemen who extract fees from services that should be commoditized. By creating an open network that can directly connect consumers and brands.</p>\n<p>We are backed by a VC and several investors. We are on target to launch the MVP.</p>\n<p>RESPONSIBILITIES:</p>\n<ul>\n<li>Building an MVP application based on provided Figma designs</li>\n<li>The designs come with some of the CSS rules and html rules</li>\n<li>You still need to handle layout styles yourself * Teach coworkers new to React, the best practices</li>\n<li>Participate in regular standups for work done and future work planned</li>\n</ul>\n<p>MINIMUM QUALIFICATIONS:</p>\n<ul>\n<li>1 year minimum experience with React/Redux ( we value skill over years)</li>\n<li>Able to provide an example of a React/Redux application you built</li>\n<li>Strong understanding of the Bootstrap 3 and 4 grid system</li>\n<li>Strong understanding of the flux pattern (The Store, reducers, dispatchers)</li>\n<li>Knowledgeable of how to structure large React applications with over 20 views</li>\n<li>Experience using other popular third party React libraries - (Reactstrap, form validation, animation)</li>\n</ul>\n<p>Skills</p>\n<p>React, Redux, Bootstrap, Web Development</p>\n<p>Compensation</p>\n<p>Salary and equity for the right candidate. We'll discuss based on experience.</p>\n",
    "how_to_apply": "<p>Please email your resume and a one sentence description of yourself to <a href=\"mailto:Davidalexandermann@gmail.com\">Davidalexandermann@gmail.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnBsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4b5c8f399de63331055fefd30974530baa523ff/logosolo.JPG"
  },
  {
    "id": "f88decf3-74fa-4e92-a3ac-b9b2b7b2fc26",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f88decf3-74fa-4e92-a3ac-b9b2b7b2fc26",
    "created_at": "Thu Apr 25 17:37:37 UTC 2019",
    "company": "FLIR Systems Ltd. ",
    "company_url": "https://www.flir.com/",
    "location": "Norcross, Georgia",
    "title": "Full Stack Web Developer",
    "description": "<p>FLIR Integrated Imaging Solutions (IIS), a division of FLIR systems, is one of the world’s leading manufacturers of machine vision digital cameras. Our cameras are vital components in the fast growing, transformative industries of robotics, autonomous vehicles, industrial automation, virtual reality, medical/life sciences and retail analytics.</p>\n<p>We are looking for a Full Stack Web Developer with strong UI design and RestAPI services experience.  The primary role of this position is to build and maintain a suite of IoT devices, a cloud based web application and create user friendly workflows apps. The developer chosen will work alongside embedded engineers and application engineers to improve product capabilities and stability.  Willingness to cross into other environments is desired.</p>\n<p>Detailed Description:</p>\n<ul>\n<li>Follow the Agile Development Processing including:Daily stand up meetings, Ticket creation, Weekly backlog grooming and ticket pointing</li>\n<li>Design new product screens based on requirements</li>\n<li>Build and maintain the product UI for a suite of cameras running different hardware</li>\n<li>Enhance and maintain the RestAPI</li>\n<li>Create and maintain automated tests</li>\n<li>Build machine maintenance</li>\n<li>Collaborate well in a team environment</li>\n</ul>\n<p> \nRequirements:</p>\n<ul>\n<li>5+ Years of web application development experience</li>\n<li>Experience with JavaScript, HTML &amp; CSS, Nodejs, Python, JSON &amp; XML, RestAPI Standards,</li>\n<li>Experience with Agile + Jira</li>\n<li>Experience with Source Code Control – Git</li>\n<li>Experience in the Linux environment</li>\n</ul>\n<p>Preferred Skills/Experience:</p>\n<ul>\n<li>Experience with the following are assets: Angular or React, Networking Experience (TCP, UDP, Ports, Firewall, etc.), Linux Installation Package Creation – OPKG, Linux Yocto Project / Embedded Linux, C++, C, Java or C#, Bash Scripting, IoT Experience, Video Analytics / Stereo Vision, AWS Cloud, MySQL, MS SQL, Postgres</li>\n</ul>\n<p>FLIR and all our employees are committed to conducting business with the highest ethical standards. We require all employees to comply with all applicable laws, regulations, rules and regulatory orders. Our reputation for honesty, integrity and high ethics is as important to us as our reputation for making innovative sensing solutions.</p>\n<p>FLIR is an equal opportunity employer.</p>\n",
    "how_to_apply": "<p>Apply online at: <a href=\"https://flir.wd1.myworkdayjobs.com/en-US/flircareers/job/US---Norcross-GA/Web-Application-Developer_REQ11784\">https://flir.wd1.myworkdayjobs.com/en-US/flircareers/job/US---Norcross-GA/Web-Application-Developer_REQ11784</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmxsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2137211c499919400a0ffeb15cadd2ff1f4d95ef/FLIR_Logo-only.jpg"
  },
  {
    "id": "d309e307-6675-4bdc-80bd-b597cdea7756",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d309e307-6675-4bdc-80bd-b597cdea7756",
    "created_at": "Thu Apr 25 14:40:28 UTC 2019",
    "company": "EverQuote",
    "company_url": "http://everquote.com/careers/",
    "location": "Cambridge",
    "title": "Senior Software Engineer",
    "description": "<p>EverQuote is seeking a strong software engineer who is able to provide exceptional technical skills and become a solid contributor to our team as they rebuild the current code base and transition to a microservices architecture. This team is responsible for the realization of our new remarketing strategy, which drives nearly 50% of the company’s revenue. You will updating our current remarketing infrastructure using more modern methods, python microservices and containerization technology (Docker,Kubernetes) in the Google cloud.</p>\n<p>The role offers you the opportunity to work on systems involving large and complex data sets, high-volume traffic, and near-real-time feedback. Our Software Engineers work closely with analytics stakeholders inside the company to understand business problems, to design &amp; propose efficient solutions for those problems, and to effectively translate those ideas into correct, clean, and maintainable code.</p>\n<p><strong>Technologies used:</strong> Python on Linux platforms, MySQL, Amazon Web Services, Google Cloud Platform, DataBricks.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Build and extend remarketing and analytics systems, to improve consumer engagement and -performance</li>\n<li>Collaborate closely with acquisition teams and data scientists to develop and automate remarketing strategies</li>\n<li>Design and implement new features for various Python-based services &amp; platforms</li>\n<li>Improve robustness of business operations and technical platforms via reporting, monitoring, and alerting</li>\n<li>Analyze, debug, and resolve operational issues on our production systems</li>\n<li>Drive strategic thinking about how to evolve online marketing opportunities available to us</li>\n</ul>\n<p><strong>You Have:</strong></p>\n<ul>\n<li>2+ years experience as a software engineer in a fast paced, data driven environment</li>\n<li>Solid computer science fundamentals, including algorithms, data structures, optimization, threading</li>\n<li>Experience working with and open source language (ideally Python) &amp; SQL on Linux, and with big data platforms</li>\n<li>Able to translate ideas into correct, efficient, and reliable code solutions</li>\n<li>Strong skills at understanding, analyzing, and debugging complex problems and/or systems</li>\n<li>Great teamwork skills; willingness to both learn and mentor</li>\n<li>Entrepreneurial mindset; sense of urgency and accountability</li>\n<li>Deep Interest in online business and learning how to drive engineering solutions to solve business problems</li>\n</ul>\n<p><strong>Why EverQuote?</strong></p>\n<ul>\n<li>We are one of the fastest growing companies in Boston history</li>\n<li>We recently completed our IPO and are looking for the next generation of leaders to push us forward as a public company</li>\n<li>Even as we’ve become a public company, we’re committed to maintaining our “startup feel,” (but with none of that startup anxiety)</li>\n<li>We employ completely data-driven decision-making</li>\n<li>We encourage creative thinking, independent responsibilities for business results &amp; team collaboration</li>\n<li>Lunch catering to the office, company outings to local restaurants, day trips, and more</li>\n<li>We offer competitive salaries, excellent benefits, stock, and a relaxed &amp; flexible work environment</li>\n<li>We have lives outside of work. We are musicians, athletes, filmmakers, gamers, authors, and more</li>\n</ul>\n<p><em>EverQuote (Nasdaq: EVER) makes insurance shopping easy, efficient and personal, saving consumers and insurance providers time and money.  We operate the largest online marketplace for insurance shopping in the United States. Our goal is to reshape insurance shopping for consumers and improve the way insurance providers attract and connect with customers as insurance shopping continues to shift online.</em></p>\n",
    "how_to_apply": "<p>Apply directly here: <a href=\"https://app.jobvite.com/j?cj=oiCI9fwv&amp;s=github\">https://app.jobvite.com/j?cj=oiCI9fwv&amp;s=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d8b7e62e6e322edefc9c2402c410715c481bf9/neat_color_hi-res-510%20(3).png"
  },
  {
    "id": "2acfdd6c-4adf-41c3-be50-1ca3aada9624",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2acfdd6c-4adf-41c3-be50-1ca3aada9624",
    "created_at": "Thu Apr 25 02:31:38 UTC 2019",
    "company": "CircleCI",
    "company_url": "http://www.circleci.com",
    "location": "London",
    "title": "Solutions Engineer",
    "description": "<p>As a Solutions Engineer at CircleCI, you will be the customer’s trusted technical advisor throughout the sales process. You’ll provide hands-on support for cloud-based and single tenant deployment and product guidance with CircleCI’s largest customers.</p>\n<p>*This is a remote role based in London.</p>\n<p><strong>About Sales Solutions at CircleCI</strong></p>\n<p>Our Solutions Engineers have a strong understanding of the developer community and are able to confidently communicate with and provide first class support to developers, DevOps leads, and architects.</p>\n<p><strong>About CircleCI</strong></p>\n<p>CircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.</p>\n<p>We run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Serve as the technical lead and owner of technical deal strategy</li>\n<li>Collaborate with Account Executive to identify and uncover customer business goals, needs, and pains, and work to show how CircleCI can address them</li>\n<li>Lead the technical implementation and day-to-day management of CircleCI Demonstrations and * Trials, integrated into our customer’s technology stack - ensuring early customer success and a long-term business relationship</li>\n<li>Prove the technical feasibility of the CircleCI platform to highly technical and developer audiences</li>\n<li>Stay on top of industry news, technology products, platforms, new CircleCI features, and partners to ensure you and your team provide and maintain a deep industry and ecosystem expertise</li>\n<li>Identify areas of potential improvement in our sales efforts, and then work to improve them. This could be high level strategy, daily tactical efforts, or down in the weeks of creating documentation or how to videos</li>\n<li>Custom development and launch of new sales products and customer integrations to our internal teams and customer community</li>\n<li>Partner closely with our customer success teams to ensure continuity of an amazing customer experience - for life</li>\n<li>Collaborate closely with Product and Engineering teams to help influence product roadmap based on market/customer requirements</li>\n<li>Provide technical responses to RFPs and RFIs</li>\n</ul>\n<p><strong>What we’re looking for:</strong></p>\n<ul>\n<li>World class presentation skills. You feel comfortable leading presentations and demos of our platform to groups, both technical and non-technical, in-person and virtually</li>\n<li>Work with customers directly to debug common errors without involving an engineer</li>\n<li>You can tie business problems to technical solutions and understand technology value propositions</li>\n<li>Demonstrated and proven capacity to quickly absorb new concepts and technologies</li>\n<li>You have spent a decent amount of time using and scripting *nix</li>\n<li>You know how to work with Git in general and ideally GitHub in particular</li>\n<li>You’ve thrown together an app or two in a high-level programming language</li>\n<li>You believe that the best way for all to succeed is to honestly discuss product and company abilities and limitations with customers. We do not oversell at CircleCI</li>\n<li>Strong ops/infrastructure knowledge, especially networking and security</li>\n</ul>\n<p><strong>Bonus Points:</strong></p>\n<ul>\n<li>Experience with build, test, and deployment automation</li>\n<li>Familiarity with Clojure and/or React/Javascript</li>\n<li>Knowledge of Docker or Linux containers in general</li>\n<li>Experience with popular web app frameworks (e.g. Rails, Django) and/or mobile app development (iOS, Android)</li>\n<li>Experience using and automating a major IaaS like AWS, GCP, or Azure</li>\n<li>Familiarity deploying and debugging distributed systems</li>\n</ul>\n<p>If you’re interested in joining the team at CircleCI, please send a resume and tell us what inspires you and why you think you’re a good fit for the team. If you contribute to an open source project, or have a presence on the web (GitHub, Twitter, YouTube, LinkedIn, etc.) we’d love to hear about it.</p>\n<p>CircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.</p>\n",
    "how_to_apply": "<p>Please apply at:\n<a href=\"https://boards.greenhouse.io/circleci/jobs/4201409002\">https://boards.greenhouse.io/circleci/jobs/4201409002</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTFsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1f41ca1be384260c68ce24521c582738512fc546/circle-logo-horizontal-black%20(1).png"
  },
  {
    "id": "efad4852-ccb8-42ca-abe9-390677d16c63",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/efad4852-ccb8-42ca-abe9-390677d16c63",
    "created_at": "Wed Apr 24 22:01:01 UTC 2019",
    "company": "Kalepa",
    "company_url": "https://kalepainsurance.com",
    "location": "New York",
    "title": "Software Engineer",
    "description": "<p>Kalepa is looking for Software Engineers to lead the development of our world-class software for commercial insurers.</p>\n<p>Software engineers at Kalepa will be solving interesting and challenging problems at the intersection of data pipelines, cutting-edge machine learning models, and robust infrastructure. You will be working in a small team building technology from the ground up with the latest stack.</p>\n<p>Kalepa is a New York based, VC backed, startup building software to transform and disrupt commercial insurance.</p>\n<p>Nearly one trillion ($1T) dollars are spent globally each year on commercial insurance across small, medium, and large enterprises. However, the process for estimating the risk associated with a given business across various perils (e.g. fire, injury, malpractice) is still reliant on inefficient and inaccurate manual forms or outdated and sparse databases. This information asymmetry leads to a broken set of economic incentives and a poor experience for both businesses and insurers alike. By combining cutting edge data science, enterprise software, and insurance expertise, Kalepa will turn real-world data into a complete understanding of risk – leading to more profitable, efficient, and applicant-friendly insurance underwriting. There are many challenging problems to solve in the insurance industry and a massive opportunity to operate it more profitably and effectively.</p>\n<p>Kalepa is led by a strong team with experiences from Facebook, APT (acquired by Mastercard for $600M in 2015), the Israel Defense Forces, MIT, Berkeley, and UPenn.</p>\n<p>About you:</p>\n<ul>\n<li>You enjoy understanding customer business needs and translating them into specifications or code</li>\n<li>You are excited about using a wide set of technologies, ultimately focused on finding the right tool for the job</li>\n<li>You are energized by automating the collection, parsing, reconciliation, and storage of huge volumes of disparate data from a variety of sources</li>\n<li>You want to design a flexible analytics, data science, and AI framework to transform the insurance industry</li>\n<li>You value open, frank, and respectful communication</li>\n<li>You are a proactive and collaborative problem solver with a “can do” attitude</li>\n<li>You have in-depth knowledge of Python, SQL and no-SQL databases, and hands-on experience with Python server-side frameworks</li>\n<li>You have hands-on experience with data analytics and data engineering</li>\n<li>You have experience with AWS infrastructure</li>\n</ul>\n<p>As a plus:</p>\n<ul>\n<li>You have hands-on experience with machine learning algorithms, NLP, and image recognition</li>\n<li>You have familiarity with Spark, Hadoop, and OLAP tools</li>\n<li>You have knowledge of Go and Scala</li>\n</ul>\n<p>What you’ll get</p>\n<ul>\n<li>Work with an ambitious, smart, and fun team to transform a $1T global industry</li>\n<li>Ground floor opportunity – opportunity to build the foundations for the product, team, and culture alongside the founding team</li>\n<li>Wide-ranging intellectual challenges spanning full-stack software development, AI / ML, and strong design</li>\n<li>Competitive compensation package with a significant equity component</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:paul.monasterio@kalepa.co\">paul.monasterio@kalepa.co</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fecb5f19df776f941b2e3305e37dbfb8bf0834a4/Kalepa%20Logo%20No%20Bg.png"
  },
  {
    "id": "f32a993c-3ec5-4cdb-aab5-f58ae27f22a2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f32a993c-3ec5-4cdb-aab5-f58ae27f22a2",
    "created_at": "Wed Apr 24 07:31:07 UTC 2019",
    "company": "BCG",
    "company_url": "https://www.bcg.com/fr-fr/beyond-consulting/bcg-gamma/default.aspx",
    "location": "Paris",
    "title": "Senior or Lead Software Engineer",
    "description": "<p>As a Senior Analytics Software Engineer, you will be responsible for advancing software solutions to support BCG Gamma’s analytics platform and clients.\nYour strong analytical skills and ability to develop innovative problem solving solutions will support mission critical decision analytics for our clients.\nAdditional responsibilities will include developing feature enhancements to our platform, developing industry-leading analytics software solutions and methodologies and provide talks and papers in industry leading conferences on behalf of BCG Gamma.\nWe are looking for talented individuals with a serious commitment to software development, data science, large data analytics and transforming organizations into analytics led innovative companies.</p>\n<p>RESPONSIBILITIES:</p>\n<ul>\n<li>Apply software development practices and standards to develop robust and maintainable software</li>\n<li>Develop abstract analytic models to solve complex problems for decision analysis</li>\n<li>Maintain an active role in every part of the software development life cycle</li>\n<li>Help mentor and guide junior developers</li>\n<li>Guide non-technical teams and consultants in understanding analytics at scale, infrastructure as code and best practices for robust software development</li>\n<li>Optimize and enhance computational efficiency of algorithms and software design</li>\n<li>Design data structures and visualization of results to provide users actionable intelligence and situational awareness of supporting data</li>\n<li>Interact directly with clients on new features for future product releases</li>\n<li>Provide thought leadership to software design and solutions</li>\n</ul>\n<p>REQUIREMENTS:</p>\n<ul>\n<li>Masters Degree in Computer Science, Statistics, Operations Research, or related field</li>\n<li>6 to 12 years of experience in a software development environment</li>\n<li>Proficiency with analytic software programming</li>\n<li>Familiarity with data science methods and scaling data science methods</li>\n<li>Familiarity with the storage, manipulation and management of relational, non-relational and streaming data structures</li>\n<li>Analytic reasoning and complex problem solving involving mathematical programming and big data problems</li>\n<li>Understanding of parallel computing</li>\n</ul>\n<p>TECHNOLOGIES:</p>\n<ul>\n<li>Languages programming: Python, GO, C++, Java, Scala, JavaScript, TypeScript</li>\n<li>DevOps: Docker, Kubernetes, CI/CD, Terraform, unix-based command line</li>\n<li>Full stack development: GraphQL, React</li>\n<li>Data: SQL, Spark, Hadoop</li>\n<li>Data Science and machine learning (Pandas, Scikit learn)</li>\n<li>Deep learning (Tensorflow, Keras etc.)</li>\n<li>Cloud: AWS/Azure/Google</li>\n</ul>\n<p>WORK ENVIRONMENT:</p>\n<ul>\n<li>Fast-paced, intellectually intense, service-oriented environment</li>\n<li>Several positions available, they are located in Gamma European hubs (Paris, London, Germany, Nordics etc.)</li>\n<li>Fluency in local language and English are required</li>\n<li>Expect time spent traveling</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://talent.bcg.com/apply/SearchJobsGamma\">https://talent.bcg.com/apply/SearchJobsGamma</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcU5sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5b567f80e1e1034bfada4751211b9387beb23d2a/BCGGamma_FullColor_RGB.jpg"
  },
  {
    "id": "ccced10f-792f-4e37-97bc-7e1421d2f72c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ccced10f-792f-4e37-97bc-7e1421d2f72c",
    "created_at": "Wed Apr 24 06:34:42 UTC 2019",
    "company": "Univé",
    "company_url": "https://www.vacaturesbijunive.nl",
    "location": "Zwolle",
    "title": "Business Informatie Analist",
    "description": "<p><em>Zin in een nieuwe IT-baan? Kom bij Univé werken als Business Informatie Analist!</em></p>\n<p>Voor het IT businessteam zoeken wij een</p>\n<p><strong>Business Informatie Analist</strong>\nWerk jij graag in een omgeving waar ruimte is voor plezier en oog voor elkaar? Aarzel dan niet en solliciteer!</p>\n<p><strong>De uitdaging</strong>\n<strong>Voorkomen, beperken en verzekeren</strong> heeft een centrale plek in de strategie van Univé. Wij helpen onze klanten risico’s te voorkomen en schade te beperken. En wat we niet kunnen voorkomen f beperken, verzekeren we gewoon goed.</p>\n<p>Als Business Informatie Analist werk je in op DevOps gebaseerde Agile teams en ben je continue bezig om de beloftes aan onze klanten waar te maken. Je vertaalt de vragen van onze businesspartners naar gewenste (IT) oplossingen. Je hebt een belangrijke brugfunctie tussen klantvraag en technische oplossingen, binnen de kaders van onze architectuur. Je overlegt met verschillende belanghebbenden binnen Univé en stemt mogelijkheden af met onze leveranciers.</p>\n<p><strong>Wie ben jij?</strong>\nJij vind het leuk om de link te zijn tussen IT en de business. Als geen ander weet je hoe je de belangen van de verschillende stakeholders bij elkaar brengt. Hierbij komen jouw communicatieve skills goed tot zijn recht. Daarnaast vind je het belangrijk dat er ruimte is voor jouw ambitie en ontwikkeling.</p>\n<p>Verder vinden wij het belangrijk dat je:</p>\n<ul>\n<li>HBO/WO werk- en denkniveau hebt met een relevante vakgerichte opleiding;</li>\n<li>Minimaal 3 jaar werkervaring hebt in een vergelijkbare rol, bij voorkeur op het snijvlak van Business en IT;</li>\n<li>Ervaring hebt met Agile werken;</li>\n<li>Kennis van de verzekeringsbranche en Microsoft Dynamics 365 is een pré.</li>\n</ul>\n<p><strong>Wat bieden wij?</strong>\nWe vragen veel van je. Maar we hebben je ook veel te bieden. Het salaris is maximaal € 62.900,00 bruto per jaar op basis van een 38-urige werkweek (inclusief vakantiegeld, een dertiende maand en exclusief variabele beloning). Een uitdagende functie binnen een dynamische organisatie voor 36-40 uur per week.</p>\n<p>De belangrijkste arbeidsvoorwaarden op een rijtje:</p>\n<ul>\n<li>je krijgt een prima salaris, afhankelijk van je kennis, opleiding en ervaring;</li>\n<li>13e maand;</li>\n<li>Variabele Collectieve Prestatie Beloning van maximaal 9% van het jaarsalaris;</li>\n<li>arbeidsvoorwaardenkeuzesyteem: tijd voor geld of geld voor tijd;</li>\n<li>27 vakantiedagen bij een 38-urige werkweek;</li>\n<li>goede studiekostenregeling;</li>\n<li>prima pensioenvoorziening;</li>\n<li>reiskostenvergoeding voor woon-werkverkeer;</li>\n<li>en natuurlijk: korting op je schade- en zorgverzekeringen bij Univé.</li>\n</ul>\n<p>Het businessteam Marketing &amp; Verkoop heeft een fijne werkplek in Zwolle, vlakbij het station en met gratis parkeren. Thuiswerken of werken in één van onze andere vestigingen behoort tot de mogelijkheden.</p>\n<p><strong>Wie zijn wij?</strong>\n<strong>Werken bij een verzekeraar saai? Niet bij Univé!</strong>\nWij zijn volop in beweging. Wij groeien, zijn ambitieus en willen het verschil maken voor onze leden. Terug naar de kracht van Univé, noemen wij dat. Om dit waar te maken, willen we voorop lopen in technologische ontwikkelingen en investeren wij continu in innovatieve projecten. We hebben afgelopen jaren al concrete stappen gezet met de introductie van onze nieuwe CRM omgeving. Onze ambitie is de dienstverlening aan onze klanten steeds verder te verbeteren waarbij we onze klant altijd uitstekend helpen welke kanaal men ook gebruikt. En altijd zoals je van Univé gewend bent: persoonlijk en dichtbij!</p>\n<p><strong>Overige informatie</strong>\n<strong>Enthousiast?</strong>\nSolliciteer dan direct via de onze <a href=\"https://www.vacaturesbijunive.nl/business-informatie-analist?utm_source=adveronline-vacaturesites&amp;utm_medium=github&amp;utm_campaign=Business-Informatie-Analist\">sollicitatiepagina</a>. Wil je eerst meer informatie over de functie of het proces mail dan naar <a href=\"mailto:recruitment@unive.nl\">recruitment@unive.nl</a>. Wij nemen dan contact met je op.</p>\n<p><strong>Bijzonderheden</strong>\nEen screening maakt onderdeel uit van de sollicitatieprocedure. Een assessment kan onderdeel uitmaken van de sollicitatieprocedure.</p>\n<p><strong>Omdat we zoeken naar mensen die perfect bij ons passen houden we de werving en selectie graag in eigen hand. Wij maken daarom geen gebruik van diensten van uitzendbureaus en/of werving &amp; selectiebureaus.</strong></p>\n<p>Meer informatie over onze arbeidsvoorwaarden en over werken bij Univé vind je op: unive.nl/werkenbij</p>\n<p>Let op: je krijgt altijd automatisch een ontvangstbevestiging via de mail. Krijg je deze bevestiging niet binnen 24 uur, neem dan even contact met ons op.</p>\n",
    "how_to_apply": "<p><strong>Overige informatie</strong>\n<strong>Enthousiast?</strong>\nSolliciteer dan direct via de onze <a href=\"https://www.vacaturesbijunive.nl/business-informatie-analist?utm_source=adveronline-vacaturesites&amp;utm_medium=github&amp;utm_campaign=Business-Informatie-Analist\">sollicitatiepagina</a>. Wil je eerst meer informatie over de functie of het proces mail dan naar <a href=\"mailto:recruitment@unive.nl\">recruitment@unive.nl</a>. Wij nemen dan contact met je op.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDlsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6b8349119229392c8c4d0b2b3169fca1d00eae18/Logo%20Unive%202018.jpg"
  },
  {
    "id": "e4cbbed5-6355-4cac-9064-6148c95887b2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e4cbbed5-6355-4cac-9064-6148c95887b2",
    "created_at": "Tue Apr 23 16:52:32 UTC 2019",
    "company": "Stukent",
    "company_url": "https://www.stukent.com/",
    "location": "Idaho Falls, Idaho",
    "title": "Chief Technology Officer ( CTO / CIO )",
    "description": "<p><strong>What is Stukent?</strong></p>\n<p>Stukent is a digital courseware provider focused on producing first-in-the world simulations and etextbooks to hundreds of thousands of students around the world. Not only does Stukent provide up-to-date textbooks, but hands-on courseware for instructors and students alike. Our mission is to help educators help students help the world. We take pride in our growth (#268 in the Inc. 500), excellent office culture and the development of our employees.</p>\n<p><strong>Job Description</strong></p>\n<p>We are on a tear to build new technologies that our customer base is begging us to create. Over the next few years we plan to launch dozens of applications and we need someone who can help us scale our engineering team to accomplish that. With strong, natural leadership abilities, the CTO will work to lead and motivate a team of ~15 software developers here at Stukent. We are seeking a professional who is confident in their technical abilities and is enthusiastic about teaching others these vital skills. The CTO is someone who will be self-motivating and prone to taking initiative.</p>\n<p><strong>Essential Duties and Responsibilities</strong></p>\n<ul>\n<li>Successfully manage both time-sensitive and long-term projects in a calm and keen manner</li>\n<li>Mentor a team of extremely capable software developers</li>\n<li>Motivate team members to develop exceptional leadership qualities through an expert level of hands-on experience</li>\n<li>Be assertive in implementing new ideas and willing to listen to the creative ideas of others</li>\n<li>Oversee all production by the software developers and hold frequent meetings to continually improve your team</li>\n</ul>\n<p><strong>Knowledge, Skills and Abilities Required</strong></p>\n<ul>\n<li>Degree in Computer Science, Engineering or equivalent; Master’s Degree preferred</li>\n<li>10+ years experience in building and leading engineering teams</li>\n<li>Broad technological expertise that will inspire and encourage creative and unified problem solving</li>\n<li>Experience in coaching and mentoring as you work through difficult problems to achieve high levels of trust with each employee</li>\n<li>Broad knowledge of software engineering languages, frameworks, techniques, etc.</li>\n<li>Strong department leadership skills, including, strategic planning, process development and goal setting</li>\n<li>Good judgement in high stress situations</li>\n<li>Strong knowledge in cloud-based architectures and experience with AWS, GCP, or Azure.</li>\n<li>Experience in building monolithic and web-service based applications at scale.</li>\n<li>Experience with cloud-based messaging architectures which include pub/sub and event-based, and RPC systems.</li>\n</ul>\n",
    "how_to_apply": "<p>Please email your resume and cover letter to: <a href=\"mailto:katharine.juchau@stukent.com\">katharine.juchau@stukent.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGxsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2ad479da4d139435f8cf922ce913c4149e5a3e17/stukent-signature-teal-blue-01.jpg"
  },
  {
    "id": "5621fef7-b591-451f-96bb-26b37ce936df",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5621fef7-b591-451f-96bb-26b37ce936df",
    "created_at": "Tue Apr 23 16:46:49 UTC 2019",
    "company": "KickUp",
    "company_url": "http://www.kickup.co",
    "location": "Philadelphia",
    "title": "Software Engineer",
    "description": "<p>As a Software Engineer at KickUp, you will build the systems that empower teacher growth through data.You will work with a diverse group of engineers, designers, and client success managers, finding new ways to track, plan, and reflect on professional learning. You will own feature development through the whole software lifecycle -- from spec to development to QA to release. You will sharpen your skills as a full-stack developer, getting to work in every part of our stack, from dev-ops through our design system. You will work with the rest of the engineering team to evolve our best practices and bring new technologies and knowledge into our stack</p>\n<p>Skills &amp; Experience:</p>\n<p>2-5 years of professional building web apps and supporting them in production</p>\n<p>1-2 years of professional experience with React, Angular, or Vue</p>\n<p>1-2 years of professional experience with a server-side web framework (such as Django, Ruby on Rails, NodeJS, Laravel, etc.)</p>\n<p>Ability to communicate complex technical ideas in clear and simple language</p>\n<p>Ability to write code that is robust, reusable, and testable</p>\n<p>Experience with Docker, Celery, Amazon ECS, or Redux is a plus</p>\n<p>Bring Your Whole Self:\nWe believe diversity breeds innovation. We're building a product that improves the way all teachers and all students are supported, and to do that well, we need a workforce that’s representative of the users we serve. We are actively looking to add members to our team who will bring diverse backgrounds, new perspectives, and a willingness to challenge us to improve the work we do every day.</p>\n<p>Why you should join KickUp:\nOur mission is to meaningfully engage educators in professional growth. Education is in our team’s DNA, and study after study demonstrates that educators have the single greatest impact on student learning. KickUp exists to help districts grow their teachers through high-quality professional learning and well-coordinated improvement efforts, and your work at KickUp will lead to system-level change in education.</p>\n<p>Our team is humble and sharp, with a unique blend of both mission driven and business smart qualities. Because we offer our clients both software and services, we’re able to build deep relationships and garner deep insight into the needs of our users in order to be a highly user-focused team. We work closely together to share learnings, solve cross-team problems, and maintain a cohesive, small-team feel and community spirit as we grow our organization.</p>\n<p>Our product is a dynamic platform that helps school districts design, coordinate and assess their professional learning activities, giving educational leaders a coherent and actionable picture of their program's effectiveness.  Working at KickUp will give you the chance to create new experiences with a modern stack built on a React-based JavaScript front-end, an API tier written in Django, and deployed via Docker containers.</p>\n<p>Benefits:\nAt KickUp, one of our core values is Balanced Hustle. We believe in flexibility and the importance of recharging—and as a result, offer an unlimited PTO policy. Most of our employees average between 15-18 PTO days per year in addition to 10 paid company holidays.</p>\n<p>We offer flexibility to accommodate daily work preferences by providing options for remote work or varied work hours.</p>\n<p>We offer competitive salaries, stock options in our growing company, and a variety of medical, dental and vision insurance options.</p>\n<p>We provide opportunities for professional growth and offer individual stipends for professional learning opportunities</p>\n<p>Our offices are conveniently located in Old City, Philadelphia with easy accessibility to public transportation, restaurants, and green space.</p>\n",
    "how_to_apply": "<p>Visit our application page to apply: <a href=\"https://grnh.se/224308a02\">https://grnh.se/224308a02</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGRsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--542d11585ecbc0c8ac6c4b3d30c58ade4fcc55f3/runningman.png"
  },
  {
    "id": "ae025a06-3e42-4adc-9ff0-0a1a3fa08452",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ae025a06-3e42-4adc-9ff0-0a1a3fa08452",
    "created_at": "Tue Apr 23 15:28:37 UTC 2019",
    "company": "Metro Markets GmbH",
    "company_url": "https://www.metro-markets.de/",
    "location": "Düsseldorf",
    "title": "Senior JavaScript-Developer - Angular/React (m/f/d)",
    "description": "<p>We combine our passion for innovative technology with decades of experience in B2B business. METRO MARKETS will develop and launch the online B2B marketplace that will change how businesses make purchases online.</p>\n<p><strong>Online marketplaces have never been this awesome.</strong></p>\n<p>To you, coding is not just coding but an opportunity to create awesomeness. You will develop our complex online marketplace from scratch, focusing on the platform’s front-end. You will take charge of the concept build and continuous implementation of new features for our marketplace, ensuring performance optimization by collaborating with amazing colleagues in cross-functional teams.</p>\n<p>Join our team of passionate technology enthusiasts and e-commerce specialists in our brand-new tech company in Düsseldorf!</p>\n<p><strong>You've got</strong></p>\n<ul>\n<li>Plenty of practical experience in front-end development (JavaScript, HTML, CSS)</li>\n<li>Solid knowledge of modern front-end technologies (Angular, React, Vue)</li>\n<li>Experience in collaborating with product owners and strong customer orientation</li>\n<li>Great analytical skills in process optimization and a customer-centered mindset</li>\n</ul>\n<p><strong>We've got</strong></p>\n<ul>\n<li>An innovative product with an incredibly exciting tech stack</li>\n<li>A “greenfield” project – an agile environment with a start-up mentality, no bureaucracy, flat hierarchies and the courage to evaluate new approaches</li>\n<li>An international team in a modern office close to the Rhine river</li>\n<li>If you’re not from Germany – we will help you with your visa and support you with your relocation process</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/e4830f058b01d5a8212979b532fa3f55db4c3e2f/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f633f6369643d36363263393430372d663863622d343032342d613136392d393063316334356463666234266a69643d65373133363333312d383536622d343036382d623635362d393665303639363762653762267069643d35666630353061342d303862622d343536652d386662352d3062316666346465313933332665633d76696577253341706978656c2663623d687474707325334125324625324673332d65752d776573742d312e616d617a6f6e6177732e636f6d253246676f686972696e672d7075626c69632d617373657473253246706978656c2e676966\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=e7136331-856b-4068-b656-96e06967be7b&amp;pid=5ff050a4-08bb-456e-8fb5-0b1ff4de1933&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Fmetro-markets-gmbh-jobs.personio.de%2Fjob%2F106917%23apply\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE5sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3a3eb96871bf8da36b7ea61f28a4ef9a3d54d699/Metro-Markets-Logo.png"
  },
  {
    "id": "d4fd7da0-939f-4692-a8a7-492630793bf8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d4fd7da0-939f-4692-a8a7-492630793bf8",
    "created_at": "Tue Apr 23 13:59:31 UTC 2019",
    "company": "Straumann Group",
    "company_url": "https://www.straumann.com/en/dental-professionals.html",
    "location": "Montréal",
    "title": "Développeur C++ / Software Engineer / Proxy Product Owner",
    "description": "<p><strong>Description de l'entreprise</strong></p>\n<p>Créée en 2007 à Montréal, Dental Wings est une société internationale intégrée au Groupe Straumann et se spécialise dans le domaine des solutions numériques dentaires. Dental Wings emploie plus de 180 personnes à travers le monde. En plus de notre siège social de Montréal, nous avons des bureaux en Allemagne, en France et en Chine.</p>\n<p>Nous offrons un environnement dynamique et agile propice à l’esprit entrepreneurial et au travail d’équipe, des projets stimulants dans une industrie de pointe et la possibilité d’avancement professionnel.</p>\n<p>Nos activités chez Dental Wings incluent la conception, le développement et la fabrication de produits logiciels et matériels destinés aux dentistes et aux laboratoires dentaires.</p>\n<p>Au sein du département R&amp;D hardware, le développeur C++/ Proxy Product Owner participera au développement et à la mise au point des nouveaux modèles de scanners 3D dentaires. Vous aurez l’opportunité de travailler dans une équipe multidisciplinairecomposée de développeurs logiciel, d'électroniciens, d'ingénieurs optiques et mécaniques sur du matériel utilisant les dernières technologies en matière de numérisation 3D de précision (projecteurs et caméras couplés à des algorithmes de reconstruction 3D).</p>\n<p>Sous la supervision du chef d’équipe et en collaboration avec le Product Owner, vous participerez dans un environnement agile à la conception et à l’implémentation de différentes composantes logicielles nécessaires pour piloter les scanners ainsi qu’à l’animation des évènements Scrum auprès de l’équipe de développement.</p>\n<p><strong>Description du poste</strong></p>\n<p>En tant que développeur C++/Proxy Product Owner, vous aurez l'occasion de:__</p>\n<ul>\n<li>Participer au développement logiciel en C++ (80% du temps);</li>\n<li>Participer à l’analyse et à la planification des nouvelles fonctionnalités à implémenter;</li>\n<li>Participer à l’amélioration continue du code;</li>\n<li>Interfacer et supporter le Product Owner auprès de l’équipe de développement en agissant en tant que proxy Product Owner (20% du temps);</li>\n<li>Animer les daily scrums avec le Scrum Master;</li>\n<li>S’assurer du bon déroulement des sprints de développement.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Baccalauréat en informatique ou baccalauréat en génie informatique ou équivalent;</li>\n<li>Solide expérience en développement C++;</li>\n<li>Expérience pertinente de développement en utilisant la méthode Agile Scrum;</li>\n<li>Maîtrise de la programmation orientée objet, parallèle et concurrente;</li>\n<li>Aptitude à analyser des systèmes complexes et à penser à des solutions innovantes;</li>\n<li>Habilité à travailler en équipe et à communiquer clairement avec les différents intervenants;</li>\n<li>Sens des responsabilités et capacité à comprendre et atteindre les objectifs;</li>\n<li>Maîtriser du français, à l’oral et l’écrit;</li>\n<li>Maîtriser de l’anglais, à l’écrit;</li>\n<li>Atout : notions de vision par ordinateur;</li>\n<li>Atout : connaissance de Visual Studio, Git et Redmine.</li>\n</ul>\n<p><strong>Renseignements complémentaires</strong></p>\n<ul>\n<li>Horaire flexible;</li>\n<li>Dîners-conférences;</li>\n<li>Assurances collectives;</li>\n<li>Accessible en transports en commun et près de la station de métro Pie-IX;</li>\n<li>REER avec contribution de l'employeur;</li>\n<li>Journées flottantes;</li>\n<li>Fruits, bagels, cafés et thés gratuits;</li>\n<li>Activités sociales et sportives (soirées de jeux de société, jeux vidéos, hockey, soccer, basket-ball, 5@7, etc..).</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://straumanngroup.redirect.your-jobresponse.com/developpeur_c_software_engineer_proxy_product_owner_montreal/247129/V819/solliciteren\">Postulez maintenant en utilisant le lien\n!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEJsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fd527b7688f75943882ef4a4acefb0121414565e/Straumann%20Group.jpg"
  },
  {
    "id": "f3a42f0e-d8fc-4971-80ae-c9a5a280769a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f3a42f0e-d8fc-4971-80ae-c9a5a280769a",
    "created_at": "Tue Apr 23 13:26:31 UTC 2019",
    "company": "DKV MOBILITY SERVICES Business Center",
    "company_url": "http://www.dkv-euroservice.com/karriere",
    "location": "Ratingen bei Düsseldorf",
    "title": "(Senior) Java Softwareentwickler (m/w/d) für Cloud",
    "description": "<p>Fuhrparks in über 40 Ländern verlassen sich auf unsere smarten und zukunftsweisenden Mobilitätslösungen. Werden Sie Teil eines engagierten und begeisterten Teams, das die gewerbliche Mobilität von morgen europaweit mitgestaltet.</p>\n<h2>Nehmen Sie Einfluss</h2>\n<ul>\n<li>Entwicklung und Betrieb neuer zukunftsweisender Internetanwendungen auf Applikati-onsservern sowie CloudUmgebungen</li>\n<li>Realisierung weiterer Softwarekomponenten an bestehenden JavaSysteme unter An-wendung agiler Arbeitsweisen</li>\n<li>Entwicklung von anspruchsvollen technischen Konzepten und Architekturen auf der Ba-sis aktueller Java- und CloudTechnologien</li>\n<li>Mitarbeit bei der Erstellung funktionaler und technischer Anforderungsbeschreibungen</li>\n<li>Evaluierung neuer Technologien im Umfeld der bestehenden Lösungen</li>\n<li>Mitarbeit bei der Pflege bestehender Applikationen</li>\n</ul>\n<h2>Das macht Sie aus</h2>\n<ul>\n<li>Studium der (Wirtschafts-)Informatik, Wirtschaftsingenieurwesen oder vergleichbare technische Ausbildung mit Berufserfahrung</li>\n<li>Fundierte Kenntnisse in objektorientierter Analyse und Design von Java Anwendungen</li>\n<li>Kenntnisse im Cloud Umfeld und erste Erfahrungen mit Kubernetes, Openshift, Keyclo-ak oder Kafka von Vorteil</li>\n<li>Gute Kenntnisse gängiger Java – Frameworks (Spring, JSF / PrimeFaces, GWT, Hiber-nate, Maven)</li>\n<li>Kenntnisse verschiedener Application Server und Servlet Container (Wildfly, Tomcat) sowie Microservices sowie Test Strategien und – Frameworks (JUnit, Selenium, jmeter)</li>\n<li>Sicherer Umgang mit CI/CD Pipelines, GIT, Jenkins, Artifactory und Sonarqube</li>\n<li>Gute Kenntnisse bei der Verwendung von SchnittstellenTechnologien (REST, SOAP)</li>\n</ul>\n<h2>Davon werden Sie profitieren</h2>\n<p>Bei uns finden Sie beste Voraussetzungen, um Zukunft zu gestalten. Unser internationales Team widmet sich mit Drive neuen Herausforderungen. Sie finden bei uns</p>\n<ul>\n<li>Freiraum für eigene Ideen,</li>\n<li>flexible Arbeitszeiten mit Home-Office und Gleitzeit,</li>\n<li>eine attraktive Vergütung mit leistungsgerechten Boni,</li>\n<li>Möglichkeiten zur Weiterentwicklung</li>\n<li>und viele weitere Extras.</li>\n</ul>\n<h2>Interessiert?</h2>\n<p>Wir freuen uns auf Ihre Bewerbung über den bewerbungsformular.</p>\n<p><a href=\"https://dkv.redirect.your-jobresponse.com/senior_java_softwareentwickler_m_w_d_fuer_cloud_ratingen_bei_duesseldorf/246983/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n<p>Für Ihre Rückfragen steht Ihnen Lisa Pieper unter +49 2102 5517-204 zur Verfügung.</p>\n<h2>DKV Euro Service – DKV MOBILITY SERVICES Group</h2>\n<p>Als führender europäischer Mobilitätsdienstleister widmen wir uns effizienten Mobilitätslösungen zur Steuerung gewerblicher Fuhrparks und bringen Digitalisierung auf die Straße. Zu unserem Portfolio gehören smarte Produkte und Dienstleistungen rund ums Tanken, alternative Antriebsarten, Mautabwicklung, Liquiditätsvorteile und innovative vernetzte Services.</p>\n<p>In unserem Know-how steckt die Kompetenz von mehr als 1.000 Mitarbeiterinnen und Mitarbeitern in 13 Ländern. Der DKV Euro Service ist Teil der DKV MOBILITY SERVICES Group, die 2018 einen Umsatz von 8,6 Milliarden Euro erwirtschaftete. Mit vier Gruppenunternehmen gestalten wir erfolgreich Mobilität: DKV Euro Service, REMOBIS Refund Service, LUNADIS und DKV MOBILITY SERVICES Business Center.</p>\n<p>DKV Euro Service GmbH + Co. KG</p>\n<p>Balcke-Dürr-Allee 3</p>\n<p>40882 Ratingen</p>\n<p><a href=\"http://www.dkv-euroservice.com/karriere\">www.dkv-euroservice.com/karriere</a></p>\n",
    "how_to_apply": "<p><a href=\"https://dkv.redirect.your-jobresponse.com/senior_java_softwareentwickler_m_w_d_fuer_cloud_ratingen_bei_duesseldorf/246983/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2RsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--96c9aeb7316c8a1a6f70f5cd95703b1cb45085a2/DKV.png"
  },
  {
    "id": "c96a9375-1875-4d0f-a0ab-ef061695f67e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c96a9375-1875-4d0f-a0ab-ef061695f67e",
    "created_at": "Tue Apr 23 12:20:06 UTC 2019",
    "company": "SalesSeek",
    "company_url": "https://www.salesseek.com/",
    "location": "London",
    "title": "Full Stack Engineer",
    "description": "<p>Full Stack Engineer</p>\n<p>SalesSeek London, United Kingdom (allows remote)</p>\n<p>css, javascript, react, python, postgresql</p>\n<h2>Job Description</h2>\n<p>We are looking for a full stack engineer to help us to build our products. It's not necessary to be a code ninja nor a top notch programmer, just a good programmer, team worker and a nice, friendly and responsible person.</p>\n<p>We are a successful startup in the Sales &amp; Marketing business which is receiving a great market feedback for its recently launched web app. We are excited to start our new stage of refinements based on customer feedback and would love to count with a passionate engineer to materialise it!</p>\n<h2>Working on</h2>\n<ul>\n<li>Your main responsibility would be converting the design specs into fully working HTML/CSS/JS.</li>\n<li>Product development. We have a long roadmap and you will be heavily involved with developing major new functionality.</li>\n<li>Customer development. You’ll get to see how our customers use the product on a daily basis so you can help fix bugs and improve existing functionality based on real feedback.</li>\n</ul>\n<h2>Skills &amp; Requirements</h2>\n<ul>\n<li>CSS at production level (responsible, cross-browser compatibility...). Ideally for webapps.</li>\n<li>Javascript with React/VueJS</li>\n<li>Python or similar backend language</li>\n</ul>\n<h2>About SalesSeek</h2>\n<p>Start-ups and small businesses need 50% of Enterprise CRM tools and 50% of Enterprise Marketing platforms, but without the cost and integration hassles. That is SalesSeek.\nOur ethos</p>\n<ul>\n<li>People: Enthusiasm is more important than experience</li>\n<li>Business: Sales &amp; Marketing is more about helping customers than beating competition</li>\n<li>Technology: Design led innovation through visualization</li>\n</ul>\n<h2>Location</h2>\n<p>We’re based in London (Chiswick), and remote working is not a problem. The engineering team is spread all across Europe, and we meet several times per year in London.</p>\n<h2>More about us</h2>\n<p>You can visit our website or read our blog.</p>\n<p>Be sure to send us:</p>\n<ul>\n<li>A charming cover letter.</li>\n<li>Links to projects you have worked on, with code samples.</li>\n<li>A full CV.</li>\n<li>A description (going to the low level you want) about the piece of code or task you have done in the past and you are more proud of.</li>\n</ul>\n<p><em>NOTE: No recruiters please!</em></p>\n",
    "how_to_apply": "<p>Email your cover letter and CV to <a href=\"mailto:cesar@salesseek.com\">cesar@salesseek.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0JsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ebe7b86bc1a32048617048c5f1feb92fb5dce684/SalesSeek_Logo_2016_horizontal_K_600px.png"
  },
  {
    "id": "b37b9e79-b712-46da-a8c6-a46d27d1bfa1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b37b9e79-b712-46da-a8c6-a46d27d1bfa1",
    "created_at": "Mon Apr 22 08:38:45 UTC 2019",
    "company": "OP",
    "company_url": "https://op-careers.fi/job/Helsinki-Full-Stack-Developer/525744901/",
    "location": "Helsinki",
    "title": "Full Stack Developer",
    "description": "<p>Oletko tunnistanut kipinän päästä itse kehittämään entistä vaikuttavampia, suuren ihmisjoukon käytössä olevia, arkea helpottavia ratkaisuja? Haluaisitko päästä vaikuttamaan sellaisiin palveluihin, joita todennäköisesti itsekin arkielämässäsi käytät?</p>\n<p>Tulevassa tehtävässä yhdistyvät isot vaikuttamismahdollisuudet, jatkuva työssä kehittyminen ja työkavereilta oppiminen sekä kunnianhimoisten ratkaisujen kehittäminen OP:n yhteisen palvelulupauksen eteen. Työpaikkasi sijaitsee Helsingin Vallilassa.</p>\n<p>OHJELMISTOKEHITTÄJÄNÄ OP:LLA</p>\n<p>OP:n ohjelmistokehittäjänä pääset mukaan rakentamaan muun muassa OP-mobiilia, uudistamaan asuntorahoituksen palveluita sekä digitalisoimaan varainhoitoa. Teemme OP:lla muutosmatkaa, joka mullistaa sekä oman työmme että asiakkaillemme tuottamamme palvelut. Uusi ketterämpi toimintamalli otetaan vaiheittain käyttöön koko organisaatiossa ja siinä vastuu ja vapaus jakautuu kaikille OP:laisille.</p>\n<p>TEHTÄVÄSSÄ MENESTYÄKSESI TOIVOMME SINULTA:</p>\n<ul>\n<li>Kokemusta full-stack kehittämisestä esimerkiksi Java- ja React-ohjelmointikielillä tai vastaavilla teknologioilla</li>\n<li>Kiinnostusta pilviratkaisuihin, esimerkiksi AWS</li>\n<li>Ymmärrystä Agile sekä DevOps periaatteista</li>\n<li>Intoa opiskella uusia ohjelmointikieliä</li>\n</ul>\n<p>MILTÄ TYÖSI JA URASI OP:LLA NÄYTTÄÄ?</p>\n<p>Kun ohjelmistokehittäjiltämme kysyy, mikä työssä on parasta, vastaus löytyy työkavereista. Huippuosaavat kollegat koetaan meillä eniten ammatillista kasvua vauhdittavaksi seikaksi arjessamme. Toisena seikkana kehittymiseen vaikuttaa jatkuva uuden opettelu, kokeileminen ja uusiin teknologioihin panostaminen. Meillä saa ja pitääkin olla valmiina luotaamaan jatkuvasti alan uusia tuulia.\nOhjelmistokehittäjän työ pankkialalla on yhteiskunnallisesti vaikuttavaa. Visiomme on olla johtava ja vetovoimaisin finanssialan yritys Suomessa ja uudistumme jatkuvasti tavoilla, jotka vaikuttavat miljoonien ihmisten arkeen.</p>\n<p>OP on Suomen johtava finanssiryhmä ja alan digitaalisen muutoksen suunnannäyttäjä. Olemme asiakkaidemme omistama, finanssialan suurin työnantaja Suomessa. Ryhmässämme työskentelee yli 12 000 alan ammattilaista, ja tuotamme sekä kehitämme pankki-, varallisuudenhoito-, vakuutus- ja terveydenhoitopalveluita yli neljälle miljoonalle asiakkaallemme.</p>\n",
    "how_to_apply": "<p>Jos innostuit, ilmianna itsesi meille niin tutustutaan! Kysy lisätietoja tehtävästä puhelimitse tai sähköpostitse Johanna Lintuselta, (puh.050 591 9340 tai <a href=\"mailto:johanna.lintunen@barona.fi\">johanna.lintunen@barona.fi</a> ). Jos taas olet näillä puheilla valmis hakemaan tehtävään, lähetä hakemuksesi meille 5.5.2019 mennessä!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFJsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e675f664ff5b9e6500db8663395ecbb892018e0/OP_Pohjola_liikemerkki_RGB_300dpi.jpg"
  },
  {
    "id": "08f065f8-1e25-4e9b-9e72-27d370d367fe",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/08f065f8-1e25-4e9b-9e72-27d370d367fe",
    "created_at": "Mon Apr 22 08:37:09 UTC 2019",
    "company": "OP",
    "company_url": "https://op-careers.fi/job/Helsinki-Lead-Developer/525746701/",
    "location": "Helsinki",
    "title": "LEAD DEVELOPER",
    "description": "<p>Oletko tunnistanut kipinän päästä itse kehittämään entistä vaikuttavampia, suuren ihmisjoukon käytössä olevia, arkea helpottavia ratkaisuja? Haluaisitko päästä vaikuttamaan sellaisiin palveluihin, joita todennäköisesti itsekin arkielämässäsi käytät?</p>\n<p>Tulevassa tehtävässä yhdistyvät isot vaikuttamismahdollisuudet, jatkuva työssä kehittyminen ja työkavereilta oppiminen sekä kunnianhimoisten ratkaisujen kehittäminen OP:n yhteisen palvelulupauksen eteen. Työpaikkasi sijaitsee Helsingin Vallilassa.</p>\n<p>OHJELMISTOKEHITTÄJÄNÄ OP:LLA</p>\n<p>OP:n ohjelmistokehittäjänä pääset mukaan rakentamaan muun muassa OP-mobiilia, uudistamaan asuntorahoituksen palveluita sekä digitalisoimaan varainhoitoa. Teemme OP:lla muutosmatkaa, joka mullistaa sekä oman työmme että asiakkaillemme tuottamamme palvelut. Uusi ketterämpi toimintamalli otetaan vaiheittain käyttöön koko organisaatiossa ja siinä vastuu ja vapaus jakautuu kaikille OP:laisille.</p>\n<p>TOIVOMME SINULTA:</p>\n<ul>\n<li>Vankkaa kokemusta Java-ohjelmoinnista Spring -kehyksessä tai vastaavilla teknologioilla</li>\n<li>Kokemusta tiimin mentoroinnista ja sparrauksesta, sekä halua auttaa muita kehittymään ja  onnistumaan</li>\n<li>Teknistä tuotealusta osaamista, joista esimerkkeinä sovelluspalvelimet (Weblogic, Jboss), VMware, tietokannat, tunnistamisen ratkaisut, palomuurit, verkkoinfrastruktuuri, Batch palvelimet</li>\n<li>Näkemystä arkkitehtuuriratkaisuista</li>\n<li>Kiinnostusta pilviratkaisuihin, esimerkiksi AWS</li>\n<li>Ymmärrystä Agile sekä DevOps periaatteista</li>\n<li>Intoa opiskella uusia ohjelmointikieliä</li>\n</ul>\n<p>MILTÄ TYÖSI JA URASI OP:LLA NÄYTTÄÄ?</p>\n<p>Kun ohjelmistokehittäjiltämme kysyy, mikä työssä on parasta, vastaus löytyy työkavereista. Huippuosaavat kollegat koetaan meillä eniten ammatillista kasvua vauhdittavaksi seikaksi arjessamme. Toisena seikkana kehittymiseen vaikuttaa jatkuva uuden opettelu, kokeileminen ja uusiin teknologioihin panostaminen. Meillä saa ja pitääkin olla valmiina luotaamaan jatkuvasti alan uusia tuulia.\nOhjelmistokehittäjän työ pankkialalla on yhteiskunnallisesti vaikuttavaa. Visiomme on olla johtava ja vetovoimaisin finanssialan yritys Suomessa ja uudistumme jatkuvasti tavoilla, jotka vaikuttavat miljoonien ihmisten arkeen.</p>\n<p>OP on Suomen johtava finanssiryhmä ja alan digitaalisen muutoksen suunnannäyttäjä. Olemme asiakkaidemme omistama, finanssialan suurin työnantaja Suomessa. Ryhmässämme työskentelee yli 12 000 alan ammattilaista, ja tuotamme sekä kehitämme pankki-, varallisuudenhoito-, vakuutus- ja terveydenhoitopalveluita yli neljälle miljoonalle asiakkaallemme.</p>\n",
    "how_to_apply": "<p>Jos innostuit, ilmianna itsesi meille niin tutustutaan! Kysy lisätietoja tehtävästä puhelimitse tai sähköpostitse Johanna Lintuselta, (puh.050 591 9340 tai <a href=\"mailto:johanna.lintunen@barona.fi\">johanna.lintunen@barona.fi</a> ). Jos taas olet näillä puheilla valmis hakemaan tehtävään, lähetä hakemuksesi meille 5.5.2019 mennessä!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEpsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6c41df6b61534b1b99e2f1f311e3ea920f742e9c/OP_Pohjola_liikemerkki_RGB_300dpi.jpg"
  },
  {
    "id": "4f5100f4-9ca5-4a22-95f3-c22bb418c313",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4f5100f4-9ca5-4a22-95f3-c22bb418c313",
    "created_at": "Mon Apr 22 08:35:24 UTC 2019",
    "company": "OP",
    "company_url": "https://op-careers.fi/job/Helsinki-Back-End-Developer/525744201/",
    "location": "Helsinki",
    "title": "BACK END DEVELOPER",
    "description": "<p>Oletko tunnistanut kipinän päästä itse kehittämään entistä vaikuttavampia, suuren ihmisjoukon käytössä olevia, arkea helpottavia ratkaisuja? Haluaisitko päästä vaikuttamaan sellaisiin palveluihin, joita todennäköisesti itsekin arkielämässäsi käytät?\nTulevassa tehtävässä yhdistyvät isot vaikuttamismahdollisuudet, jatkuva työssä kehittyminen ja työkavereilta oppiminen sekä kunnianhimoisten ratkaisujen kehittäminen OP:n yhteisen palvelulupauksen eteen. Työpaikkasi sijaitsee Helsingin Vallilassa.</p>\n<p>OHJELMISTOKEHITTÄJÄNÄ OP:LLA</p>\n<p>OP:n ohjelmistokehittäjänä pääset mukaan rakentamaan muun muassa OP-mobiilia, uudistamaan asuntorahoituksen palveluita sekä digitalisoimaan varainhoitoa. Teemme OP:lla muutosmatkaa, joka mullistaa sekä oman työmme että asiakkaillemme tuottamamme palvelut. Uusi ketterämpi toimintamalli otetaan vaiheittain käyttöön koko organisaatiossa ja siinä vastuu ja vapaus jakautuu kaikille OP:laisille.</p>\n<p>TOIVOMME SINULTA:</p>\n<ul>\n<li>Kokemusta back-end Java-ohjelmoinnista sekä REST -rajapinta kehityksestä</li>\n<li>Teknistä tuotealusta osaamista, joista esimerkkeinä sovelluspalvelimet (Weblogic, Jboss), VMware, tietokannat, tunnistamisen ratkaisut, palomuurit, verkkoinfrastruktuuri, Batch palvelimet</li>\n<li>Kiinnostusta/osaamista microservices-arkkitehtuuriin, avoimiin rajapintoihin ja  pilviratkaisuihin, esimerkiksi AWS</li>\n<li>Ymmärrät Agile sekä DevOps periaatteet ja osaat soveltaa niitä käytäntöön</li>\n<li>Intoa opiskella uusia ohjelmointikieliä</li>\n</ul>\n<p>MILTÄ TYÖSI JA URASI OP:LLA NÄYTTÄÄ?</p>\n<p>Kun ohjelmistokehittäjiltämme kysyy, mikä työssä on parasta, vastaus löytyy työkavereista. Huippuosaavat kollegat koetaan meillä eniten ammatillista kasvua vauhdittavaksi seikaksi arjessamme. Toisena seikkana kehittymiseen vaikuttaa jatkuva uuden opettelu, kokeileminen ja uusiin teknologioihin panostaminen. Meillä saa ja pitääkin olla valmiina luotaamaan jatkuvasti alan uusia tuulia.\nOhjelmistokehittäjän työ pankkialalla on yhteiskunnallisesti vaikuttavaa. Visiomme on olla johtava ja vetovoimaisin finanssialan yritys Suomessa ja uudistumme jatkuvasti tavoilla, jotka vaikuttavat miljoonien ihmisten arkeen.</p>\n",
    "how_to_apply": "<p>Jos innostuit, ilmianna itsesi meille niin tutustutaan! Kysy lisätietoja tehtävästä puhelimitse tai sähköpostitse Johanna Lintuselta, (puh.050 591 9340 tai <a href=\"mailto:johanna.lintunen@barona.fi\">johanna.lintunen@barona.fi</a> ). Jos taas olet näillä puheilla valmis hakemaan tehtävään, lähetä hakemuksesi meille 5.5.2019 mennessä!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEJsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--813794244f1107b9f9e018091761ef05677a85de/OP_Pohjola_liikemerkki_RGB_300dpi.jpg"
  },
  {
    "id": "01256135-8cdb-46a3-a351-bee00a3982d1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/01256135-8cdb-46a3-a351-bee00a3982d1",
    "created_at": "Fri Apr 19 21:28:36 UTC 2019",
    "company": "Trim",
    "company_url": "https://jobs.lever.co/asktrim",
    "location": "San Francisco",
    "title": "Senior Software Engineer (Full Stack)",
    "description": "<p>Trim is a venture backed fintech startup based in San Francisco. Founded with the mission of making people financially healthy at scale, we have saved our users millions of dollars since our founding 4 years ago, and we have just scratched the surface.</p>\n<p>We are looking for a senior full-stack software engineer to lead the development of core features and infrastructure for our product. Engineering is the core of our company. Your work will directly improve the financial health of our users, and will directly affect and be seen by hundreds of thousands of users.</p>\n<p>This position is based in San Francisco and reports to the CTO.</p>\n<p><strong>What will you do?</strong></p>\n<p>-Design, build, deploy, and maintain software across the stack from frontend to backend to infrastructure.</p>\n<p>-Develop, articulate, and prioritize software requirements by working closely with the product, design, growth, and marketing teams.</p>\n<p>-Use data-driven development and decision making to improve the performance, robustness, and scalability of our systems.</p>\n<p>-Invest in tools and automation to scale your impact and improve productivity across the whole team.</p>\n<p>-Teach, mentor and learn from your teammates. Lead and participate in interesting internal tech talks.</p>\n<p>-Support a culture of code quality, documentation, and thoughtful design tradeoffs. Navigate between shipping quickly and long-term maintainability.</p>\n<p><strong>Technologies we use:</strong></p>\n<p>Client: ES6, React, Redux\nServer: Ruby on Rails, Python\nInfrastructure: PostgreSQL, AWS (RDS, ECS, EC2, RDS, S3, Lambda, and others), Redshift, Convox, Docker, Heroku</p>\n<p><strong>Ideal candidates will have:</strong></p>\n<p>-A desire to use their talents to make the world a better place.</p>\n<p>-5+ years of full time, full-stack web application development experience in client-side JavaScript, along with server-side Ruby, Python, and/or JavaScript.</p>\n<p>-Working experience in SQL (data modeling, query analysis and optimization).</p>\n<p>-A deep understanding of the fundamentals of the web.</p>\n<p>-Prior experience at a high-growth, early-stage company.</p>\n<p>-A keen eye for product and user experience.</p>\n<p>-Ability to think critically and independently.</p>\n<p>-Demonstrable interest in learning and adopting new tools and techniques.</p>\n<p><strong>Experience and understanding in some of the following areas:</strong></p>\n<p>-Complex single-page applications</p>\n<p>-AWS architecture</p>\n<p>-PostgreSQL, Redis</p>\n<p>-Websockets</p>\n<p>-Microservices architecture</p>\n<p>-Non-relational databases</p>\n<p>-Large-scale data storage and processing</p>\n<p><strong>Some projects you might work on in your first few months:</strong></p>\n<p>-Lead the full-stack development of a new product that identifies key insights into a consumer’s financial habits and guides them with actionable steps to achieve financial independence.</p>\n<p>-Build a pub/sub layer to allow the frontend to receive real-time backend data updates without polling.</p>\n<p>-Create a data model to measure and identify user income from transaction data.</p>\n<p>-Reduce the size of the React application bundle by enabling code splitting by route.</p>\n<p>-Migrate terabytes of data stored within PostgreSQL to a separate service with its own data store and distinct scaling characteristics.</p>\n<p><strong>Why work at Trim?</strong></p>\n<p>-Work with our high-performing, upbeat, and highly-collaborative team.</p>\n<p>-Move quickly and gain significant ownership over your results.</p>\n<p>-Commute easily to our office at 14th and Market St. in San Francisco.</p>\n<p>-Competitive salary and equity compensation.</p>\n<p>-Full benefits, including top-tier medical, dental, and vision insurance.</p>\n<p>-Standard start-up perks: catered lunches, delicious snacks, and a variety of succulents.</p>\n<p>We are committed to a workplace that reflects the users we serve. We especially encourage women, people of color, and others who are underrepresented in the tech industry to apply.</p>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/asktrim/66699338-76fb-4879-b15d-a78071b69d8f\">https://jobs.lever.co/asktrim/66699338-76fb-4879-b15d-a78071b69d8f</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2hsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ba5b13eb00dfb6566957b576df77e55f58a5ea34/85ddf465-4040-40ba-97cc-7877bbdfcaac-1508621758787.png"
  },
  {
    "id": "55824831-6a88-4416-90ec-e783a6d9d8b6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/55824831-6a88-4416-90ec-e783a6d9d8b6",
    "created_at": "Fri Apr 19 16:00:24 UTC 2019",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "location": "Austin, TX",
    "title": "macOS Developer",
    "description": "<p>Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.</p>\n<p>We believe that hard work, a fun environment, creativity, and innovations fuel the ultimate customer experience. We believe each customer interaction is an opportunity to delight, engage, and inspire – and that by focusing on the smallest of details, we can make big impacts with our customers.</p>\n<p>Join Apple’s Customer Systems team as a macOS Engineer. Our team builds immersive solutions helping customers engage with Apple through sales, support, and retail. The ideal team member will be able think outside of the box and demonstrate real passion for intuitive user experience.</p>\n<p>Key Qualifications:</p>\n<ul>\n<li>Extensive experience developing macOS/iOS applications using Swift</li>\n<li>Fluent in object-oriented design, industry standard methodologies, software patterns and architecture principles</li>\n<li>Experience working on multiple overlapping releases with shared codebases</li>\n<li>Experience with XCTest or OCUnit, GIT and Jenkins</li>\n<li>Validated understanding of macOS UI/UX principles</li>\n<li>Experience integrating with databases (SQL) and rest-based services (XML, JSON)</li>\n<li>Background in developing modular, extensible or plugin-based applications helpful</li>\n<li>Prior experience with streaming media systems, chat, or telephony platforms would be helpful</li>\n<li>Experience with machine learning a plus</li>\n</ul>\n<p>Description:\nAs a successful member of Contact Center Technologies team, you will be working on desktop applications used by thousands of advisors across the globe. You will be responsible for building products and working with partners to define roadmaps. Innovation will be key to ensure all new features are optimized for experience and efficiency in a timely manner. We’re looking for someone with the insight and innovation to develop new features to improve the desktop experience and the passion to bring those features to life.</p>\n<p>This position requires a self-motivated individual with strong problem-solving and communication skills. You will be expected to dive in and take ownership of a technology or problem space: You will be the expert and go-to person for your areas of support.</p>\n<p>Education:\nMasters or Bachelor’s degree in Computer Science / Software Engineering / Related field</p>\n<p>Additional Requirements:</p>\n<ul>\n<li>4+ years of experience in the software industry</li>\n<li>Excellent problem solving, critical thinking and communication skills</li>\n<li>Good sense of UI design and user-oriented focus</li>\n<li>Experience with testing frameworks, continuous integration and build tools</li>\n<li>Ability to motivate, mentor and lead geographically distributed teams</li>\n<li>Ability to thrive in a cross-functional team on high profile, critical projects</li>\n<li>Self-driven individual with excellent time and project management skills; Agile software development experience a plus</li>\n<li>Ability to stay focused and prioritize a heavy workload while achieving extraordinary quality</li>\n</ul>\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n<p>REQUISITION NUMBER: 200045456\nCOMPANY NAME: Apple Inc.</p>\n",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=338d7d8087037e028bd733f10f8aabc5\">Apply here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1psIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d16be0d0a81cbae592e69ec86f961ac5027e3c15/Apple_300x300.jpeg"
  },
  {
    "id": "0912feb1-a6aa-4714-85b4-1c906d6b1450",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0912feb1-a6aa-4714-85b4-1c906d6b1450",
    "created_at": "Fri Apr 19 08:57:49 UTC 2019",
    "company": "Marketer Technologies",
    "company_url": "http://marketer.tech",
    "location": "Oslo, Norway",
    "title": "Senior Ruby Developer",
    "description": "<p>We are looking for highly passionate and experienced Ruby on Rails developers to join the biggest and fastest growing AdTech company in Norway</p>\n<p>Marketer Technologies is a Norwegian start-up with a mission to simplify the marketing efforts of businesses and improve their results - through a combination of the latest technology and marketing experts.</p>\n<p>We offer a platform, where the user can order high quality digital marketing campaigns across multiple channels (Facebook, Instagram, Google and more), just by choosing what they want to promote - our advanced systems and marketing experts will handle the rest. It’s like having a marketing agency right in your pocket - only much, much better.</p>\n<p>Behind our pretty, customer facing interface, our main emphasis is backend, and at its heart we have Ruby; this is our passion and we intend to continue using it for the foreseeable future. Full test coverage, continuous deployment, autonomous error recovering are our ultimate goals.</p>\n<p>Moreover, we’re about to start the development of a new groundbreaking product.</p>\n<p>Hence, when you become part of our core team, you will get a chance to influence the direction of both the codebase and the product.</p>\n<p>If you are among those who prefer backend over front-end, you will feel right at home.</p>\n<p>What we expect from you</p>\n<ul>\n<li>You consider yourself a senior software engineer, and so do all of your peers.</li>\n<li>You understand that “move fast and break things” is only a good philosophy when what you build is inconsequential.</li>\n<li>You've built at least a handful of websites by now, of which at least one really challenged your software design skills and dealt with more than 10 concurrent users.</li>\n<li>You're excited to break out of an application's code and think about the system as a whole (tweaking nginx configs, thinking about load balancers, worrying about queues and their throughput).</li>\n<li>You are so passionate about your product that you are very protective of your agile code production, your test frameworks and your continuous delivery.</li>\n</ul>\n<p>What we can offer</p>\n<ul>\n<li>Competitive wage</li>\n<li>Health insurance</li>\n<li>Pension plan</li>\n<li>Flexible work hours</li>\n<li>All necessary devices and development tools provided</li>\n<li>Disruptive company culture with talented, fun and inspiring colleagues</li>\n<li>Opportunities for personal growth, learning and enhancing your knowledge, technologies and skills</li>\n<li>Great offices with good quality adjustable workstations, several lounges, meeting rooms and inspiring common areas.</li>\n</ul>\n<p>Key technical stack</p>\n<ul>\n<li>\n<p>Ruby 2.6</p>\n</li>\n<li>\n<p>Rails 6</p>\n</li>\n<li>\n<p>PostgreSQL</p>\n</li>\n<li>\n<p>Redis</p>\n</li>\n<li>\n<p>Sidekiq</p>\n</li>\n<li>\n<p>Heroku</p>\n</li>\n</ul>\n<p>APIs</p>\n<ul>\n<li>\n<p>Facebook APIs (Marketing, Pages, Business and Graph)</p>\n</li>\n<li>\n<p>Google APIs (Ads, Analytics)</p>\n</li>\n<li>\n<p>Various third-party APIs for SMS, email etc.</p>\n</li>\n<li>\n<p>Various CRM APIs for accessing client CRMs/data</p>\n</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:magnus@marketer.tech\">magnus@marketer.tech</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa05sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3571bc258024d27721ee0f94758e245763d5242b/marketer_logo.png"
  },
  {
    "id": "f8666eb5-d11d-4e58-bed2-142136e7d332",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f8666eb5-d11d-4e58-bed2-142136e7d332",
    "created_at": "Thu Apr 18 22:18:31 UTC 2019",
    "company": "ProctorU",
    "company_url": "http://www.proclife.com",
    "location": "Birmingham, AL",
    "title": "Technical Program Manager ",
    "description": "<p><strong>Company Introduction</strong></p>\n<p>Headquartered in Birmingham, AL, ProctorU is the leading authority for online identity and knowledge verification. We help create trust in the knowledge earned online through professional-grade proctoring and multi-factor identity verification. Our premium services are designed to dissuade cheating by combining the benefits of technology, highly-specialized training and personal presence. We administer 2,000,000,000 exams annually with over 1,000 institutions in 129 countries.</p>\n<p><strong>Team Introduction</strong></p>\n<p>Our Product Marketing Team gets to innovate and experiment daily with some of the latest technologies in our industry for a product that is paving the way in our space. We are always looking for opportunities to learn, grow, and have fun with one another. Our team has a fun environment that encourages individuality, collaboration, and creative problem solving.</p>\n<p><strong>Job Description</strong></p>\n<p>As a Technical Program Manager, you are responsible for driving the various teams -both internal and external - for specific ProctorU strategic partners This position is responsible for writing product specifications, creating and executing against the project plan, proactively mitigating risks and managing\nthe lifecycle from inception to production launch and post production support.</p>\n<p>Responsibilities Include:</p>\n<ul>\n<li>Work directly with business and customer stakeholders to define program objectives and requirements.</li>\n<li>Manage program communications internally to teams and externally to partners and stakeholders.</li>\n<li>Prioritize requirements and define scope of the program to meet needs in a timely manner.</li>\n<li>Develop strong customer relationships with key strategic partners. Maintain and\ndistribute standardized program management deliverables for the successful\nlaunch of new products and services, including: project schedule, budget,\nvariances, issues and action items, risks and mitigation plans.</li>\n<li>Partner with internal and external teams to deliver on time and with the quality required.</li>\n<li>Serve as the Product Owner in Agile/SCRUM development process; write user stories, groom\nbacklog as related to program deliverables.</li>\n<li>Partner with Operations and Support teams to identify areas of improvement and increase\ncustomer satisfaction and decrease support requests.</li>\n<li>Anticipate issues and risks, formulate solutions, strategies so as not to impede the\nprogress of the program.</li>\n<li>Ensure cross-team collaboration to support and execute the program requirements.</li>\n<li>Maintain scorecards / reporting to track program performance.</li>\n<li>Accountable for on-time program delivery.</li>\n</ul>\n<p><em>Note that all positions at ProctorU have the opportunity to learn how to Proctor so that all employees contribute to Proctoring efforts during peak cyclical times throughout the year. What better way to fully understand our product than to actually do the job!</em></p>\n<p><strong>Role Qualifications</strong></p>\n<ul>\n<li>Bachelor’s degree\n5+ years of Program Management or Technical Program Management in a technology-oriented organization.</li>\n<li>Track record of successfully launching technology programs with geographically distributed teams.</li>\n<li>Program management skills with the ability to work and track multiple projects simultaneously.</li>\n<li>Demonstrated ability to think creatively and strategically when implementing solutions and solving problems.</li>\n<li>Technically savvy.</li>\n<li>Ability to learn new solutions/products quickly.</li>\n<li>Excellent interpersonal skills and the ability to communicate effectively at all levels within the organization and with both technical and non-technical individuals.</li>\n<li>Experience with Agile Methodologies.</li>\n</ul>\n<p><strong>Why Work for ProctorU?</strong></p>\n<p>We are an innovative, nimble, and driven company with a high level of integrity. We work collaboratively to achieve shared goals which creates an environment of cross functional trust and dependability. And we like to have fun, too! From Holiday parties to celebrating birthdays to video game nights, we make sure to balance the hard work and dedication with some company fun time.</p>\n<p><strong>We also offer great benefits which includes:</strong></p>\n<ul>\n<li>Health, Dental, &amp; Vision Insurance with generous employer funding for employees and dependents</li>\n<li>Flexible Spending Accounts</li>\n<li>Health Savings Account with generous employer funding</li>\n<li>401(k) plan with company matching</li>\n<li>Company-sponsored short-term and long-term disability plans</li>\n<li>Company-sponsored life insurance</li>\n<li>Company-subsidized pet insurance</li>\n<li>Perks program for corporate discounts on a variety of services and items</li>\n<li>Annual stipend (prorated for new hires) for qualified expenses such as student loan debt, gym membership, home gym equipment, child care costs, and/or educational expenses within line of work</li>\n<li>Dog-friendly office</li>\n<li>Casual working environment</li>\n</ul>\n<p>Check us out at <a href=\"http://www.proclife.com\">www.proclife.com</a> and <a href=\"http://www.proctoru.com\">www.proctoru.com</a>!</p>\n",
    "how_to_apply": "<p><strong>Interested? Send us your resume and a quick blurb about why you want to work for us at <a href=\"mailto:recruiter@proctoru.com\">recruiter@proctoru.com</a>!</strong></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajlsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--385009431a0dcf94b51d9a0d7336bac506095526/logo.png"
  },
  {
    "id": "2ff31d82-be42-4f69-aa2f-9ab587435c6c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2ff31d82-be42-4f69-aa2f-9ab587435c6c",
    "created_at": "Thu Apr 18 22:09:56 UTC 2019",
    "company": "ProctorU",
    "company_url": "http://ProctorU",
    "location": "Birmingham, AL",
    "title": "Senior Software Engineer",
    "description": "<p><strong>Company Introduction</strong></p>\n<p>Headquartered in Birmingham, AL, ProctorU is the leading authority for online identity and knowledge verification. We help create trust in the knowledge earned online through professional-grade proctoring and multi-factor identity verification. Our premium services are designed to dissuade cheating by combining the benefits of technology, highly-specialized training and personal presence. We administer 2,000,000,000 exams annually with over 1,000 institutions in 129 countries.</p>\n<p><strong>Team Introduction</strong></p>\n<p>Our Engineering team gets to innovate and experiment daily with some of the latest technologies in our industry for a product that is paving the way in our space. We are always looking for opportunities to learn, grow, and have fun with one another. Our team has a fun environment that encourages individuality, collaboration, and creative problem solving.</p>\n<p><strong>Job Description</strong></p>\n<p>We are looking for a talented individual to join our engineering team in Birmingham, Alabama.  In this role, the Senior Software Engineer is responsible for understanding challenges and issues that could be solved with technology and creating solutions for both staff and institutional partners. The main area of responsibility is to establish clear lines of communication between staff, partners and software engineers: understanding their needs and working to provide a programmatic solution to solve an issue or create a tool to support an unmet need. Senior Software Engineers also serve to support integration partners and have knowledge and experience with the ProctorU API.</p>\n<p><strong>Essential Job Duties Include:</strong></p>\n<ul>\n<li>Communicate with SVP, staff and partners to understand and anticipate needs and project requirements</li>\n<li>Create project milestones, deliverables and timelines for implementation</li>\n<li>Provides leadership, direction, growth, and assistance to Programmers and Software Engineers</li>\n<li>Completes implementation, testing, and documentation of development projects and tasks</li>\n<li>Responsible for QA, testing, documenting, and logging project progress and release</li>\n<li>Arranges project/milestone in programming sequence</li>\n<li>Provides timely project deliverables based on implementation plan</li>\n<li>Prepares reference, documentation, and testing methodologies for applications and related errors</li>\n<li>Provides mentoring and leadership to Software Engineers and Programmers</li>\n<li>Available to QA / review code created by Software Engineers and Programmers</li>\n<li>Tests Base-cases, and outliers</li>\n<li>Assist employees on operation of IT projects and provide first line level of support for bugs, errors, or feature requests</li>\n<li>Attend educational workshops</li>\n<li>Reviewing professional publications</li>\n</ul>\n<p><strong>Other Job Duties Include:</strong></p>\n<ul>\n<li>Special projects and other responsibilities as assigned by leadership</li>\n<li>Maintain relationships and lines of communication with all departments</li>\n<li>Ensure a safe, pleasant and comfortable work environment for all test takers and employees</li>\n</ul>\n<p><em>Note that all positions at ProctorU have the opportunity to learn how to Proctor so that all employees contribute to Proctoring efforts during peak cyclical times throughout the year. What better way to fully understand our product than to actually do the job!</em></p>\n<p><strong>Experience Requirements:</strong></p>\n<ul>\n<li>Education: BS (computer science or related) or in the process of obtaining, MS preferred</li>\n<li>Experience: Min. 4 years’ experience in programming/software development and User Interface design</li>\n<li>Strong eye for detail</li>\n<li>Excellent multitasking and information analysis abilities</li>\n<li>Ability to communicate effectively with customers and employees through all mediums.</li>\n<li>Ability to be responsive, resourceful and adept at problem-resolution</li>\n<li>Ability to achieve positive satisfaction results from customers and employees</li>\n<li>Programming and software algorithm design</li>\n</ul>\n<p><strong>Why Work for ProctorU?</strong></p>\n<p>We are an innovative, nimble, and driven company with a high level of integrity. We work collaboratively to achieve shared goals which creates an environment of cross functional trust and dependability. And we like to have fun, too! From Holiday parties to celebrating birthdays to video game nights, we make sure to balance the hard work and dedication with some company fun time.</p>\n<p><strong>We also offer great benefits which includes:</strong></p>\n<ul>\n<li>Health, Dental, &amp; Vision Insurance with generous employer funding for employees and dependents</li>\n<li>Flexible Spending Accounts</li>\n<li>Health Savings Account with generous employer funding</li>\n<li>401(k) plan with company matching</li>\n<li>Company-sponsored short-term and long-term disability plans</li>\n<li>Company-sponsored life insurance</li>\n<li>Company-subsidized pet insurance</li>\n<li>Perks program for corporate discounts on a variety of services and items</li>\n<li>Annual stipend (prorated for new hires) for qualified expenses such as student loan debt, gym membership, home gym equipment, child care costs, and/or educational expenses within line of work</li>\n<li>Dog-friendly office</li>\n<li>Casual working environment</li>\n</ul>\n<p>Check us out at <a href=\"http://www.proclife.com\">www.proclife.com</a> and <a href=\"http://www.proctoru.com\">www.proctoru.com</a>!</p>\n",
    "how_to_apply": "<p><strong>Interested? Send us your resume and a quick blurb about why you want to work for us at <a href=\"mailto:recruiter@proctoru.com\">recruiter@proctoru.com</a>!</strong></p>\n",
    "company_logo": null
  },
  {
    "id": "165e944b-a47e-4112-8d0b-83300868c7e1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/165e944b-a47e-4112-8d0b-83300868c7e1",
    "created_at": "Thu Apr 18 18:33:28 UTC 2019",
    "company": "OpSourced",
    "company_url": "http://opsourced.com",
    "location": "REMOTE ",
    "title": "DevOps Engineer",
    "description": "<p>OpSourced   |   DevOps Engineer   | Full-Time | REMOTE |  Hiring Junior to Senior Levels</p>\n<p><a href=\"https://opsourced.com\">https://opsourced.com</a></p>\n<p>OpSourced is a team of DevOps Experts providing DevOps-as-a-Service, Lift &amp; Shift Operations, and project based DevOps consulting services for companies around the globe.  We give our customers the ability to reach out to us like they would an internal DevOps team.</p>\n<p>You'll work with all the major cloud providers and on-prem solutions, while managing fleets of instances and containers, along with their automation, orchestration, monitoring, and alert response.  If you've ever wanted to work at a scale that few companies do, you'll find the right challenge here with us!</p>\n<p>Minimum Qualifications :</p>\n<ul>\n<li>\n<p>Proficient in Ruby, Python, Elixir, Java, or Javascript</p>\n</li>\n<li>\n<p>Experience with config management or automation frameworks.  (i.e. Ansible / Terraform / Puppet / Capistrano)</p>\n</li>\n<li>\n<p>Experience maintaining production infrastructure in a Linux Environment.</p>\n</li>\n<li>\n<p>Strong DevOps experience and Customer Service mindset.</p>\n</li>\n<li>\n<p>Self Motivated and Diligent.</p>\n</li>\n<li>\n<p>Ability to participate in on-call/pager rotation.</p>\n</li>\n<li>\n<p>U.S. Residents Only.</p>\n</li>\n</ul>\n<p>Benefits :</p>\n<ul>\n<li>Fully Remote Working (must overlap U.S. East Coast business hours)</li>\n<li>Fully Paid Health / Vision / Dental</li>\n<li>Paid Training</li>\n<li>401k</li>\n<li>Bonus Incentives</li>\n</ul>\n<p>Interested?   Tell us what you can bring to the team by emailing <a href=\"mailto:hiring@opsourced.com\">hiring@opsourced.com</a> !</p>\n",
    "how_to_apply": "<p>Interested?   Tell us what you can bring to the team by emailing <a href=\"mailto:hiring@opsourced.com\">hiring@opsourced.com</a> !</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanRsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8bb075b3db66d8c2297d56a1f62545508a344caa/Just%20OpSourced.png"
  },
  {
    "id": "ec4fd053-c76a-4451-8f02-bdc00e1e4827",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ec4fd053-c76a-4451-8f02-bdc00e1e4827",
    "created_at": "Thu Apr 18 18:28:45 UTC 2019",
    "company": "ShareThis, Inc",
    "company_url": null,
    "location": "Palo Alto, CA, US",
    "title": "DevOps Engineer, Security",
    "description": "<p>About Us:\nShareThis is the world's first-ever sharing intelligence company and provides sharing and content engagement tools to over 5 million publishers. We have a massive amount of consumer data providing us with a unique asset. In the past 4 years, we've scaled our media business to a multi-million dollar business working with fortune 500 companies and now we're building out our data business.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>ShareThis is a big data company running in cloud environments. As a security engineer, you will.</li>\n<li>Own and drive the security initiatives. Working with engineering teams to implement security measures to protect our data and applications in the cloud.</li>\n<li>Work with our IT service provider to cover the needs of system administration.</li>\n<li>Work with HR on on-boarding, off-boarding, computer asset, and inventory management.</li>\n<li>Develop tools for monitoring and managing our infrastructure and applications in AWS cloud.</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>3+ years of DevOps experience with big data platform, docker, kubernetes, spark, public/private cloud</li>\n<li>Knowledgeable in cloud security, work experience is preferred.</li>\n<li>Fluent in scripting languages Python, Bash</li>\n<li>Expert in Linux command line and MacBook laptops</li>\n<li>BS in Computer Science or related fields</li>\n</ul>\n<p>Nice to Have:</p>\n<ul>\n<li>Experience with AWS, EC2, S3 etc.</li>\n<li>Experience with Airflow</li>\n<li>Experience with Spinnaker/Jenkins</li>\n<li>Experience with SQL/NoSQL Database</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jsco.re/2m069\">https://jsco.re/2m069</a></p>\n",
    "company_logo": null
  },
  {
    "id": "8f939117-206a-4588-90a7-551d6761f724",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8f939117-206a-4588-90a7-551d6761f724",
    "created_at": "Thu Apr 18 18:25:04 UTC 2019",
    "company": "ShareThis, Inc",
    "company_url": null,
    "location": "Palo Alto, CA, US",
    "title": "Software Engineer - Full Stack",
    "description": "<p>ShareThis serves traffic on millions of domains and utilizes the traffic to collect data that powers the business. This data allows us to improve our publishers’ experience and power a growing Advertising business. Our services must remain highly available and our data processing has to keep up with terabytes of data and billions of requests daily. We manage our infrastructure with Kubernetes on Amazon EC2, we build web applications and services with javascript and golang, and we process petabytes of data with Spark and BigQuery.</p>\n<p>What You'll Do</p>\n<pre><code>     ◦  Build highly responsive production-ready applications using React.\n     ◦  Architect APIs and services with node.js and MongoDB\n     ◦  Work closely with Amazon and Google big-data technologies such as Dynamo and BigQuery\n     ◦  Develop services that will be used by millions of domains\n     ◦  Work closely on both publisher-facing products and ad technology partner products\n</code></pre>\n<p>What You'll Need:</p>\n<pre><code>     ◦  B.S. Computer Science (Preferred)\n     ◦  Highly experienced with React.js and/or node.js\n     ◦  Expert knowledge of data structures and their practical applications\n     ◦  Experience with BigQuery, DynamoDB, MongoDB, node.js, and React\n</code></pre>\n",
    "how_to_apply": "<p><a href=\"https://jsco.re/2m05h\">https://jsco.re/2m05h</a></p>\n",
    "company_logo": null
  },
  {
    "id": "dbfc02f2-fd77-11e3-9627-a101934ea25e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e",
    "created_at": "Tue Oct 23 16:21:20 UTC 2018",
    "company": "Sharethrough",
    "company_url": "http://Sharethrough",
    "location": "San Francisco or San Jose",
    "title": "Backend Engineering (Scala+)",
    "description": "<p>As an engineer on the Sharethrough Exchange team at Sharethrough, you’ll build out our highly scalable service infrastructure, generating insights used by top publishers and brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi.  You'll be a key contributor to our Scala-based backend services that make thousands of complex, real-time decisions per second possible. Large-scale distributed, high performance = those are the problems you can solve on the team.</p>\n<p><strong>What You'll Be Doing</strong></p>\n<ul>\n<li>\n<strong>Having a say:</strong> You’ll participate in problem definition and solution with a diverse group of engineers, designers and business owners from around the company.</li>\n<li>\n<strong>Proper engineering:</strong> Writing Scala-based pipeline processing and infrastructure that is performant, well-tested, and easy to maintain. We value teamwork and experimentation to achieve the best outcomes.</li>\n<li>\n<strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious distributed system at scale.</li>\n</ul>\n<p><strong>Let's Talk If</strong></p>\n<ul>\n<li>\n<strong>You’ve shipped software:</strong> You have production experience with large-scale distributed systems and are excited to explore new technologies that can push the boundaries of efficiency.</li>\n<li>\n<strong>You care about code:</strong> You take pride in engineering, and have a deep understanding of how to write high quality, maintainable, extensible software in a collaborative environment.</li>\n<li>\n<strong>You like moving quickly:</strong> We push to production on every commit via our  continuous integration and deployment pipeline and value truly immutable infrastructure.</li>\n</ul>\n<p><strong>Why You'll Love Working at Sharethrough</strong></p>\n<ul>\n<li>\n<strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency.  We have a fun, supportive culture, and firmly believe in what we’re doing.</li>\n<li>\n<strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github\">https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c05f76669a8a274c3fae7dc7128d140337838a2/ffeaf00c-0450-4d8f-b620-ef1a1742675c"
  },
  {
    "id": "cdf0581d-1a95-401c-b156-703a521ca06f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cdf0581d-1a95-401c-b156-703a521ca06f",
    "created_at": "Thu Apr 18 15:16:58 UTC 2019",
    "company": "InnoGames GmbH",
    "company_url": "https://www.innogames.com/de/",
    "location": "Hamburg",
    "title": "PHP Backend Team Lead - Elvenar",
    "description": "<p>As PHP Backend Team Lead, you are responsible for leading a team of highly qualified Backend Development experts. You will envision and shape the engineering culture as well as support the team during implementation of new features. Mentoring, coaching and motivating people to deliver excellent quality is one of your main tasks.</p>\n<p><strong>Your mission:</strong></p>\n<ul>\n<li>Contribute to the continuous development and improvement of one of our keystone games</li>\n<li>Be part of the whole feature development lifecycle with a commitment to the focus on quality</li>\n<li>Bring your team to the next level by coaching team members on the job and providing feedback in all directions on a daily basis</li>\n<li>Work closely with our system administrators to keep our game scalable for millions of players</li>\n<li>Make sure that information flows within the team and to other departments</li>\n</ul>\n<p><strong>Your profile:</strong></p>\n<ul>\n<li>5+ years of experience with PHP and knowledge of common frameworks like Symfony or Angular</li>\n<li>Thereof 1+ years in a senior role incl. technical leadership responsibility</li>\n<li>Experience with writing automation test (unit, functional or integration tests)</li>\n<li>Pragmatic and solution-oriented and at the same time focused on the long-term vision</li>\n<li>Well-versed in design patterns and software architecture</li>\n<li>Providing an agile mindset and knowledge of agile frameworks</li>\n<li>Advanced knowledge of relational databases (PostgreSQL) and writing efficient queries that scale with many thousands of users</li>\n<li>Excellent English language skills</li>\n</ul>\n<p><strong>Why join us?</strong></p>\n<ul>\n<li>Shape the success story of InnoGames with a great team of driven experts in an international culture</li>\n<li>Competitive compensation and an atmosphere to empower creative thinking and strong results</li>\n<li>Exceptional benefits ranging from flawless relocation support to company gym, smartphone or tablet of your own choice for personal use, roof terrace with BBQ and much more</li>\n</ul>\n<p>Excited to start your journey with InnoGames and join our dynamic team as a <strong>PHP Backend Team Lead</strong>? We look forward to receiving your application as well as your salary expectations and earliest possible start date through our online application form. <strong>Silja Bernecker</strong> would be happy to answer any questions you may have.</p>\n<p>InnoGames, based in Hamburg, is one of the leading developers and publishers of online games with more than 200 million registered players around the world. Currently, more than 400 people from 30 nations are working in the Hamburg-based headquarters. We have been characterized by dynamic growth ever since the company was founded in 2007. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>\n",
    "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/php-backend-team-lead-elvenar/?s=Github\">https://www.innogames.com/career/detail/job/php-backend-team-lead-elvenar/?s=Github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamxsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--563d32597c9e604a3d5f6aeafc3da86a33ad1835/logo_innogames.png"
  },
  {
    "id": "1ae1ff3f-4394-47e6-981b-f1e8efd35525",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1ae1ff3f-4394-47e6-981b-f1e8efd35525",
    "created_at": "Thu Apr 18 13:35:42 UTC 2019",
    "company": "University of Connecticut",
    "company_url": "http://www.uconn.edu",
    "location": "Storrs Mansfield, CT 06268",
    "title": "Full Stack ASP.NET Software Developer (Onsite with temporary telecommuting potential) - Information Systems Analyst II (UCP VII)",
    "description": "<p>The College of Liberal Arts &amp; Sciences Dean’s Office, at the University of Connecticut in Storrs, CT, seeks applicants for a full-time position as a Software Developer (Information Systems Analyst 2, UCP 7) for the CLAS Shared Services department. You will be part of a small team working on our suite of modern, web-based applications and reporting solutions. Our applications directly contribute to the success of the CLAS mission and are responsible for helping to manage many aspects of the college, including tracking of financial information, staffing planning, grant process management, reporting, and more.</p>\n<p>We are looking for a talented, self-motivated software developer who is interested in the entire SDLC process including requirements gathering, solution design, implementation, testing, and deployments. Our agile workflow, engaged stakeholders, and modern tooling, including one click deployments and automated testing suite, offer a rewarding and organized work environment.\nEach of our custom web applications are written in C# using the ASP.NET framework, Entity Framework ORM; utilizing MVC with single page app interactions to an API on the back end.</p>\n<p>You will be under general supervision of the Senior Software Developer within the College of Liberal Arts and Sciences (CLAS) Shared Services department and will be expected to apply expertise and advanced programming techniques to design, develop, analyze and maintain our applications in order to facilitate and expedite the processing of complex academic and administrative data.</p>\n<p>The University offers great benefits including retirement benefits, health coverage (including dental), good work life balance with flexible scheduling, 35 hour work week, paid holidays, vacation, and sick leave, tuition reimbursement, high end development machines, technology training and learning opportunities, and more.</p>\n<p><strong>DUTIES AND RESPONSIBILITIES</strong></p>\n<ol>\n<li>Work with end users to analyze business, define needs, and create functional requirements to develop application features under the supervision of a senior software developer or manager.</li>\n<li>Designs applications and/or modules within an application, and creates the code for these from functional specifications.</li>\n<li>Analyzes, reviews, and rewrites modules within applications to increase efficiency or adapt to new requirements.</li>\n<li>Analyzes, debugs, and fixes bugs in the code base.</li>\n<li>Confers with supervisor and departmental representatives to resolve questions of program intent, output requirements, and input data acquisition.</li>\n<li>Conducts analysis of administrative needs, recommends solutions, and works with users to refine them.</li>\n<li>Under the supervision of a senior software developer, performs ad-hoc manually testing, as well as creating automated tests to test all functionality of the applications.</li>\n<li>Performs related duties as required.</li>\n</ol>\n<p><strong>MINIMUM QUALIFICATIONS</strong></p>\n<ol>\n<li>Bachelor’s degree in computer-related field and at least two years programming experience OR the equivalent combination of education and experience</li>\n<li>Minimum of two years of experience with .NET (ASP.NET), C#, SQL, LINQ, Entity Framework</li>\n<li>Minimum of two years of experience with web technologies including HTML, CSS, JS, JQuery</li>\n<li>Working knowledge of SQL Server Management Studio and best practices in database design</li>\n<li>Familiarity with source control and project tracking applications</li>\n<li>Demonstrated ability in analytical reasoning and logical problem solving</li>\n<li>Working knowledge of standard desktop applications such as word processors, spreadsheets, and database tools</li>\n<li>Good written and oral communication skills</li>\n</ol>\n<p><strong>PREFERRED QUALIFICATIONS</strong></p>\n<ol>\n<li>Four years of programming experience</li>\n<li>Experience with Agile Development practices</li>\n<li>Experience with KnockoutJS, Angular or other mainstream JavaScript library</li>\n<li>Working knowledge of IIS and automated build procedures</li>\n<li>Working knowledge of WebFOCUS 8</li>\n<li>Experience with TFS, GIT or other source control</li>\n<li>Knowledge of standard software development principles such as with DRY, SOLID</li>\n<li>Knowledge of common software design patterns (MVC, MVVM, Domain Driven Design (DDD))</li>\n<li>Experience with automated functional, unit, and integration testing with frameworks such as NUnit, MSTest, XUnit, etc.</li>\n<li>Experience with automated UI testing using Selenium.</li>\n<li>Ability to independently analyze business requirements and translate them into well-functioning and documented applications.</li>\n</ol>\n<p><strong>APPOINTMENT TERMS</strong></p>\n<p>The University offers a competitive salary, outstanding benefits including employee and dependent tuition waivers, and a highly desirable work environment. There is the possibility for telecommuting arrangements on a temporary basis. The successful applicant must be able to begin work on May 22nd, 2019.</p>\n<p><strong>TO APPLY</strong></p>\n<p>Please apply online using UConn Jobs, <a href=\"http://www.jobs.uconn.edu\">www.jobs.uconn.edu</a>, Staff Positions, please submit a cover letter, resume and contact information for three professional references, please include search number 2019313. Screening will begin immediately and the search will remain open until a suitable candidate is found.</p>\n<p>Employment of the successful candidate is contingent upon the successful completion of a pre-employment criminal background check. (Search 2019313)</p>\n<p>This job posting is scheduled to be removed at 11:59 p.m. Eastern time on May 8, 2019.</p>\n<p>All employees are subject to adherence to the State Code of Ethics which may be found at <a href=\"http://www.ct.gov/ethics/site/default.asp\">http://www.ct.gov/ethics/site/default.asp</a>.</p>\n<p><em>The University of Connecticut is committed to building and supporting a multicultural and diverse community of students, faculty and staff. The diversity of students, faculty and staff continues to increase, as does the number of honors students, valedictorians and salutatorians who consistently make UConn their top choice. More than 100 research centers and institutes serve the University’s teaching, research, diversity, and outreach missions, leading to UConn’s ranking as one of the nation’s top research universities. UConn’s faculty and staff are the critical link to fostering and expanding our vibrant, multicultural and diverse University community. As an Affirmative Action/Equal Employment Opportunity employer, UConn encourages applications from women, veterans, people with disabilities and members of traditionally underrepresented populations.</em></p>\n",
    "how_to_apply": "<p>Please apply online using UConn Jobs, <a href=\"http://www.jobs.uconn.edu\">www.jobs.uconn.edu</a>, Staff Positions, please submit a cover letter, resume and contact information for three professional references, please include search number 2019313. Screening will begin immediately and the search will remain open until a suitable candidate is found.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31d7edafab0b84096a52203b3581afe1bf19e277/university-of-connecticut-squarelogo-1454002930756.png"
  },
  {
    "id": "49507125-7455-486d-acc2-472b62d3f7ac",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/49507125-7455-486d-acc2-472b62d3f7ac",
    "created_at": "Wed Apr 17 23:30:25 UTC 2019",
    "company": "ShareThis, Inc",
    "company_url": null,
    "location": "Palo Alto, CA, US",
    "title": "Principal/Staff Data Engineer",
    "description": "<p>ShareThis is a big data company that owns online behavioral data of over one billion users globally. We are developing an audience intelligence platform with cutting edge data science technologies. We are looking for innovative machine learning engineers to join our exciting projects.</p>\n<p>You will drive the development of machine learning pipelines for model building and advertising segment generation. You will also help provide the vision of our team and serve as a mentor to less experienced engineers.</p>\n<p>What You'll Need</p>\n<ul>\n<li>MS or PhD in Computer Science or related field</li>\n<li>8+ years of experience writing code in Scala/Java/C++</li>\n<li>2+ years of industry experience in machine learning</li>\n<li>2+ years of industry experience in Scala</li>\n<li>Superior knowledge of Spark, MapReduce, HDFS, Cassandra, and Kafka</li>\n<li>Excellent knowledge of algorithms and data structures</li>\n</ul>\n<p>Nice to Have:</p>\n<ul>\n<li>Previous experience in the advertising industry</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Enthusiasm for working hard and having fun in a dynamic environment</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jsco.re/2lx6g\">https://jsco.re/2lx6g</a></p>\n",
    "company_logo": null
  },
  {
    "id": "deb8f0ea-cf20-44c9-9685-eed254d7b65f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/deb8f0ea-cf20-44c9-9685-eed254d7b65f",
    "created_at": "Wed Apr 17 22:14:48 UTC 2019",
    "company": "Stride Health",
    "company_url": "http://www.stridehealth.com",
    "location": "San Francisco",
    "title": "Sr. Software Engineer - Front End",
    "description": "<p>About the Role--\nStride Health seeks a Sr. Software Engineer to help shape its bright future!  We're a high-energy, tight-knit  team that's empowering consumers to make decisions about their health coverage in a way unparalleled by anyone else. We are committed to hitting bold technological and revenue goals. That's where you come in.</p>\n<p>Responsibilities--\nYou will be responsible for full stack, hands-on development of applications and services. As a senior member of the team, you will be expected to participate in system design discussions and provide thought leadership in the full development lifecycle from concept to production.</p>\n<p>Qualifications/ Must-Haves --</p>\n<ol>\n<li>4+ years of professional application development experience and knowledge of what it takes to build and deploy your own application</li>\n<li>Full-stack software development experience, with a strong focus and background in React, Javascript, Redux, HTML5, CSS3</li>\n<li>Experience building responsive and cross-browser compatible web applications with a strong UI focus</li>\n<li>Good understanding of responsive web design best practices and web performance optimization techniques</li>\n<li>Proficiency in Python or Node JS for backend development is a HUGE plus</li>\n<li>BS/BA degree in Computer Science, Software Engineering or other Technical Discipline or equivalent professional experience</li>\n</ol>\n<p>About Company --\nWe help people who work for themselves save time and money on things like insurance and taxes by providing simple, easy to use software, tools and services. The world’s largest work-for-yourself platforms like Uber, Etsy, Airbnb, Instacart, Postmates, Rover, TaskRabbit, Care.com, and others use Stride to help recruit, retain and motivate their communities of independent workers.</p>\n<p>We're located in the heart of San Francisco's South Park district and we’re backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.</p>\n<p>Come help us take the work out of working for yourself!</p>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/stridehealth/742254b9-7c20-410e-b616-50f62af46205\">https://jobs.lever.co/stridehealth/742254b9-7c20-410e-b616-50f62af46205</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cbe898fffefb0fbf5801bda7328b9fa335db3b87/Stride.jpg"
  },
  {
    "id": "663d8bed-9e7b-4901-9fff-4653edf56cef",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/663d8bed-9e7b-4901-9fff-4653edf56cef",
    "created_at": "Wed Apr 17 22:10:16 UTC 2019",
    "company": "Stride Health",
    "company_url": "http://www.stridehealth.com",
    "location": "San Francisco",
    "title": "Software Engineer",
    "description": "<p>About the Role--\nStride Health seeks a Software Engineer to help shape its bright future!  We're a high-energy, tight-knit  team that's empowering consumers to make decisions about their health coverage in a way unparalleled by anyone else. We are committed to hitting bold technological and revenue goals. That's where you come in.</p>\n<p>Responsibilities--\nYou will be responsible for full stack, hands-on development of applications and services. As a member of the team, you will be expected to participate in system design discussions and provide thought leadership in the full development lifecycle from concept to production.</p>\n<p>Qualifications/ Must-Haves</p>\n<ol>\n<li>1-2 years of experience building backend in Python</li>\n<li>Experience with a python web framework such as Flask or Django</li>\n<li>Experience with both relational database systems (Postgres)</li>\n<li>Familiarity with automating infrastructure tasks in Python</li>\n<li>Experience with AWS, especially EC2, networking (VPCs, etc.), and RDS is a big plus</li>\n<li>Prior experience handling/building scalable, testable ETL systems is a nice to have</li>\n<li>BS/BA degree in Computer Science, Software Engineering or other Technical Discipline or equivalent professional experience</li>\n</ol>\n<p>*No Visa Sponsorship available.</p>\n<p>About Company --\nWe help people who work for themselves save time and money on things like insurance and taxes by providing simple, easy to use software, tools and services. The world’s largest work-for-yourself platforms like Uber, Etsy, Airbnb, Instacart, Postmates, Rover, TaskRabbit, Care.com, and others use Stride to help recruit, retain and motivate their communities of independent workers.</p>\n<p>We're located in the heart of San Francisco's South Park district and we’re backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.</p>\n<p>Come help us take the work out of working for yourself!</p>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/stridehealth/38904974-5585-47ad-9130-deae26fe618b\">https://jobs.lever.co/stridehealth/38904974-5585-47ad-9130-deae26fe618b</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak5sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1b8e8a4fed2fee4308b969c4591bd2e3dc06c9dc/Stride.jpg"
  },
  {
    "id": "abdcdb4b-8ac3-4072-b3db-7a8d26f000b4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/abdcdb4b-8ac3-4072-b3db-7a8d26f000b4",
    "created_at": "Wed Apr 17 21:59:00 UTC 2019",
    "company": "Stride Health",
    "company_url": "http://www.stridehealth.com",
    "location": "San Francisco",
    "title": "Android Mobile Developer",
    "description": "<p>About the Role:</p>\n<p>The Stride team is on the lookout for a smart, motivated individual to help develop new features for our Android app Stride Tax. Your job? Make sure we continue to ship features and scale the app to tens of thousands of users and be an advocate for best practices in Android coding across the company.</p>\n<p>Responsibilities:\n1)Evolve and expand Android and mobile at Stride\n2)Advance stability, testing, continuous build / integration, and general good practices for Android within the company\n3)Maintain and extend the visual feature set of the Stride Tax app\n4)Collaborate with product managers and designers to implement new features\n5)Work with multiple engineering and non engineering teams within the company on cross-functional efforts</p>\n<p>Qualifications:\n1)Bachelor's Degree in Computer Science (or software engineering related discipline)\n2)A minimum of 2 years of professional experience within the software engineering space (focused on mobile development)\n3)A strong understanding for computer science fundamentals and excitement to work on a fast-paced, collaborative team\n4)Experience programming in Java with ReactiveX\n5)Experience working with RESTful APIs\n6)Experience working with an RDBMS and SQL\n7)Experience managing project builds and dependencies using gradle\n8)Experience developing apps using Android Studio and the core Android SDK\n9)At least one active app on the Play Store\n10)Experience building and maintaining a consumer app with at least 5k daily active users\n11) Above all, you are constantly learning and growing inside and outside of the workplace</p>\n<p>Nice to have:\n1)Experience with the MVP pattern as it pertains to Android\n2)Experience with dependency injection using Dagger2\n3)Experience managing thread and process concerns as related to Android\n4)Experience unit testing with JUnit and UI testing with Espresso\n5)Experience using a continuous integration tool such as Travis CI\n6)A published gradle library\n7)Experience with another front-end technology: web Javascript framework, iOS, etc.\n8)Experience with one or more backend technologies\n9)Experience with API design and architecting network operations\n10)Experience with consumer finance and tax applications, healthcare, or the self-employed/freelancer industry</p>\n<p>About Company:\nWe help people who work for themselves save time and money on things like insurance and taxes by providing simple, easy to use software, tools and services. The world’s largest work-for-yourself platforms like Uber, Etsy, Airbnb, Instacart, Postmates, Rover, TaskRabbit, Care.com, and others use Stride to help recruit, retain and motivate their communities of independent workers.</p>\n<p>We're located in the heart of San Francisco's South Park district and we’re backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.</p>\n<p>Come help us take the work out of working for yourself!</p>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/stridehealth/0f3e97ce-e7c5-469e-99da-960a939c34d0\">https://jobs.lever.co/stridehealth/0f3e97ce-e7c5-469e-99da-960a939c34d0</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTFsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6bd435e5a76c477cc398fe864988bfb618f1bfc1/Stride.jpg"
  },
  {
    "id": "7830d7db-dda1-4fb4-8333-50395efc7490",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7830d7db-dda1-4fb4-8333-50395efc7490",
    "created_at": "Wed Apr 17 14:01:23 UTC 2019",
    "company": "JOIN Solutions AG",
    "company_url": "https://join.com",
    "location": "Berlin",
    "title": "Senior Software Engineer (Node.js)",
    "description": "<p>We love Recruiting, and building amazing Recruiting Software.</p>\n<p>JOIN is a brand new Recruiting platform to save time and money.</p>\n<p>We are working at a fervent pace to truly change hiring and recruiting. Our vision is to match exciting companies with the best candidates, in the most efficient way possible. Unifying applicant tracking system (ATS), Multiposting and Performance Recruiting, we are striving to bring digital recruitment to a new level.</p>\n<p>This position is available both to remote team members (must be in a timezone ±3 hours from Berlin) and to those interested in working from our office in the heart of Berlin.</p>\n<p>OUR DEVELOPMENT VALUES</p>\n<p>We are passionate about technology, and about quality.\nWe use only modern technologies: TypeScript, Node.js, gcloud, Kubernetes, Docker, gRPC, Postgres, Redis, AWS, AWS Lambda, Micro-services.\nWe believe in automation. We automate anything and everything that can improve our productivity and focus.\nWe work in a CI/CD pipeline.\nWe are not “just” coders — we are always thinking about our product and how to improve the experience of our Clients.\nWe value transparency, close collaboration, and a certain amount of chaos in our work because it makes us faster and more creative.</p>\n<p>WHAT YOU'LL DO</p>\n<p>Participate in architectural decision-making.\nBuild scalable backend systems for our applications, with the opportunity to work on other parts of the stack as well.\nConduct peer code reviews.\nRight from the start, you will be expected to suggest and implement your own ideas and projects.</p>\n<p>YOU WILL BE A GREAT FIT FOR THIS ROLE IF YOU</p>\n<p>Enjoy helping those around to you grow and be successful as developers.\nCan be autonomous and self-driven.\nGet inspired on a daily basis, think of new ideas, and like to share them with others.\nLove to experiment and to use data to drive decision making.\nCan communicate and collaborate with cross-functional teams to deliver compelling products and services.\nHave the ability to take on complex problems, learn quickly, and persist towards a good solution.</p>\n<p>TECHNICAL REQUIREMENTS</p>\n<p>5+ years of development experience\nStrong development experience in Node.js\nA strong technical background, with experience using modern web technologies\nExperience with TDD and continuous integration processes (CI/CD)\nExperience with relational and non-relational (e.g., PostgreSQL, Redis etc.) data stores\nExperience writing and utilizing RESTful API services\nFamiliarity with Docker and Kubernetes\nExperience with gcloud or AWS would be a plus</p>\n<p>WHAT WE OFFER</p>\n<p>Working with a committed, successful and international team.\nA friendly and vibrant working culture of people who are keen to help each other.\nThe opportunity to contribute to an amazing product and help take it to the international level.\nWorking independently and gaining a lot of insight into the field of web software (SaaS) development.\nA salary adequate to your experiences and skills.\nRoom to grow within the company.\nA “forgiveness, not permission” attitude.</p>\n<p>Interested?</p>\n<p>If you would like to be part of our success story, please submit your application and be sure to include a cover letter stating your earliest starting date and salary expectations, and whether you are interested in working remotely or from our Berlin office.</p>\n<p>We look forward to hearing from you!</p>\n",
    "how_to_apply": "<p>Please apply via the following link:\n<a href=\"https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuDPGDoXCx8mU?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuDPGDoXCx8mU?trackingTag=gitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVpsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--340ca06da101fd140ef4a6688e5f378a017609c0/JOIN-Logo-Blue.png"
  },
  {
    "id": "f29f6632-2589-453d-8db5-8687841977f7",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f29f6632-2589-453d-8db5-8687841977f7",
    "created_at": "Wed Apr 17 13:58:12 UTC 2019",
    "company": "JOIN Solutions AG",
    "company_url": "https://join.com",
    "location": "Berlin",
    "title": "Infrastructure Engineer (DevOps)",
    "description": "<p>We love Recruiting, and building amazing Recruiting Software.</p>\n<p>JOIN is a brand new Recruiting platform to save time and money.</p>\n<p>We are working at a fervent pace to truly change hiring and recruiting. Our vision is to match exciting companies with the best candidates, in the most efficient way possible. Unifying applicant tracking system (ATS), Multiposting and Performance Recruiting, we are striving to bring digital recruitment to a new level.</p>\n<p>This position is available both to remote team members (must be in a timezone ±3 hours from Berlin) and to those interested in working from our office in the heart of Berlin.</p>\n<p>OUR DEVELOPMENT VALUES</p>\n<p>We are passionate about technology, and about quality.\nWe use only modern technologies: TypeScript, Node.js, gcloud, Kubernetes, Docker, gRPC, Postgres, Redis, AWS, AWS Lambda, Micro-services.\nWe believe in automation. We automate anything and everything that can improve our productivity and focus.\nWe work in a CI/CD pipeline.\nWe are not “just” coders — we are always thinking about our product and how to improve the experience of our Clients.\nWe value transparency, close collaboration, and a certain amount of chaos in our work because it makes us faster and more creative.</p>\n<p>WHAT YOU'LL DO</p>\n<p>Own and operate all aspects of our online serving infrastructure across all environments.\nSupport engineers in building next-generation recruitment platform.\nAutomate anything and everything, including yourself\nRebuild our continuous delivery systems to enable simpler, faster, and more robust build and release processes (e.g. canary deployments).\nImprove the monitoring system for the whole infrastructure\nSetup security environments, leveraging an “infrastructure as code” approach.</p>\n<p>YOU WILL BE A GREAT FIT FOR THIS ROLE IF YOU</p>\n<p>Enjoy helping those around to you grow and be successful as developers.\nCan be autonomous and self-driven.\nGet inspired on a daily basis, think of new ideas, and like to share them with others.\nLove to experiment and to use data to drive decision making.\nCan communicate and collaborate with cross-functional teams to deliver compelling products and services.\nHave the ability to take on complex problems, learn quickly, and persist towards a good solution.</p>\n<p>TECHNICAL REQUIREMENTS</p>\n<p>Experience and empathy in building products/systems/tools for engineers\nHands-on experience building and scaling products/systems/tools that support microservice-oriented architectures (Docker, Kubernetes, helm)\nExperience with gcloud and AWS\nExtensive familiarity with the Linux internals\nAble to write clean and maintainable code (our main language is TypeScript)</p>\n<p>WHAT WE OFFER</p>\n<p>Working with a committed, successful and international team.\nA friendly and vibrant working culture of people who are keen to help each other.\nThe opportunity to contribute to an amazing product and help take it to the international level.\nWorking independently and gaining a lot of insight into the field of web software (SaaS) development.\nA salary adequate to your experiences and skills.\nRoom to grow within the company.\nA “forgiveness, not permission” attitude.</p>\n<p>Interested?</p>\n<p>If you would like to be part of our success story, please submit your application and be sure to include a cover letter stating your earliest starting date and salary expectations, and whether you are interested in working remotely or from our Berlin office.</p>\n<p>We look forward to hearing from you!</p>\n",
    "how_to_apply": "<p>Please apply via the following link:\n<a href=\"https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuHGwNh_FWywF?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/joincom/view/P_AAAAABkAACuHGwNh_FWywF?trackingTag=gitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaU5sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--89eb9033e5ddb6e369f11acae389847aa8d1ff46/JOIN-Logo-Blue.png"
  },
  {
    "id": "34a8b372-18bb-4d0a-9ac6-85568bce2b04",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/34a8b372-18bb-4d0a-9ac6-85568bce2b04",
    "created_at": "Wed Apr 17 10:31:57 UTC 2019",
    "company": "moovel Group GmbH",
    "company_url": "https://www.moovel.com/de/DE",
    "location": "Berlin",
    "title": "Engineering Manager (f/m/d) Technology Company seeks Leader",
    "description": "<h2>Hi,</h2>\n<p>we are Lothar, Tammo, Jan, Magnus and Oliver from the tech department. Together with our cross-functional teams we are responsible for creating the software solutions that our product team envisions and which our customers love. We are currently looking for a tech lead that will lead and grow our engineering teams in Berlin.</p>\n<h2>FIRST A QUICK LOOK AT US</h2>\n<p>Daimler AG and BMW Group are bundling their mobility services in the areas of Carsharing, Ride- Hailing, Parking, Charging and Multimodal Platforms, and create a new global player comprising of five joint ventures. moovel Group is joining forces with ReachNow - and becomes REACH NOW</p>\n<p>Our vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel (REACH NOW) is part of two global corporations, but at the heart of it we still are a start- up. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 300 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.</p>\n<h2>SOME OF THE THINGS YOU WILL DO</h2>\n<ul>\n<li>Give guidance to the engineers in our Berlin squads in developing a modern, cloud based mobility platform</li>\n<li>Grow our tech-organization in Berlin and foster an agile engineering culture</li>\n<li>Engage and challenge our engineers with servant leadership and your ability to give purpose</li>\n<li>Balance guidance and freedom and coach engineers</li>\n<li>Represent our culture and product at events / or meetups together with engineers</li>\n</ul>\n<h2>ABOUT YOU</h2>\n<ul>\n<li>At moovel we work in cross-functional and agile engineering teams and you are experienced with a work environment like that plus you have long-term experience (5+ years) in building, growing and sustaining teams</li>\n<li>Technical excellence is something you are striving for</li>\n<li>You have a solid background in backend-focused development with technologies such as microservices, cloud-based infrastructure, API-driven development</li>\n<li>It is helpful to be familiar with our Technology Stack (Node.js, JVM, AWS), most importantly, however, you should bring seniority in engineering, so our teams can trust in your ability to help them in their decision making process</li>\n<li>You are passionate about moovel’s mission and want to create products that our customers love</li>\n<li>You use the art of leadership to motivate and inspire your team in order to ensure the delivery of moovel’s mission</li>\n<li>We live an open feedback culture so you need to be experienced with giving honest feedback in order to guide our moovelanos and foster their personal development</li>\n<li>You are well connected and established a certain footprint within the technology space, which helps you to stay on top of the latest developments and attract talents to the company. Active participation in conferences, organisation of meetups or blogging activity would be helpful</li>\n<li>Must be a caring human being</li>\n</ul>\n<h2>BENEFITS</h2>\n<ul>\n<li>Choose your own hardware</li>\n<li>Working with newest technologies &amp; microservices</li>\n<li>Company pension plan</li>\n<li>Free breakfast, good coffee &amp; fresh fruits</li>\n<li>Monthly mobility budget</li>\n<li>Be part of an interdisciplinary team of experts</li>\n<li>Working on products with a high impact on society</li>\n<li>International teams</li>\n<li>Child care allowance</li>\n<li>Flexible working hours</li>\n</ul>\n<p>In summary, we are looking for an experienced leader with a strong technical background for our Berlin location, that helps people grow and contributes to making our organization better. If this posting catches you and you are more than ready for this challenge, we definitely want to meet you.</p>\n<p>Being a part of the exciting journey that lies ahead of us will be very rewarding. So just send us your application by clicking on application form.</p>\n<p>Lothar, Jan, Tammo, Magnus and Oliver</p>\n<p><a href=\"https://moovelgroup.redirect.your-jobresponse.com/engineering_manager_f_m_d_technology_company_seeks_leader_berlin/246849/V819/anwenden\">Click here for the application form</a></p>\n<p><strong>If you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut +49 30 549073811</strong></p>\n",
    "how_to_apply": "<p><a href=\"https://moovelgroup.redirect.your-jobresponse.com/engineering_manager_f_m_d_technology_company_seeks_leader_berlin/246849/V819/anwenden\">Click here for the application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHRsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9dd267a1a167a351d281f61958728980905ff23f/moovelreachnow.png"
  },
  {
    "id": "8ac0fffe-aefc-42d8-93a2-40f77b035233",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8ac0fffe-aefc-42d8-93a2-40f77b035233",
    "created_at": "Wed Apr 17 09:23:15 UTC 2019",
    "company": "CHUV",
    "company_url": "https://www.chuv.ch",
    "location": "Lausanne",
    "title": "Data Analyste Analyst IT Recherche SPHN",
    "description": "<p>Résumé du poste:</p>\n<p>La Direction des système d'information du CHUV recherche un-e Data analyste IT Recherche, pour un CDI lié à un fonds, ceci afin de renforcer son équipe Data Science &amp; Recherche.</p>\n<p>Contexte:</p>\n<p>Le Centre hospitalier universitaire vaudois (CHUV) est l'un des 5 hôpitaux universitaires suisses. Grâce à sa collaboration avec la Faculté de biologie et médecine de l'Université de Lausanne et l'EPFL, le CHUV joue un rôle de pointe dans les domaines des soins médicaux, de la recherche médicale et de la formation.</p>\n<p>L’équipe Data Science &amp; Recherche, rattachée à la Direction des systèmes d’information, met à disposition des investigateurs des données cliniques dépersonnalisées et codées afin qu’ils puissent mener leurs projets de recherche en respectant le cadre légal et éthique en vigueur.</p>\n<p>Le CHUV et l’équipe Data Science &amp; Recherche participent à l’initiative nationale SPHN (Swiss Personalized Health Network) pour promouvoir le développement de la médecine personnalisée et de la santé personnalisée en Suisse.</p>\n<p>Missions:</p>\n<ul>\n<li>Dans le domaine de la recherche clinique, vous collectez les données du Datawarehouse de\nrecherche clinique du CHUV afin de les rendre interopérables avec les autres hôpitaux\nuniversitaires selon les besoins des projets SPHN</li>\n<li>Vous effectuez les extractions et l'intégration de données, transcodage, encodage, livraison des\ndonnées finales</li>\n<li>Vous mettez en œuvre les techniques de data quality management appropriées et documentez les\nméta-données associées.</li>\n</ul>\n<p>Profil:</p>\n<ul>\n<li>Vous êtes informaticien-ne de formation et bénéficiez d’une expérience confirmée dans la gestion\nde données médicales ou dans le contexte de la recherche médicale</li>\n<li>Vous êtes un expert dans la manipulation des données et vous avez une expérience confirmée\navec SQL</li>\n<li>Vous disposez de connaissances avec R et/ou Python, un plus</li>\n<li>Vous êtes motivé-e par les technologies innovantes liées au big data\nDe nature collaborative, vous avez plaisir à développer des relations avec les chercheurs, m\nmédecins et experts informaticiens nécessaires pour trouver les solutions dans un contexte en\npleine mutation</li>\n<li>Orienté-e solutions, vous aimez participer à des projets et collaborez avec les métiers.</li>\n</ul>\n<p>Nous offrons:</p>\n<p>Devenir une collaboratrice ou un collaborateur du Centre hospitalier universitaire vaudois, c'est l'assurance de bénéficier :</p>\n<ul>\n<li>De prestations sociales de premier ordre</li>\n<li>D'un droit à trois jours de formation minimum par année</li>\n<li>De 25 jours de vacances par année</li>\n<li>De restaurants d'entreprise de qualité hôtelière, dans chacun des bâtiments de l'institution.</li>\n</ul>\n<p>Contact et envoi de candidature:</p>\n<p>Contact pour informations sur la fonction : Mme Nathalie Jacquemont, au 079 556 63 73.</p>\n<p>Dans la mesure où toutes nos candidatures sont traitées de manière électronique, nous vous remercions de postuler exclusivement par internet, en cliquant sur le bouton POSTULER en bas de l’annonce. Si pour des raisons techniques, vous ne pouvez pas postuler en ligne, nous vous invitons à vous rendre physiquement auprès de notre équipe e-recrutement, qui vous accompagnera dans votre démarche (contact : 021.314.85.70). Nous vous répondons du lundi au vendredi de 8h00 à 11h30 et de 13h30 à 16h30.</p>\n<p>Le CHUV applique les exigences de qualité les plus élevées dans le cadre de ses processus de recrutement. En outre, soucieux de promouvoir la diversité de nos collaboratrices et collaborateurs, nous sommes attentifs aux différents parcours de vie et mettons tout en œuvre pour garantir l’égalité de traitement et éviter toute discrimination. Nous nous réjouissons de recevoir votre candidature.</p>\n<p>Nous remercions par avance les agences de placement de prendre bonne note que les candidatures insérées par leurs soins directement sur notre plateforme de recrutement ne sont pas acceptées et ne peuvent donner lieu à une facturation. Merci de votre compréhension.</p>\n",
    "how_to_apply": "<p>Nous vous remercions de postuler exclusivement par internet, en cliquant sur le bouton POSTULER en bas de l’annonce:\n<a href=\"https://recrutement.chuv.ch/vacancy/data-analyste-it-recherche-sphn-237448.html\">https://recrutement.chuv.ch/vacancy/data-analyste-it-recherche-sphn-237448.html</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1903b5f6b4438b82cd055e38e5b7abb24ee08758/Universit%C3%A4tsspital_Lausanne_CHUV_logo.svg.png"
  },
  {
    "id": "ec451dc1-0623-4677-83d8-4fe3f77b3d06",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ec451dc1-0623-4677-83d8-4fe3f77b3d06",
    "created_at": "Wed Apr 17 06:31:11 UTC 2019",
    "company": "CircleCI",
    "company_url": "http:",
    "location": "Remote - Ireland, Germany, UK",
    "title": "Engineering Team Leads ",
    "description": "<p>CircleCI is looking for Engineering Team Leads to support our engineering teams in continuously delivering user value. If you bring an engineering background and are excited about helping engineers deliver user value every day, and want to grow further towards engineering management, this role could be for you.</p>\n<p>The Team Lead role is an essential part of our distributed engineering organization, and Team Leads play a key role in helping teams be healthy and understand and shape their daily work on delivering value to our users. As a Team Lead at CircleCI, you’ll become part of one of our engineering teams. You’ll spend around 80% of your time supporting your team, and around 20% of your time on hands-on technical work. The Team Lead role is the first step on CircleCI's engineering management career track.</p>\n<p><strong>Who you'll work with:</strong></p>\n<p>You'll join a distributed, cross-functional team of 6-8 people that includes both product and site reliability engineers. You'll collaborate with other Team Leads and work closely with:</p>\n<p>Tech Leads: senior engineers responsible for driving technical decisions within their own teams and across the engineering organization.</p>\n<p>Product Managers: collaborate with Product and your engineer teammates to solve our customers’ biggest challenges, jointly define milestones, and guide the team's weekly planning.</p>\n<p>Engineering Managers: you'll report directly to an engineering manager who supports 1-2 teams on a more strategic level, coordinates staffing, and supports career development of you and your teammates.</p>\n<p><strong>As a Team Lead at CircleCI, you’ll have impact in the following areas:</strong></p>\n<p>User value delivery: Ensure incremental value delivery and high-quality standards for your team.</p>\n<p>Partner with product managers to plan your team's strategic work.</p>\n<p>Facilitation: Guide your team’s agile ceremonies on an ongoing basis. Plan and prepare those together with the Product Manager and Tech Lead for your team.</p>\n<p>Planning: Collaborate with the engineering and product leadership teams on longer-term, strategic  planning. Develop measurable OKRs and ensure the team utilises them to guide their work.</p>\n<p>Knowledge sharing: Ensure that your teammates continue to learn and grow together as a team.</p>\n<p>Process and Product: Maintain high levels of transparency, efficiency, and collaboration in your team, as well as with your peers and your team’s Product Manager.</p>\n<p>Supporting growth of your team and your teammates: Work with your teammates and engineering leadership to make use of opportunities to grow.</p>\n<p>Feedback &amp; communication: Provide feedback to your teammates, as well as engineering leadership, on a regular basis. Communicate you team's progress towards its goals.</p>\n<p>Technical work: In this role, you’ll spend 10-20% of your time coding, with frequent pair programming</p>\n<p><strong>About you:</strong></p>\n<p>This role is most suited for folks with an engineering background who have started doing project and process management work already.—Do you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:</p>\n<p>1+ year of experience in agile/lean project management with engineering teams (or similar roles). You understand modern software engineering practices and how to apply them to ensure continuous incremental delivery of user value. You know how to utilise metrics and agile ceremonies to continuously improve the way your team operates.</p>\n<p>Remote work: You bring at least 6 months of experience working with distributed teams.</p>\n<p>Technical skills: At least 2 years of experience crafting code in Clojure, Go, or another functional programming language.</p>\n<p>Learning: You bias towards action, both in your own work, as well as in your enablement of others, and bring a drive to continuously help your team improve.</p>\n<p>Communication and teamwork: You’re an effective communicator and collaborator. You thrive on building strong relationships with your teammates and stakeholders for your team.</p>\n<p>We know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.</p>\n<p><strong>About CircleCI</strong></p>\n<p>We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.</p>\n<p>CircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.</p>\n<p>We run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.</p>\n<p>CircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.</p>\n",
    "how_to_apply": "<p><a href=\"https://boards.greenhouse.io/circleci/jobs/4255248002\">https://boards.greenhouse.io/circleci/jobs/4255248002</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--68e47a2800fe0fdf536052fa97a6ef342836112a/circle-logo-badge-black%20(1).png"
  },
  {
    "id": "afc6277b-8f60-4601-9dc7-7cb8901876b1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/afc6277b-8f60-4601-9dc7-7cb8901876b1",
    "created_at": "Wed Apr 17 05:55:32 UTC 2019",
    "company": "CircleCI",
    "company_url": null,
    "location": "Remote - Ireland, Germany, UK",
    "title": "Senior Application Security Engineer",
    "description": "<p>CircleCI is looking for an experienced Application Security Engineer capable of advancing security across our entire platform–from our single-page web app to the containers in our build system. You will work closely with Software Engineering and SRE teams, bringing security in early in the life-cycle and working with engineers to build security from design through production.</p>\n<p>What will make you successful:</p>\n<p>Software development experience, interest and ability.</p>\n<p>Proficiency in one or more of: Clojure, Go, Java, C#, C, C++, Ruby.</p>\n<p>Deep understanding of the fundamentals of security at multiple layers of abstraction, from operating systems to applications.</p>\n<p>Collaborative approach to mentoring software engineers on the development of secure code.</p>\n<p>Passion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code.</p>\n<p>Experience with the specific security implications of operating in a cloud environment.</p>\n<p>Systematic problem solving approach, coupled with a strong sense of ownership and drive.</p>\n<p>Enjoy flexibility in role and a desire to experiment with different approaches.</p>\n<p>Excited by the ability to make significant impact in a growing company.</p>\n<p>A strong desire for continuous improvement.</p>\n<p>5+ years of experience in software, 2+ in security.</p>\n<p>What you will do:</p>\n<p>Support and advise software engineering teams in the design of secure software.</p>\n<p>Design and deliver shared libraries and services to support security requirements within our platform.</p>\n<p>Work with 3rd-party partners to manage our ongoing penetration testing program.</p>\n<p>Recommend and deploy tooling to manage security in the delivery pipeline as well as production systems.</p>\n<p>Engage with large customers as needed to advise them on security practices when deploying our solutions.</p>\n<p>Diagnose and resolve security issues in conjunction with software engineering teams.</p>\n<p>Participate in defining security-related end user features in the CircleCI product.</p>\n<p>Working remotely at CircleCI</p>\n<p>We’re a distributed company with teammates across the world. We can support you working remotely anywhere in Ireland, the UK or Germany.</p>\n<p>About CircleCI</p>\n<p>We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.</p>\n<p>CircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.</p>\n<p>We run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.</p>\n<p>CircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.</p>\n",
    "how_to_apply": "<p><a href=\"https://boards.greenhouse.io/circleci/jobs/4251668002\">https://boards.greenhouse.io/circleci/jobs/4251668002</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--595f01607ce1a2bfa65738930cb5e6d6180bbff4/circle-logo-badge-black%20(1).png"
  },
  {
    "id": "d8209b13-8fb7-43a9-8173-26d86fd72bf2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d8209b13-8fb7-43a9-8173-26d86fd72bf2",
    "created_at": "Wed Apr 17 04:28:22 UTC 2019",
    "company": "Atlatec GmbH",
    "company_url": null,
    "location": "Karlsruhe",
    "title": "Software Developer C++ for 3D maps (m,f,d)",
    "description": "<h1>Job description</h1>\n<p>We are developing technology to build high-definition 3D maps. We use this technology to scan roads and our automotive customers use these 3D maps for autonomous driving. Unlike many others we use nothing but cameras, GPS and artificial intelligence to create such maps. This allows to create these maps at scale. Two examples are shown below.</p>\n<p><img src=\"https://camo.githubusercontent.com/8fd22a3681acafec28deb92eceaa1cc6f3b45efe/687474703a2f2f7777772e61746c617465632e64652f646f776e6c6f6164732f6265726c696e312e6a7067\">\n<img src=\"https://camo.githubusercontent.com/0944bd13a542770a8c883901052a349d55a493ee/687474703a2f2f7777772e61746c617465632e64652f646f776e6c6f6164732f6265726c696e322e6a7067\"></p>\n<p><em>We currently build customer-specific maps in Europe, USA and Japan and we need your help.</em></p>\n<h1>What you will do</h1>\n<ul>\n<li>extending existing software modules and components</li>\n<li>develop Linux-based software to create and release HD maps for self-driving vehicles</li>\n<li>design and develop efficient, scalable algorithms and pipelines to quickly process large-scale geo data</li>\n<li>Acting as a technical contact person for the customer</li>\n</ul>\n<h1>What you’ll bring to the team</h1>\n<ul>\n<li>Bachelor degree in Computer Science or related field, Master degree is a plus</li>\n<li>1+ years working experience in C++ software development</li>\n<li>Experience with Linux</li>\n<li>Experience with Python is a plus</li>\n<li>Experience with Computer Vision is a plus</li>\n<li>Good organization and communication skills and team player</li>\n</ul>\n<h1>What we offer</h1>\n<ul>\n<li>Work on current topics such as autonomous driving</li>\n<li>start-up vibe</li>\n<li>mentorship from senior engineers</li>\n<li>plenty of learning opportunity</li>\n<li>friendly and diverse team</li>\n<li>free snacks</li>\n<li>open feedback culture</li>\n<li>table football</li>\n<li>further development of skills as a C++ expert</li>\n</ul>\n<h1>Hiring process</h1>\n<ol>\n<li>use this link to apply (no emails please) <a href=\"https://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd\">Apply Here</a>\n</li>\n<li>please fill out the application <em>online</em> and upload your CV including university certificate and school diploma.  Please include reference letters (\"Arbeitszeugnis\") if you have any.</li>\n<li>we will kindly ask you to complete a small assignment</li>\n<li>we will invite you for a job interview</li>\n<li>you'll get the offer and contract :-)</li>\n</ol>\n",
    "how_to_apply": "<p>use this link to apply (no emails please) [Apply Here]<a href=\"https://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd\">https://atlatecgmbh.recruitee.com/o/software-developer-c-for-3d-maps-mfd</a>)</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzFsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4cd20ffcab1d6039d87f4b00c693d0d112c6036/atlatec.png"
  },
  {
    "id": "b1a29663-9195-43cb-8f58-6835c3754b9e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b1a29663-9195-43cb-8f58-6835c3754b9e",
    "created_at": "Tue Apr 16 23:28:44 UTC 2019",
    "company": "CircleCI",
    "company_url": null,
    "location": "Remote - North America ",
    "title": "Clojure Developers ",
    "description": "<p>CircleCI seeks experienced Clojure engineers who are excited to help shape the future of our product. We’re growing fast and continuously hiring folks to join our mission: enabling thousands of developers to do better work every single day.</p>\n<p>You'll join a distributed, cross-functional team of product and site-reliability engineers building features and services with an eye towards incremental delivery and business value. You'll write sustainable, resilient Clojure code as part of an engineering organization that values collaboration, trust, and learning.</p>\n<p>You will have direct impact in the following ways:</p>\n<p>Continuously delivering new features to our customers.</p>\n<p>Fostering a culture of observability and monitoring; helping your team use operational data to improve the stability and performance of our systems.</p>\n<p>Collaborating across teams to evolve our architecture.</p>\n<p>Writing sustainable, high-quality, high-performance Clojure code.</p>\n<p>Owning micro-services throughout their entire lifecycle.</p>\n<p>Partnering with product owners to set the direction of our platform.</p>\n<p>Do you love collaboration and teamwork? Are you eager to learn new things and help others learn, too? Are you a strong communicator in both synchronous and asynchronous mediums? If so, here’s the additional experience we’re looking for:</p>\n<p>4+ years of backend development experience.</p>\n<p>Experience with functional programming in Clojure or another programming language.</p>\n<p>A focus on delivering high-quality code through strong testing practices.</p>\n<p>We know there’s no such thing as an “ideal” candidate - we’re all a work in progress and are growing new skills and capabilities all the time. CircleCI welcomes those who are enthusiastic about learning and evolving, so however you identify and whatever your background, if this looks like a role where you could do work that excites you, we hope you’ll apply.</p>\n<p>About CircleCI</p>\n<p>We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are looking for people who are interested in helping us shape software engineering best practices for the industry as a whole.</p>\n<p>CircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.</p>\n<p>We run 12M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI. We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.</p>\n<p>CircleCI is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.</p>\n",
    "how_to_apply": "<p><a href=\"https://boards.greenhouse.io/circleci/jobs/4254561002\">https://boards.greenhouse.io/circleci/jobs/4254561002</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3RsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c9d9c234f810cd1e25443b12e1b548ce7df063d4/circle-logo-badge-black%20(1).png"
  }
]
