[
  {
    "id": "d2a798c1-3e08-421f-a279-f122088c302a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d2a798c1-3e08-421f-a279-f122088c302a",
    "created_at": "Thu Mar 14 18:39:09 UTC 2019",
    "company": "dotstudioPRO",
    "company_url": "http://dotstudiopro.com",
    "location": "Remote (US or Canada)",
    "title": "Experienced Software Project Manager",
    "description": "\u003cp\u003eExperienced Software Project Manager\u003c/p\u003e\n\u003cp\u003edotstudioPRO is seeking an experienced Project Manager to join our development team. We are an entertainment technology company focused on delivering monetization and distribution tools to the entertainment industry. We are looking for forward thinking and passionate people that not only bring great management and technical skills, but be a voice on the team. At dotstudioPRO, you will be working with developers who are creating cutting-edge applications for the global media industry.\u003c/p\u003e\n\u003cp\u003eYou will also be involved in all aspects of the development lifecycle: idea, design, documentation, implementation, delivery, and maintenance. We expect that you communicate and write in a clear and effective manner and work well in an Agile software development environment.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eManage software and application project teams using Agile SCRUM practices who use Java/JavaScript, NodeJS, AngularJS, Less and SaaS, HTML5/CSS 3  (web UI development), WordPress, Mongo DB, Redis.io, PHP (MVC, OOP), MYSQL, Laravel and GIT.\u003c/p\u003e\n\u003cp\u003eManage cross-functional project teams including: software developers, iOS/Android/AppleTV/Roku/FireTV developers, software testers, technical writers, and Big Data engineers/consultants.\u003c/p\u003e\n\u003cp\u003eWork with the team to scope projects and create a project plan (schedule and budget) and monitor progress against the plan.\u003c/p\u003e\n\u003cp\u003eManage and oversee all project-related technical complexities and risks.\u003c/p\u003e\n\u003cp\u003eEstablish and maintain a thorough understanding of the product development lifecycle process and related tools. Use this understanding to complete project management related accomplishments and to ensure other team members follow the process and complete their deliverables.\u003c/p\u003e\n\u003cp\u003eCommunicate project status to management and other stakeholders via presentations and project tracking tools.\u003c/p\u003e\n\u003cp\u003eFacilitate the resolution of project issues and help remove obstacles that impede progress.\u003c/p\u003e\n\u003cp\u003eTesting developer builds for various devices and working with the team to track and resolve issues.\u003c/p\u003e\n\u003cp\u003eExperience:\u003c/p\u003e\n\u003cp\u003eExperience managing cross-functional software development projects (2+ years).\u003c/p\u003e\n\u003cp\u003eExperience/knowledge of Agile software development processes e.g. SCRUM (2+ years).\u003c/p\u003e\n\u003cp\u003eGood communication \u0026amp; presentation skills.\u003c/p\u003e\n\u003cp\u003eGood team building skills - creating a sense of team driven by common goals, motivation, facilitation, conflict resolution.\u003c/p\u003e\n\u003cp\u003eAbility to set \u0026amp; track project budgets, schedules, deliverables, etc.\u003c/p\u003e\n\u003cp\u003eComfortable managing with uncertainty.\u003c/p\u003e\n\u003cp\u003eExperience managing multiple projects simultaneously.\u003c/p\u003e\n\u003cp\u003eA background in video or cross platform video delivery is highly beneficial.\u003c/p\u003e\n\u003cp\u003eProject Management Professional (PMP), Agile Project Management (APM), and/or SCRUM Master certification is an Asset but not required.\u003c/p\u003e\n\u003cp\u003eWorking knowledge developing cross platform/browser compatible dynamic web, video and mobile web applications is an asset but not required.\u003c/p\u003e\n\u003cp\u003eTraits of our desired candidate:\u003c/p\u003e\n\u003cp\u003eFamiliarity with online video streaming platforms.\nIs passionate about workflow and technology, and is always looking to further their personal knowledge and expertise.\nIs comfortable executing against tasks that are occasionally ambiguous, but works independently to seek out needed information.\nExperience and knowledge in Web development and production.\nEnjoys providing good customer service\u003c/p\u003e\n\u003cp\u003eEducation:\u003c/p\u003e\n\u003cp\u003eDegree in Computer Science or a related discipline, diverse work experience in IT, or the equivalent in education and work experience in project management in the software industry.\u003c/p\u003e\n\u003cp\u003eNote:  This position is a remote position and is not a Contractor position but a full-time position with the company.\u003c/p\u003e\n\u003cp\u003eAbout the Company:\u003c/p\u003e\n\u003cp\u003edotstudioPRO is an entertainment technology company that provides digital media professionals access to innovative tools and technologies that empower them to create successful business models in the emerging new media space...at affordable rates. One of the key components of our company is our SAS is designed to aggregate content and allows users the opportunity to take full-advantage of new technologies to aide in management, distribution, marketing, and monetization. At the heart of its business model, dotstudioPRO enables these digital media professionals to become their own independent studios, essentially carving out “studio lots” in the online space enabling them to cross multiple platforms delivering video content direct to distributers.  dostudioPRO is available on web, mobile and OTT and also facilitates live streaming of content.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email \u003ca href=\"mailto:info@dotstudiopro.com\"\u003einfo@dotstudiopro.com\u003c/a\u003e and included in the subject:  Software Project Manager\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0cd68caf9e69490c7287b3bb378eab7cd2a3e958/dotstudioPRO-1024x271.jpg"
  },
  {
    "id": "8116bcb1-019f-48d5-97f3-5aef1a49a208",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8116bcb1-019f-48d5-97f3-5aef1a49a208",
    "created_at": "Thu Mar 14 12:13:08 UTC 2019",
    "company": "moovel Group GmbH (REACH NOW)",
    "company_url": "https://www.moovel.com/de/DE",
    "location": "Hamburg",
    "title": "Backend Engineer for Mobility Technology (f/m/d)",
    "description": "\u003ch2\u003eBackend Engineer (f/m/d) Mobility Service Provider Squad\u003c/h2\u003e\n\u003ch2\u003eHi,\u003c/h2\u003e\n\u003cp\u003eWe are David, Simon, Anton, Mark, Delia, Patrick, Abdulkadir, Gabriel and Hendrik from the Mobility Service Provider squad. As an interdisciplinary team we focus on integrating mobility service providers for car- sharing, bike-sharing and ride-hailing such as car2go or mytaxi into our urban mobility platform. We care greatly about quality, scalability, ease of use and a great user experience. We’re looking for a backend- focused engineer to join our squad.\u003c/p\u003e\n\u003ch2\u003eFIRST A QUICK LOOK AT US\u003c/h2\u003e\n\u003cp\u003eDaimler AG and BMW Group are bundling their mobility services in the areas of Carsharing, Ride-Hailing, Parking, Charging and Multimodal Platforms, and create a new global player comprising of five joint ventures. moovel Group is joining forces with ReachNow - and becomes REACH NOW.\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation, but at the heart of it we still are a start-up. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003ch2\u003eYOUR ROLE:\u003c/h2\u003e\n\u003cp\u003eWe are building services that provide a fully fledged feature set of urban mobility service providers. Our backend enables the moovel (REACH NOW) mobility app to find nearby mobility\noptions like car or bike-sharing as well as ride-hailing services. It also allows booking functionality and handles payment.\u003c/p\u003e\n\u003cp\u003eOur services interact with moovel’s (REACH NOW) mobility platform as well as external APIs. Many of our services are also exposed to external partners, so they have to be well documented, stable and easy to use. Implementing new services in a consistent way is also very important to us.\u003c/p\u003e\n\u003ch2\u003eTHE THINGS YOU WILL DO:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eworking in the Mobility Service Provider squad together with backend developers, mobile developers, designers and QA\u003c/li\u003e\n\u003cli\u003ebuild microservices with Node.js written in TypeScript and deployed on AWS\u003c/li\u003e\n\u003cli\u003edesign and implement APIs for discovering mobility points, booking flows and payment for mobility services\u003c/li\u003e\n\u003cli\u003eintegrate APIs from third-party mobility service providers into our platform\u003c/li\u003e\n\u003cli\u003eas we prefer to be agile, you will participate in defining our products and building them (our product owner values your input)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eABOUT YOU:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou are experienced in JavaScript or ideally in TypeScript\u003c/li\u003e\n\u003cli\u003eYou are familiar with building scalable applications and services with Node.js\u003c/li\u003e\n\u003cli\u003eYou are experienced in building services using well-defined APIs\u003c/li\u003e\n\u003cli\u003eYou know how to operate services in production: deploying, performance monitoring, tracing problems, and optimization are part of the things you have done in the past\u003c/li\u003e\n\u003cli\u003eWe run our services on Amazon Web Services and monitor them with New Relic and Kibana. Knowledge with those technologies is a plus and not mandatory from the beginning\u003c/li\u003e\n\u003cli\u003eYou are able to communicate verbally and written in English (our squad is international)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBENEFITS\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eCompany pension plan\u003c/li\u003e\n\u003cli\u003eFree breakfast, coffee \u0026amp; water Mobility allowance\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eChild care allowance\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eINTERESTED?\u003c/h2\u003e\n\u003cp\u003eApply now by using the application form!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_for_mobility_technology_f_m_d_hamburg/244821/V819/anwenden\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549 073811\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_for_mobility_technology_f_m_d_hamburg/244821/V819/anwenden\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0poIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1acca7aea4109f83827ef54ec1db380cff149a9e/moovelreachnow.png"
  },
  {
    "id": "89c10a05-eaf8-4454-933a-982682f3d8ae",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/89c10a05-eaf8-4454-933a-982682f3d8ae",
    "created_at": "Fri Mar 08 14:40:03 UTC 2019",
    "company": "de Volksbank",
    "company_url": "http://www.devolksbank.nl",
    "location": "Den Bosch",
    "title": "Front-End Developer",
    "description": "\u003cp\u003e\u003cem\u003eKlaar voor een nieuwe uitdaging? Als frontend-developer ontwikkel je applicaties voor wonen, betalen en bankieren met een Angular-framework. En dat voor honderdduizenden gebruikers! Check de vacature.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eDe Volksbank heeft voor haar locatie in ’s-Hertogenbosch een vacature voor een\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFront-End Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIs mijn salaris al gestort? Had ik het geld al overgemaakt? Mensen checken hun bankapplicaties steeds vaker. Soms zelfs tientallen keren per dag! Dankzij jouw werk als frontend-developer verloopt dat allemaal gesmeerd.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eZo ziet jouw baan eruit als Front-End Developer\u003c/strong\u003e\nAls frontend-developer zorg jij ervoor dat Volksbank-applicaties voor bijvoorbeeld internetbankieren en wonen er strak uitzien en dat klanten er probleemloos in kunnen navigeren.\u003c/p\u003e\n\u003cp\u003eSamen met je collega’s bouw, test, beheer en documenteer je applicaties. Dit doe je met behulp van een breed scala aan frontend-ontwikkeltechnieken en onze eigen componentenbibliotheek op basis van Angular. Je werkt aan interessante projecten. Denk bijvoorbeeld aan de online Huismap, waarmee klanten en hypotheekadviseurs snel en simpel informatie en documenten met elkaar kunnen uitwisselen. Of aan Payconiq: een systeem waarmee je met je smartphone in winkels, online en aan vrienden kunt betalen.\u003c/p\u003e\n\u003cp\u003eAls frontend-developer heb jij veel oog voor de klantbeleving van onze applicaties. Waar hebben gebruikers behoefte aan? Wat werkt goed – en wat juist niet? Hiervoor werk je nauw samen met vertegenwoordigers en productowners van de business en ben je regelmatig op ons hoofdkantoor in Utrecht. Met je collega’s werk je aan software die onze financiële dienstverlening aan klanten versnelt, vereenvoudigt en verbetert. Jouw vernieuwende ideeën zijn hierbij natuurlijk meer dan welkom!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJouw kwaliteiten\u003c/strong\u003e\nEen nieuwsgierige, inhoud gedreven professional met een flinke dosis lef en een aanstekelijk enthousiasme. Dat ben jij in een notendop. Daarnaast beschik je over een kritische blik, het vermogen om complexe problemen te analyseren en de vindingrijkheid om eenvoudige creatieve oplossingen te bedenken. Oplossingen waar de klant écht iets aan heeft. Nieuwe technologische ontwikkelingen volg je op de voet, bijvoorbeeld doordat je onze lezingen, pizzasessies en hackathons bijwoont. Jouw kennis deel je graag. Iedereen kan bij jou rekenen op een helder verhaal. Want jij kunt je makkelijk inleven in anderen, of dat nou je backend-collega, een hypotheekadviseur uit de business of de klant is.\u003c/p\u003e\n\u003cp\u003eVerder heb je:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimaal een hbo-diploma, liefst in een IT-richting.\u003c/li\u003e\n\u003cli\u003eMinimaal drie jaar ervaring met frontend-ontwikkeling.\u003c/li\u003e\n\u003cli\u003eErvaring met frontend-ontwikkeltechnieken en -frameworks, zoals Angular, Jasmine,  Protractor, Cucumber, SASS, BDD, TDD, NgRx, HTML5, JavaScript, TypeScript. stylesheets, CSS, SAS, NodeJS en Grunt of Gulp.\u003c/li\u003e\n\u003cli\u003eBij voorkeur ervaring met backend-technologieën, zoals middleware, security, service-oriented architecture, Spring Boot en databases.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat biedt De Volksbank jou?\u003c/strong\u003e\nAls jij gemotiveerd en met plezier naar je werk gaat, plukken klanten en collega’s daar de vruchten van. Daarom krijg je veel vrijheid en verantwoordelijkheid om jouw werk en loopbaan zelf in te richten. Wil je een opleiding volgen? Een dagje meedraaien op een andere afdeling? Jouw innovatieve idee pitchen? Kom maar op! Met Het Nieuwe Werken kiezen we voor een goede balans tussen werk en vrije tijd. Jij bepaalt – in overleg – zelf waar en wanneer je werkt.\u003c/p\u003e\n\u003cp\u003eLees meer over \u003ca href=\"https://www.devolksbank.nl/werken-bij/de-volksbank-als-werkgever.html\"\u003ede Volksbank als werkgever\u003c/a\u003e en over \u003ca href=\"https://www.devolksbank.nl/werken-bij/vakgebieden/it-2.html\"\u003ewerken bij onze IT-organisatie\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSalaris en extra's\u003c/strong\u003e\nAls front end developer kom je in schaal 8 of 9, maximaal € 4.779,51 bruto per maand op basis van een 36-urige werkweek, dit hangt af van de jaren ervaring die jij met je meeneemt. Daarnaast profiteer je van een individueel keuzebudget, waarmee je zelf kiest wanneer je jouw vakantiegeld en dertiende maand ontvangt. Reis je liever eerste klas? Dat mag natuurlijk ook.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHier kom je te werken\u003c/strong\u003e\nJij gaat werken bij een van de scrumteams van de value-organisatie. Jouw team ontwikkelt applicaties die nodig zijn om veranderingen in de business te realiseren en implementeren op het gebied van betalen, wonen, finance en risk, en klantrelaties. Ook zelf zijn we volop in ontwikkeling. Zo beland je midden in de transitie naar DevOps-teams en krijg je de kans om mee te denken over verbetering en verandering. Hoewel je standplaats Den Bosch is, kan het zijn dat je ook regelmatig thuis of op onze locatie in Utrecht werkt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ede Volksbank\u003c/strong\u003e\nDe organisatie achter ASN Bank, BLG Wonen, Regiobank en SNS, dat is de Volksbank. Met een balanstotaal van € 61 miljard is de Volksbank de vierde retailbank van Nederland. Groot genoeg om jouw persoonlijke ambities waar te maken en compact genoeg om zichtbaar impact te hebben. Door de korte lijnen zit je snel met beslissers aan één tafel. Onze cultuur is informeel en down-to-earth. Bij ons kun je jezelf zijn en werk je samen met een diverse club van zo’n 4.500 collega’s aan een omslag in de bankenwereld. Met lef, optimisme en innovatiedrang brengen wij de menselijke maat terug in bankieren. Dat wil zeggen dat we oprecht de belangen van mens, milieu en maatschappij voorop stellen en verantwoorde keuzes maken in onze bedrijfsvoering. Bouw jij mee aan de bank van de toekomst?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van Front-End Developer\u003c/strong\u003e\nUpload je motivatie en cv via de \u003ca href=\"http://devolksbank.onlinevacatures.nl/nl/Vacancy/Postulate/126187\"\u003esollicitatiebutton\u003c/a\u003e.\nWe nemen dan zo snel mogelijk contact met je op.\u003c/p\u003e\n\u003cp\u003eVoor meer informatie over de sollicitatieprocedure kun je terecht bij Nikki Gunnink, recruiter, via 06 – 12 65 62 29.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van Front-End Developer\u003c/strong\u003e\nUpload je motivatie en cv via de \u003ca href=\"http://devolksbank.onlinevacatures.nl/nl/Vacancy/Postulate/126187\"\u003esollicitatiebutton\u003c/a\u003e.\nWe nemen dan zo snel mogelijk contact met je op.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9da351508db094709a04a8acf053d6bd61c480c0/Logo%202019.png"
  },
  {
    "id": "b9788de5-7f1f-4e45-9b75-7a938229e5c3",
    "type": "Contract",
    "url": "https://jobs.github.com/positions/b9788de5-7f1f-4e45-9b75-7a938229e5c3",
    "created_at": "Fri Mar 08 00:45:31 UTC 2019",
    "company": "POMPUR.COM",
    "company_url": "http://www.pompur.com",
    "location": "Remote",
    "title": "Senior Swift iOS Mobile Developer (Freelance and Remote) to Code Full App",
    "description": "\u003cp\u003eI am an experienced founder based in New York City who just completed the UI/UX for a new type of niche social/dating app I'll be launching called POMPUR. I'm looking to hire a highly experienced Swift iOS mobile developer to code the POMPUR app for iOS from end to end from scratch using my design files and highly detailed storyboards.\u003c/p\u003e\n\u003cp\u003ePlease read the 9 items below for more details on the job. When sending in your application for the job please also include your written answers/thoughts on the 9 items below. Your written answers/thoughts to these 9 items will be considered a major part of your interview.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eYou will be programing the frontend in Swift (I can consider React Native on a case by case basis, but will more than likely be going with Swift because I understand Swift is better for highly design oriented apps like mine). Please let me know how many years of Swift experience you have. Please also let me know how many different Swift apps you have worked on.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eI'd like the backend programed using Firebase, Node.js or a combination of the two. It is ideal if you can program both the backend and the frontend entirely yourself. If you can only program the frontend, it would be ideal if you can bring on an additional developer you have worked with before to program the backend. With all this in mind, please let me know if you will be programing the backend yourself or will need to have another developer to do it.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe design files were made in Sketch. You can program directly from the Sketch files OR I can have the Sketch files uploaded to Zeplin.io according and you can program from Zeplin.io. Aside from being a design handoff tool, I understand Zeplin.io has some pretty powerful tools/plugins for generating some (obviously not all) of the app's rudimentary frontend code. I have no experience using these Zeplin.io code generation tools/plugins, but hear they are great and I'm totally fine with you using them if you think they will give high quality results.\nOverall, I want to use whichever option (Sketch vs. Zeplin vs. Zeplin’s code generator) will give the final app the most pixel perfect design match to my original design files.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRegarding the UX, I have extremely detailed storyboards showing virtually every user case scenario you can imagine (even very boring things like what happens if a user forgets their password). I went into such detail with these storyboards so that you will not have to make any UX decisions on the fly while programing. Hopefully not having to make any UX decisions on the fly will make programing as simple/straightforward for you as possible. I have some mild desktop C# programing experience myself (nothing to do with mobile or Xamarin) so see how not having to make any UX decisions while coding can be very helpful to a developer.\nI’m realizing now that item 4 is not actually a question, but just something I am pointing out. Please still acknowledged you have read and are fully comfortable with what I am saying in item 4.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFrom a pure engineering/functionality POV, the app is pretty similar to Tinder (of course there are some key additional features you will find out about when you review my designs). With that in mind, it is ideal if you feel you can code a \"basic\" clone of Tinder (including the backend) in 100-160 hours of work or less. I can consider applicants who feel it will take them more than 160 hours of work to do this on a case-by-case basis.\nBy \"basic\" I just mean the basic functionality end-users of Tinder are aware of while using Tinder, not any advanced/proprietary backend functionality Tinder may have behind the scenes that end users are not aware of (such as artificial intelligence matching, advanced/proprietary advertising targeting and so on). By \"basic\" I also mean it has to be bug free. \"BASIC\" DOES NOT MEAN IT CAN CONTAIN BUGS!:) THE WORD \"MVP\" DOES NOT MEAN IT CAN CONTAIN BUGS EITHER!:) Speed to market (without sacrificing code quality of course) is very important to me.\nIn your response please mention how many hours of work you think making the above-mentioned Tinder clone would take you.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePlease send links to any live iOS apps you are proud of whose CURRENT version you worked on. Please also explain what your role was exactly on the CURRENT version. I'm ideally looking to test out an app whose CURRENT version was programed 100% by you.\n(Please also explain any known issues/bugs I should be aware of while I test the apps you send.)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePlease send your resume and/or LinkedIn profile. If possible, please also send any additional online profiles you have that you feel will help me understand your programming skills and who you are overall (such as a Github profile, Stack Exchange profile and/or even a Twitter account).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou must be based in the USA or Canada. In your response please let me know what country and state (or Provence) you are located in.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou will be working remotely plus on a part-time, freelance and contract basis. We will break the entire project up into separate milestones and each milestone will have its own budget. The budget for each milestone can be based on your hourly fee or a flat fee, whichever you prefer. Please acknowledge you are comfortable working in this fashion.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eLastly, I am only looking to work with the best of the best developers out there and pay will reflect this accordingly. Please feel free to click this link \u003ca href=\"https://bit.ly/2XLscdg\"\u003ehttps://bit.ly/2XLscdg\u003c/a\u003e for more information on my background.\nThanks and I look forward to building a masterpiece with you!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"mailto:jobs@pompur.com\"\u003ejobs@pompur.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2RnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a9b187cb7037b87c244afb7f8054c044abc24646/pompur.com.png"
  },
  {
    "id": "5c1e7811-25c1-4674-a7fb-ec277fcad643",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5c1e7811-25c1-4674-a7fb-ec277fcad643",
    "created_at": "Wed Mar 06 15:56:53 UTC 2019",
    "company": "Bene Studio Ltd.",
    "company_url": "http://www.benestudio.co",
    "location": "Budapest",
    "title": "Senior Full-stack React and Node Engineer - Full Relocation to Budapest",
    "description": "\u003cp\u003eTO BUILD PRODUCTS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewhich are diverse, from healthcare to real estate\u003c/li\u003e\n\u003cli\u003emaking better the lives of the people globally\u003c/li\u003e\n\u003cli\u003ewith the latest JavaScript technologies\u003c/li\u003e\n\u003cli\u003eusing your creativity, empowerment and team player attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO GAIN EXPERIENCE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efrom the varied, 1-6 months long projects\u003c/li\u003e\n\u003cli\u003ewithin the English-speaking, international, growing team of highly skilled engineers,\u003c/li\u003e\n\u003cli\u003ewho passed the famously challenging bene : studio assessment\u003c/li\u003e\n\u003cli\u003eduring the journey of your Professional Development Plan\u003c/li\u003e\n\u003cli\u003ewith the help of your dedicated Mentor\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO REFRESH YOURSELF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eby enjoying the flexible schedule\u003c/li\u003e\n\u003cli\u003erelying on the stable, calculable job and salary\u003c/li\u003e\n\u003cli\u003ein the team which won the Loveable Workplace Prize\u003c/li\u003e\n\u003cli\u003eat the bike, dog and family friendly Office of the Year 2016, where you can have a massage, play ping - pong or drink a coffee/fröccs at the in-house café\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO SHARE YOUR KNOWLEDGE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eas a Mentor within the team\u003c/li\u003e\n\u003cli\u003eat our blog or one of the leading meetups, conferences\u003c/li\u003e\n\u003cli\u003eat bene : studio Workshops!, the most popular cutting-edge tech workshops in Hungary\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RELOCATE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einto the heart of Europe, to the beautiful, safe and cheap Budapest\u003c/li\u003e\n\u003cli\u003ewith the adaptation guidance, flight ticket, temporary housing and visa services provided by us\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RECEIVE FROM US\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea MacBook Pro\u003c/li\u003e\n\u003cli\u003eHUF 450 000 – HUF 710 000 net salary (calculated for full time)\u003c/li\u003e\n\u003cli\u003ewith paid leaves and sick-leaves\u003c/li\u003e\n\u003cli\u003epromotion reflecting the improvement of your skills, experiences and your contribution to the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIF YOU MET THE REQUIREMENTS OF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in software engineering\u003c/li\u003e\n\u003cli\u003eJavaScript ES6\u003c/li\u003e\n\u003cli\u003eHTML5, CSS3\u003c/li\u003e\n\u003cli\u003eReact.js\u003c/li\u003e\n\u003cli\u003eRedux\u003c/li\u003e\n\u003cli\u003eNode.js\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; noSQL\u003c/li\u003e\n\u003cli\u003eAlgorithms, data structures\u003c/li\u003e\n\u003cli\u003eAWS \u0026amp;/or Azure\u003c/li\u003e\n\u003cli\u003eStrong systems design skills\u003c/li\u003e\n\u003cli\u003eexperienced in all phases of the software development lifecycle\u003c/li\u003e\n\u003cli\u003ebeing the tech lead of one or more projects at a time\u003c/li\u003e\n\u003cli\u003eDeeper knowledge of a CI tool\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOR EVEN GET ADVANTAGES HAVING\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMobile development experience\u003c/li\u003e\n\u003cli\u003eKnowledge of infrastructure as code software tools\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://benestudio.co/joinus/#seniorfullstackengineer\"\u003ehttps://benestudio.co/joinus/#seniorfullstackengineer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXhnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c98f8639ffd882efa6c9f9bb075b4170b6baeef1/YouTube%20Video%20Thumbnail.png"
  },
  {
    "id": "535c0ce7-c34d-42bf-bb5d-81e12fc29e70",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/535c0ce7-c34d-42bf-bb5d-81e12fc29e70",
    "created_at": "Fri Mar 01 16:51:29 UTC 2019",
    "company": "Solve",
    "company_url": "http://solvehq.com",
    "location": "London, UK",
    "title": "Backend/API Engineer",
    "description": "\u003cp\u003eSolve is creating a true crime/mystery mobile game, launched off the back of the success of an incredibly popular Snapchat channel with 5+ million fans. Players are placed at the center of interactive mysteries that they must use their deductive skills to complete. We are backed by a top-tier fund, Upfront Ventures, with our content team in Los Angeles and product team in London.\nWe are looking for a Backend Engineer to help shape and build the services and infrastructure that powers our upcoming mobile game. You will join the product team in London to craft an entirely serverless architecture on AWS, you will write resilient code as well as the service infrastructure and tools required to run that code in production.\u003c/p\u003e\n\u003cp\u003eWHAT YOU'LL DO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, maintain, and observe APIs and Services on AWS.\u003c/li\u003e\n\u003cli\u003eWork with the game development team to help deliver a high performance mobile game, powered by the services you’ll help build.\u003c/li\u003e\n\u003cli\u003eWrite high level acceptance and load tests to ensure services are reliable and scale\u003c/li\u003e\n\u003cli\u003eCreate or extend the tools necessary to build a 100% serverless stack on AWS\u003c/li\u003e\n\u003cli\u003eKeep up to date documentation of the services and tools you are responsible for\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT TO BRING\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of experience building backend services\u003c/li\u003e\n\u003cli\u003eExperience with large-scale distributed real-time systems (AWS experience preferred but not required).\u003c/li\u003e\n\u003cli\u003eWe’re built mostly on nodejs, but are open to candidates with experience in other languages well-positioned in the serverless world: go, python, etc.\u003c/li\u003e\n\u003cli\u003eIdeally some experience building serverless applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYOU MIGHT WORK ON\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVideo ingestion and distribution services\u003c/li\u003e\n\u003cli\u003eAnalytics gathering, processing, and visualizing services\u003c/li\u003e\n\u003cli\u003eMeta-game or user services\u003c/li\u003e\n\u003cli\u003eObservability services for the backend team\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eSend your CV to \u003ca href=\"mailto:engineering@solvehq.com\"\u003eengineering@solvehq.com\u003c/a\u003e to apply\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1327f5af0809206746006102393cd353d93c5a07/SolveLogo_Red_HighRes.png"
  },
  {
    "id": "bd2614bd-798d-4599-b304-38795c5df872",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bd2614bd-798d-4599-b304-38795c5df872",
    "created_at": "Fri Mar 01 10:39:39 UTC 2019",
    "company": "AJ Madison",
    "company_url": "http://careers.ajmadison.com?campaign=1098",
    "location": "Brooklyn NY",
    "title": "Backend (Architect) Lead",
    "description": "\u003cp\u003e\u003cstrong\u003eBackend (Architect) Lead\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCore responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCome join and exciting and talented team. This is a full stack team with challenges from React apps to building ETL pipelines. If you want to bring your skill set to bear across scalable distributed systems, commerce, state-of-the-art visualization, and deep logistics to solve the last mile delivery problem, then this job is for you.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead design, development, implementation and maintenance of applications \u0026amp; back-end services demonstrating service-oriented architecture and secure applications development technology best practices.\u003c/li\u003e\n\u003cli\u003eWork with product managers and technical team in a cross-functional environment, to implement high quality products that meet business goals.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCore capabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHands-on expertise in enterprise technology applications architecture, design, development and support.\u003c/li\u003e\n\u003cli\u003eGreat management and team development skills: ability to set goals for a team and every one of its members, delegate intelligently, mentor engineers, deliver frequent and honest feedback, help team members grow in their careers, and deliver results.\u003c/li\u003e\n\u003cli\u003eExpertise and interest in growing teams: interviewing junior and senior engineers, collaborating with recruiting, smoothly onboarding new team members.\u003c/li\u003e\n\u003cli\u003eGood software engineering methodology: meaningful and deeply-rooted opinions about testing and code quality, ability to make sound quality/speed trade-offs.\u003c/li\u003e\n\u003cli\u003ePassionate about writing code (yes you will write code).\u003c/li\u003e\n\u003cli\u003eSolid knowledge of applications performance improvement techniques and caching solutions.\u003c/li\u003e\n\u003cli\u003eExperience developing with client-side web technologies {REACT, CSS, Javascript, AJAX}.\u003c/li\u003e\n\u003cli\u003eExcellent problem solving, critical thinking and communication skills.\u003c/li\u003e\n\u003cli\u003eExceptional technical skills in backend (and frontend) engineering.\u003c/li\u003e\n\u003cli\u003eHighly experienced with back-end programming languages {Ex: PHP, Python, Ruby, Java etc}.\u003c/li\u003e\n\u003cli\u003eSolution design experience in large-scale projects, ideally of an eCommerce nature.\u003c/li\u003e\n\u003cli\u003eExpert in Java, NodeJS, Jenkins, GIT, RESTful APIs.\u003c/li\u003e\n\u003cli\u003eMySQL DB experience would be advantage.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAcademic: BA/BS degree in computer science or equivalent.\u003c/li\u003e\n\u003cli\u003eProfessional: 5+ years experience developing software as an engineer; 2+ years experience as an engineering manager or technical lead.\u003c/li\u003e\n\u003cli\u003eSignificant experience building and operating critical high-scale systems.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou're a great cultural fit if:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou enjoy an environment where everyone is encouraged to add value at the most strategic level.\nYou fit best in a fast-paced, high-integrity, low hand-holding environment. You are independent and self-motivated.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003cstrong\u003eAre you up for the challenge?\u003c/strong\u003e\nPlease send your application via the \u003ca href=\"https://ltpx.nl/n3lsCcZ\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7c144d7a39c5017b4d2d47e59f3c59f74599eff4/LogoAJMadison.jpg"
  },
  {
    "id": "6d7d93f9-5802-4368-be93-fe3cec50cd58",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6d7d93f9-5802-4368-be93-fe3cec50cd58",
    "created_at": "Thu Feb 28 14:53:36 UTC 2019",
    "company": "UNIQ GmbH",
    "company_url": "http://www.un-iq.de/",
    "location": "Holzwickede",
    "title": "FULL STACK DEVELOPER (M/W/D) PHP",
    "description": "\u003cp\u003e\u003cstrong\u003eDu liebst Herausforderungen, nutzt Chancen Dich einzubringen und fühlst Dich sowohl im Backend als auch im Frontend zuhause? Dann suchen wir genau Dich als unseren neuen Full Stack Developer (m/w/d) PHP!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eÜBER UNS\u003c/h2\u003e\n\u003cp\u003eUNIQ ist ein einzigartiges und innovatives Unternehmen mit mehr als 200 Mitarbeitern. Wir verstehen uns als UNIQ-Family und vereinen die Werte frei, echt, bunt und treu. Gemeinsam arbeiten wir kontinuierlich an der Zukunft unserer Marken. Für den Einsatz und den Zusammenhalt des Teams wurde UNIQ mehrfach ausgezeichnet. Passend zu unserem bekanntesten Portal Urlaubsguru - das bereits seit 2012 besteht – befindet sich unser Hauptsitz direkt gegenüber des Dortmunder Flughafens. Neben den Urlaubsguru Stores und den internationalen Holidayguru-Varianten gehören auch FashionFee, Captain Kreuzfahrt, Mein Haustier und seit August 2018 Prinz Sportlich als eigenständige GmbH \u0026amp; Co. KG zum umfangreichen Portfolio von UNIQ.\u003c/p\u003e\n\u003cp\u003eDie technische Basis für die Arbeit der verschiedenen Content-Teams wird von unserem zehnköpfigen Entwicklungsteam bestehend aus Front- und Backendentwicklern sowie Webdesignern konzipiert und umgesetzt. Das Team stellt sich täglich den Herausforderungen von der Gestaltung eines perfekten Webdesigns bis hin zur Implementierung skalierbarer Cloud-Services innerhalb eines schnell wachsenden Unternehmens. Dabei setzen wir auf moderne Technologien und entwickeln somit stets am Puls der Zeit.\u003c/p\u003e\n\u003cp\u003eZur Verstärkung unseres Teams suchen wir ab Mai 2019 einen\u003c/p\u003e\n\u003ch2\u003eFULL STACK DEVELOPER (M/W/D) PHP\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eFULL-TIME EMPLOYEE\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eDEINE AUFGABEN\u003c/h2\u003e\n\u003cp\u003eAls Full Stack Developer (m/w/d) PHP bist du Teil des UNIQ-IT-Teams. Deine Aufgabe ist es in einem agilen Softwareteam unsere Produkte an die Spitze zu bringen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu unterstützt aktiv bei der agilen Umsetzung von Features und Produkt-Launches\u003c/li\u003e\n\u003cli\u003eEntwurf neuer Architekturen, Analyse von komplexen Problemstellungen\u003c/li\u003e\n\u003cli\u003eKonstante Optimierung unserer Systeme\u003c/li\u003e\n\u003cli\u003eDu trägst die Verantwortung für Qualitätsstandards, die produzierte Software und Teile der Systemarchitektur\u003c/li\u003e\n\u003cli\u003eDirekte Kommunikation mit dem Team, Stakeholdern und POs\u003c/li\u003e\n\u003cli\u003eMitwirkung an der ständigen Verbesserung unserer schlanken Prozesse\u003c/li\u003e\n\u003cli\u003eDokumentation der technischen Entwicklungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDEIN PROFIL\u003c/h2\u003e\n\u003cp\u003eUnser(e) Wunschbewerber(-in) als Full Stack Developer (m/w/d) PHP ist einzigartig, echt und voller Motivation, um mit einem großartigen Team gemeinsam Träume zu realisieren – einfach UNIQ!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSehr gutes Wissen im PHP-Backend Bereich: Best Practices, Frameworks, Libraries, Pattern,\nArchitektur und Erfahrung mit Unit- und funktionellen Tests\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse von SPA sind vorteilhaft (z.B. ReactJs, Vue.js, AngularJs)\u003c/li\u003e\n\u003cli\u003eGutes Verständnis von SQL, inklusive komplexer Queries und Optimierungen sowie Wissen zu anderen Storage-Systemen als auch Erfahrung mit Message Brokern, Caching und APIs sind wünschenswert\u003c/li\u003e\n\u003cli\u003eKenntnisse in der agilen Arbeitsweise sowie DDD, BDD, TDD sind von Vorteil\u003c/li\u003e\n\u003cli\u003eArbeit mit Continuous Integration und Container-Systemen sowie auch klassischer Deployment Strategien ist ein Leichtes für dich\u003c/li\u003e\n\u003cli\u003eAndere Backend-Erfahrung, z.B. Nodejs oder Go, sind von Vorteil\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003cli\u003eDu bist ein Teamplayer und achtest auf Qualität\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWAS WIR BIETEN\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eFLEXIBLE GESTALTUNG\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003evon Arbeitszeiten und Urlaub (30 Tage plus)\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSOZIALE URLAUBSTAGE\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e2 Urlaubstage pro Jahr für soziales Engagement\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eINTERNATIONALES UMFELD\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eArbeiten mit Kollegen aus aller Welt\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eAUSLANDSKRANKENVERSICHERUNG\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJeder Mitarbeiter kann sich auf Wunsch versichern lassen\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eWORLD OFFICE\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDie gesamte Welt wird mehrfach im Jahr zum Büro\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eFEEL GOOD MANAGEMENT\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJeder Mitarbeiter soll sich wohlfühlen\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSPORT \u0026amp; FIRMENEVENTS\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAktiv sein oder auch gemeinsam feiern\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eFREE DRINKS \u0026amp; SNACKS\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKaffee, Tee, Obst, Milchshakes und viele andere Leckereien\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eUND VIELES MEHR...\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLass dich von UNIQ überraschen\u003c/p\u003e\n\u003ch2\u003eINTERESSIERT?!\u003c/h2\u003e\n\u003cp\u003eDann werde Teil unseres UNIQ Teams und bewirb dich jetzt über den Bewerbungsformular!\nWir freuen uns auf deine Bewerbung!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://un-iq.redirect.your-jobresponse.com/full_stack_developer_m_w_d_php_holzwickede/243883/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eMaren Lukas\nUNIQ GmbH\nRhenus Platz 2\n59439 Holzwickede\n\u003ca href=\"http://www.un-iq.de\"\u003ewww.un-iq.de\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://un-iq.redirect.your-jobresponse.com/full_stack_developer_m_w_d_php_holzwickede/243883/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlpmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fbecadb1418c82713a52afedc5cc1962b362003d/Uniq.jpg"
  },
  {
    "id": "3fb80657-75a4-49f8-ad30-6091f53f8807",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3fb80657-75a4-49f8-ad30-6091f53f8807",
    "created_at": "Wed Feb 27 14:32:50 UTC 2019",
    "company": "UMI - Urban Mobility International",
    "company_url": "https://www.urban-mobility.io",
    "location": "Berlin",
    "title": "Android Developer (m/f/d)",
    "description": "\u003cp\u003eWe drive the future of mobility. With the backing and support of the Volkswagen AG, we will develop innovative, sustainable solutions that will make movement in urban spaces more flexible and more comfortable. Our customer-centric approach means that to us, mobility is not just a means to an end. It’s a passion. We are UMI.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour background\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have successfully built multiple B2C native mobile apps for Android and iOS and have at least 3+ years of experience in a professional app development environment\u003c/li\u003e\n\u003cli\u003eYou’re an expert in native programming for Android (Kotlin, Java)\u003c/li\u003e\n\u003cli\u003eYou are familiar with Firebase and backend technologies (Node JS)\u003c/li\u003e\n\u003cli\u003eYou have a proven record of working in strong cross-functional teams to bring innovative, user-centric apps to market\u003c/li\u003e\n\u003cli\u003eYou would consider yourself a T-shaped developer\u003c/li\u003e\n\u003cli\u003eYou are experienced with micro service and event-driven serverless computing\u003c/li\u003e\n\u003cli\u003eYou’re eager to try out new technologies to create the best digital products\u003c/li\u003e\n\u003cli\u003eYour English is fluent and your teamwork is excellent\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary\u003c/li\u003e\n\u003cli\u003e30 vacation days\u003c/li\u003e\n\u003cli\u003eMobility budget\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/21316914ac9b0b46571e5b82f7ffa1406c538bc5/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f633f6369643d36363263393430372d663863622d343032342d613136392d393063316334356463666234266a69643d61356431363139622d623061332d343032382d623939362d353662326133663732306132267069643d65303530656665392d356264622d346164642d393464612d6562633163646238303465622665633d76696577253341706978656c2663623d687474707325334125324625324673332d65752d776573742d312e616d617a6f6e6177732e636f6d253246676f686972696e672d7075626c69632d617373657473253246706978656c2e676966\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4\u0026amp;jid=a5d1619b-b0a3-4028-b996-56b2a3f720a2\u0026amp;pid=e050efe9-5bdb-4add-94da-ebc1cdb804eb\u0026amp;ec=click%3Aapply_url\u0026amp;cb=https%3A%2F%2Furban-mobility-international-gmbh-jobs.personio.de%2Fjob%2F86634%23apply\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--085d9be1cb855d001443cfc9c4dbeed5a9171d9f/UMI.jpeg"
  },
  {
    "id": "e4054059-3418-4f09-a15c-a6a03ce37e4a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e4054059-3418-4f09-a15c-a6a03ce37e4a",
    "created_at": "Tue Feb 26 23:53:05 UTC 2019",
    "company": "Launch",
    "company_url": "http://www.launchxd.com",
    "location": "Atlanta, GA ",
    "title": "Senior Full Stack Developer",
    "description": "\u003cp\u003eObjective​:\u003c/p\u003e\n\u003cp\u003eLaunch, an award-winning digital agency, is seeking an experienced, outgoing, and enthusiastic Developer to join our team of strategists, UXers, designers, and developers. At Launch, we build digital experiences that deliver results - we love what we do and the people we work with. And we’d like to add to that group.\u003c/p\u003e\n\u003cp\u003eAs a Developer you’ll be part of a Sr. Technology team that implements excellent digital experiences ranging from web apps, responsive sites and mobile applications. You should be motivated, inspired, and excited to create amazing work for our clients.\u003c/p\u003e\n\u003cp\u003eWhat’s Needed:\u003c/p\u003e\n\u003cp\u003e● Must live in Atlanta, GA (flexible WFH)\u003c/p\u003e\n\u003cp\u003e● Min. 5 years professional experience\u003c/p\u003e\n\u003cp\u003e● React (preferred), AngularJS, Vue.js Backbone or other client-side MVC experience\u003c/p\u003e\n\u003cp\u003e● Experience with JavaScript build tools and dependency management (npm / yarn, grunt /\ngulp)\u003c/p\u003e\n\u003cp\u003e● 5 years of HTML, CSS (Sass preferred), and JavaScript / TypeScript experience\u003c/p\u003e\n\u003cp\u003e● Experience creating responsive designs (Bootstrap, Foundation, mobile, etc.)\u003c/p\u003e\n\u003cp\u003e● REST API design and implementation\u003c/p\u003e\n\u003cp\u003e● Experience in CMS integration and CMS customization (PHP, Node, .NET, or Java)\u003c/p\u003e\n\u003cp\u003e● Knowledge of SQL and NoSQL data stores (MySQL/PostgreSql, MongoDB, Cassandra,\nNeo4J, CouchDB)\u003c/p\u003e\n\u003cp\u003e● Strong collaboration and communication skills — must be willing to work in an\nopen-seating team environment.\u003c/p\u003e\n\u003cp\u003e● Comfortable to operate in an agile, dynamic environment\u003c/p\u003e\n\u003cp\u003eDaily/weekly responsibilities:\u003c/p\u003e\n\u003cp\u003e● Implement Software Requirements for multiple clients\u003c/p\u003e\n\u003cp\u003e● Code, Design and Build JavaScript driven applications\u003c/p\u003e\n\u003cp\u003e● Creating and consuming REST / JSON-based APIs\u003c/p\u003e\n\u003cp\u003e● Experiment width new technologies and innovative ways to solve problems for clients in\ndifferent industries\u003c/p\u003e\n\u003cp\u003e● Work with UX, creative and other business partners.\u003c/p\u003e\n\u003cp\u003e● Facilitate code reviews, code quality checks, testing, automation, etc.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease submit resume to \u003ca href=\"mailto:julia@launchxd.com\"\u003ejulia@launchxd.com\u003c/a\u003e.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTlmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aaf3267ebc2e32d1d66368ea7e6ee7e869974bb1/k25kX5a1_400x400%207.18.29%20PM.jpg"
  },
  {
    "id": "7f6b6356-fa5d-4d18-82b7-06445e2ab286",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7f6b6356-fa5d-4d18-82b7-06445e2ab286",
    "created_at": "Tue Feb 26 15:44:58 UTC 2019",
    "company": "Red Badger",
    "company_url": "https://red-badger.com/jobs/",
    "location": "London",
    "title": "Senior Fullstack Engineer ",
    "description": "\u003cp\u003eSenior Software Engineer Consultant\n£60.000 - £85,000\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced engineer to join our passionate, lean, agile, fast growing and tech-loving team on a permanent basis.\u003c/p\u003e\n\u003cp\u003eThe projects we are working on are innovative with amazing frontend design and UX. You will be a polyglot with extensive experience across a wide range of technologies and projects and will relish tackling and solving tough problems.\u003c/p\u003e\n\u003cp\u003eYou’ll be comfortable designing and articulating solutions, working closely with clients to ensure we’re delivering the right thing in the right way. Understanding that delivering quality, working software, which meets the user’s needs, is paramount.\u003c/p\u003e\n\u003cp\u003eWe don't dictate how you work at Red Badger, each team is totally autonomous and entrusted to make the right decisions.As a Red Badger software engineer, you will allow each solution to drive the technology choice, not the other way around. You will be technology agnostic and choose the right tool for the job.\u003c/p\u003e\n\u003cp\u003eWhat we need from you, is some experience with the below:\u003c/p\u003e\n\u003cp\u003eES6, Ruby, Node.js, Go, Clojure,\nJavaScript, Angular\nReact.js, Elm, Flow\nSass, CSS Modules, CSS-in-JS, PostCSS\nMocha, Sinon, Chai, RSpec\nElasticSearch, Redis, DynamoDB, PostgreSQL\nDocker, AWS Stack, Heroku, Terraform, Serverless\nResponsive (and Adaptive) Layouts\nRESTful APIs and GraphQL\u003c/p\u003e\n\u003cp\u003eAbout Red Badger\u003c/p\u003e\n\u003cp\u003eThe best bit about Red Badger is, of course, the team. We’ve been around for 7 years now and we are nearly 90 strong. We are really proud of our team; we support and learn a lot from each other; we work really hard but have fun doing it. We are a diverse group made up of 22 different nationalities, speaking 17 different languages.\u003c/p\u003e\n\u003cp\u003eWe were founded by 3 guys who have considerable tech and consultancy experience and still own 100% of the company. We’ve been consistently profitable and have grown responsibly from the beginning.\u003c/p\u003e\n\u003cp\u003eWe are based at Old Street in the heart of “tech city” and get thoroughly stuck in with the brilliant community around us. We run several meetups including the hugely popular React London, invite other groups to host their events in our office such as Lua London and Ladies Who Code and speak at events like Digital Shoreditch and LNUG.\u003c/p\u003e\n\u003cp\u003eWe make sure our team is well looked after with generous salaries and a great benefits package which includes -\u003c/p\u003e\n\u003cp\u003eAnnual £2K training budget\nGenerous Pension\nGroup Life Insurance\nIncome Replacement Benefit\nCritical Illness Cover\nPrivate Medical Insurance\nYour choice of hardware and mobile phone\nMatched (pre-tax) charity GAYE donations\nOpen source contribution scheme\u003c/p\u003e\n\u003cp\u003ePlease let us know if you require any reasonable adjustments at any point in the interview process.\u003c/p\u003e\n\u003cp\u003eRed Badger is proud to be an equal opportunities employer and we're dedicated to hiring and developing a diverse workforce.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eplease email your CV to - \u003ca href=\"mailto:jack.jeffery@red-badger.com\"\u003ejack.jeffery@red-badger.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--54b823c71ee9868e319bb3b59943cdc48634aad9/RB_Screen_Logos_Artwork-02%20(1).png"
  },
  {
    "id": "d120472d-ecc6-44cb-bc8a-b6bc70822631",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d120472d-ecc6-44cb-bc8a-b6bc70822631",
    "created_at": "Mon Feb 25 16:15:42 UTC 2019",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "location": "Culver City",
    "title": "Software Engineer",
    "description": "\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\nThe Platform Infrastructure Engineering (PIE) organization is building the next generation tools empowering Apple’s software developers to build products our customers love. We're a fast moving, highly skilled but small team designing and building a continuous integration and delivery system that Apple’s developers utilize to build, test and deploy their code with. Our system has to scale globally, stay highly available, and \"just work”. We're looking for a talented and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you.\u003c/p\u003e\n\u003cp\u003eKey Qualifications: \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava and/or other JVM languages like Scala, Clojure and Groovy.\u003c/li\u003e\n\u003cli\u003eNoSQL: Cassandra, MongoDB; Caching: Redis, Memcached; RDBMS: MySQL, PostgreSQL.\u003c/li\u003e\n\u003cli\u003eAffinity to system level programming including scripting in Bash, Ruby and/or Python.\u003c/li\u003e\n\u003cli\u003eVirtual machines, containers and tools like Vagrant and Docker.\u003c/li\u003e\n\u003cli\u003eBuild tools: Gradle, Maven, Ant, Make, Rake, Grunt, Gulp, Ninja, Blaze/Bazel, Pants or others.\u003c/li\u003e\n\u003cli\u003eCI Solutions: Travis, Circle, Go, Jenkins, Team-City or others.\u003c/li\u003e\n\u003cli\u003eTesting frameworks: Junit, TestNG, Spock, Cucumber, Rspec, Mocha or others.\u003c/li\u003e\n\u003cli\u003eDeployment systems: EC2, Heroku,Engine Yard, App Engine. Application development frameworks: Finagle, Vert.x, Java Servlets, Node.js, Ruby On Rails, Django or others. Good understanding of Linux and OSX.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription: \u003c/p\u003e\n\u003cp\u003eBe intimately familiar with continuous integration and delivery. Love automation and tooling and believe they play a critical role in software development. You should be able to design, develop and deploy distributed systems. You should have the passion to design and develop tools developers love. Know your design patterns. Be curious about how systems work and how they fail. Be eager to learn new technologies and solutions. Love open source and collaboration. Be detailed oriented, and you should be proud of the work you put out. Have some cool work experiences to tell from your past.\u003c/p\u003e\n\u003cp\u003eEducation: \nBS, MS or PhD, in Computer Science, or equivalent experience\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200023001\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=0c97e249ab7bfe2aa483927f7daef1d9\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXRmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--63b95e88680f571db276d99b3aa5453559941526/Apple_300x300.jpeg"
  },
  {
    "id": "0d9470d0-a4ce-4b2c-9dfd-aa105a15d94e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0d9470d0-a4ce-4b2c-9dfd-aa105a15d94e",
    "created_at": "Sun Feb 24 22:02:44 UTC 2019",
    "company": "Opslock, Inc",
    "company_url": "https://opslock.com",
    "location": "Montreal, Canada",
    "title": "Javascript Developer (React/NodeJS)",
    "description": "\u003cp\u003eA computer science degree is nice, but is not required. We want people who have taken ownership of a problem and have build software on their own to solve it.\u003c/p\u003e\n\u003cp\u003eYou should apply if you you've built passion projects in Javascript that show your understanding and passion of a particular tech stack.\u003c/p\u003e\n\u003cp\u003eBonus points if you have experience with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStyling in HTML/CSS\u003c/li\u003e\n\u003cli\u003eBuilding your own tests\u003c/li\u003e\n\u003cli\u003eNoSQL databases\u003c/li\u003e\n\u003cli\u003eReact/Redux\u003c/li\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis person will be joining a small team of passionate problem-solving developers building scalable web applications in React, React-Native, and NodeJS.\u003c/p\u003e\n\u003cp\u003eWe have funding, great architecture, and are looking for someone who can hit the ground running and join us for this crazy ride. Stock Options available in addition to compensation.\u003c/p\u003e\n\u003cp\u003eDog-friendly office in the Mile End, we offer a flexible schedule, tons of autonomy and ownership, gym membership, and a ton of other great benefits.\u003c/p\u003e\n\u003cp\u003eLooking forward to meeting you!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply at \u003ca href=\"http://bit.ly/opslock-jsdev\"\u003ehttp://bit.ly/opslock-jsdev\u003c/a\u003e and mention that you found the job via github\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUpmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--403c6f61eaafc150d4bfe653cea62b67a51191d2/OpsLock%20Transparent%20BG%20Square%20-%2028307C%20copy.jpg"
  },
  {
    "id": "06071fe6-5924-481f-adf6-e4981c3fd6fb",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/06071fe6-5924-481f-adf6-e4981c3fd6fb",
    "created_at": "Fri Feb 22 11:40:26 UTC 2019",
    "company": "ricardo.ch",
    "company_url": "https://www.ricardo.ch/",
    "location": "Zug",
    "title": "Senior Frontend Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eAbout Ricardo\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCounting more than 3 million registered users, ricardo.ch is the biggest online marketplace in Switzerland. Every year, 5 million items are traded on our platform. To grow that number even further, we're looking to expand our team with talented and dedicated front end engineers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho we are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are an ambitious, friendly and open-minded bunch working from Zug, Belgrade and the Côte d'Azur where you will become part of one of our flat and agile product teams. We passionately extend and improve our marketplace and take 20% engineering time to master new technologies and improve our kick-ass stack! To celebrate our achievements after the sprint demo friday afternoon, everyone is invited to join our Beer o’Clock get-together and enjoy a smooth start into the weekend.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking within a cross functional product team in a SCRUMban context\u003c/li\u003e\n\u003cli\u003eExtend and improve our Single Page Applications and Node APIs\u003c/li\u003e\n\u003cli\u003eImplement and reason with our non-functional and business metrics\u003c/li\u003e\n\u003cli\u003eSpend 20% engineering time to improve your skills and our stack\u003c/li\u003e\n\u003cli\u003eTwo-weeks-workshops in Southern France or the Swiss Alps, to learn and innovate with the entire department\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnthusiasm about web technologies\u003c/li\u003e\n\u003cli\u003eA positive and proactive mindset\u003c/li\u003e\n\u003cli\u003e3+ years of relevant experience\u003c/li\u003e\n\u003cli\u003eExperience with Single Page Applications, Isomorphic is a plus\u003c/li\u003e\n\u003cli\u003eKnowledge about state management w/ libraries such as redux or mobX\u003c/li\u003e\n\u003cli\u003eRoutine in ensuring quality on every step of the testing pyramid\u003c/li\u003e\n\u003cli\u003eExperience delivering for cross browser and mobile first applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe do not accept unsolicited CVs from Third Party Agencies.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eYou can apply right \u003ca href=\"https://ricardochag.teamtailor.com/jobs/152092-senior-frontend-engineer-f-m-80-100/applications/new\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0ZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6c12f907a69ecc02a448da37f0a1425177e2ded5/logo_ri.jpg"
  },
  {
    "id": "4b452d3c-baf7-4205-9eb5-a091d2708c80",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4b452d3c-baf7-4205-9eb5-a091d2708c80",
    "created_at": "Thu Feb 21 17:45:09 UTC 2019",
    "company": "[m]pirik",
    "company_url": "https://www.mpirik.com",
    "location": "Milwaukee, WI",
    "title": "Senior Software Engineer (typescript, node.js, vue, postgres)",
    "description": "\u003cp\u003e[m]pirik is improving cardiology by collecting and analyzing data related to patient care. We are a small healthcare technology company with a suite of products ranging from communication tools to a data collection and analysis platform.\u003c/p\u003e\n\u003cp\u003eAre you interested in building elegant and scalable systems to help our customers unleash the power of their data? As a Senior Software Engineer, you will help scale our data processing pipelines, create and tune algorithmic data curation tools, and visualize data in meaningful ways for healthcare professionals. We build systems that clean, structure and understand clinical-level patient data and make use of the data to improve healthcare efficiency and diagnosis.\u003c/p\u003e\n\u003cp\u003eThe main tools that we use to build software are node.js/Typescript, Vue.js, PostgreSQL, and Amazon Web Services (AWS). Expertise with these tools is a huge plus, but having familiarity with other common web languages (such as C# or Java) and other databases are fine substitutes.\u003c/p\u003e\n\u003cp\u003eThis is not a remote position. Candidates need to be able to commute to downtown Milwaukee, WI.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBrainstorm with product owners and healthcare professionals on new features\u003c/li\u003e\n\u003cli\u003eContinuously ship new features for our cloud applications, from the backend to the frontend\u003c/li\u003e\n\u003cli\u003eWorking with support to triage and debug technical support requests\u003c/li\u003e\n\u003cli\u003eWriting clean, well-structured, and testable code, with an eye towards maintainability\u003c/li\u003e\n\u003cli\u003ePassionate about performance, reliability, and scalability of systems\u003c/li\u003e\n\u003cli\u003eTechnically mentor and guide a small team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills \u0026amp; Experience\u003c/strong\u003e\nTo be successful in this role, you will need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA thirst to learn new things and a curiosity of how things work\u003c/li\u003e\n\u003cli\u003eTo be self-driven and goal-oriented\u003c/li\u003e\n\u003cli\u003eProven experience delivering and maintaining a complex product\u003c/li\u003e\n\u003cli\u003eExperience unit testing new and new-to-you code\u003c/li\u003e\n\u003cli\u003eStrong communication skills, a positive attitude, and empathy\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus if you have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHistory working with large data sets for reporting and/or analysis\u003c/li\u003e\n\u003cli\u003eCloud environment (AWS, GCP, Azure, etc.) knowledge, ideally AWS\u003c/li\u003e\n\u003cli\u003eStrong UX and design sensibilities, and an eye for detail\u003c/li\u003e\n\u003cli\u003eExperience with a framework like Vue, React, or Angular\u003c/li\u003e\n\u003cli\u003eHealthcare or healthcare software experience\u003c/li\u003e\n\u003cli\u003eExperience in small startup environments\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your a brief description and your resume to \u003ca href=\"mailto:careers@mpirik.com\"\u003ecareers@mpirik.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cbd87b4524c4b5b894d2077b3f9b848a236ad476/mpirik%20logo%20RGB.png"
  },
  {
    "id": "65830be0-5593-4983-b368-3c68124fe3d4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/65830be0-5593-4983-b368-3c68124fe3d4",
    "created_at": "Thu Feb 21 16:28:17 UTC 2019",
    "company": "Happeo",
    "company_url": "http://www.happeo.com",
    "location": "Helsinki",
    "title": "Software Developer",
    "description": "\u003cp\u003e\u003cstrong\u003eAre you an expert at creating complex systems? Or do you know how to make delightful UIs? Perhaps you are a wizard that can do both? Then join us at Happeo!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re searching for a skilled software developer with an inquisitive mind to join our team of awesomeness in Helsinki.\u003c/p\u003e\n\u003cp\u003eIf you’ve got a strong track record in frontend, backend or both and enjoy the buzz of solving problems and making the magic happen to our customers, you could be the person for us! We love people who have hands on experience with programming languages like Java and JavaScript, frameworks like Node.js, React/Redux and love to deploy fast APIs and awesome integrations to the magical cloud.\u003c/p\u003e\n\u003cp\u003eThis position will be filled as soon as the right candidate shakes our hand, so get your application in asap!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur stack consists of JavaScript, React, React Native, Redux, styled components, ye olde Angular (hopefully not any more in a year), CSS, LESS, Node.js, Java, TensorFlow, SQL, Datastore, Firestore, Firebase, K8S, App Engine. We try to use the best tools and combinations for different tasks and give teams the say in what to use with what feature. We build our stuff on top of Google Cloud Platform (GCP) and use multiple parts of GCP in various tasks.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we expect from you:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKnowledge of some of these: Javascript, React, CSS, Java, Node.js, SQL, Continuous Integration\u003c/p\u003e\n\u003cp\u003ePrevious experience in software development in teams\u003c/p\u003e\n\u003cp\u003eKnowledge of common acronyms\u003c/p\u003e\n\u003cp\u003eA systematic way of working and a problem solving-oriented attitude\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIn addition we appreciate:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFamiliarity with Google Cloud Platform\u003c/p\u003e\n\u003cp\u003eFamiliarity with creating integrations\u003c/p\u003e\n\u003cp\u003eMachine Learning knowledge\u003c/p\u003e\n\u003cp\u003eInterest towards new technologies and a constant urge to learn\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer you:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePossibility to solve real world problems and receive fast feedback from the team and customers.\u003c/p\u003e\n\u003cp\u003eInteresting challenges and ability to use the newest technologies to tackle them.\u003c/p\u003e\n\u003cp\u003ePossibility to learn new things and grow as a developer.\u003c/p\u003e\n\u003cp\u003eAbility to influence architectural decisions and list of technologies used.\u003c/p\u003e\n\u003cp\u003eA working environment in the center of Helsinki.\u003c/p\u003e\n\u003cp\u003eFlexibility in exchange for your responsibility.\u003c/p\u003e\n\u003cp\u003eGood salary.\u003c/p\u003e\n\u003cp\u003e**Please note: you must be an EU citizen, or hold a valid work permit within Finland to be considered for this role. **\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply at: \u003ca href=\"https://happeo.freshteam.com/jobs/7jJI30tV6iab/software-developer\"\u003ehttps://happeo.freshteam.com/jobs/7jJI30tV6iab/software-developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakJmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22e2258b212409837bbfd8d4ac5cc9c49f2ef5a1/happeo-symbol%20D(1).png"
  },
  {
    "id": "b42ccb00-294f-4436-a42c-1195948d2d0a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b42ccb00-294f-4436-a42c-1195948d2d0a",
    "created_at": "Wed Feb 20 17:29:51 UTC 2019",
    "company": "Stealth Startup",
    "company_url": "http:",
    "location": "Remote",
    "title": "Lead Backend Developer",
    "description": "\u003cp\u003e** About the Company **\u003c/p\u003e\n\u003cp\u003eFounded in 2006, we are a privately held company in the performance advertising space. Over the past decade, we have earned and secured a reputation as industry leaders, known for using cutting edge technology and strategy for leveraging real-time predictive analytics to show users the right ads at the right time. We are headquartered in Australia with additional offices in India and China. Our team of 75+ has done over $3B in advertising spend. In 2018 alone, we generated over $50M in revenue.\u003c/p\u003e\n\u003cp\u003e** Why Stealth? **\u003c/p\u003e\n\u003cp\u003eThis job post will remain in stealth mode, but we will disclose full company details during the the interview process.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRole\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe have identified an exciting new advertising niche and are building out a lean team to tackle the opportunity head-on. This subdivision will report directly to a member of the executive team. Due to the competitive nature of the advertising space, we will not be disclosing details concerning the niche here..\u003c/p\u003e\n\u003cp\u003eThis subdivision will create a specialty web application that enables publishers to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCommand and control their advertising network’s ad tags from a single central system.\u003c/li\u003e\n\u003cli\u003eAccess detailed analytics about their existing revenue streams.\u003c/li\u003e\n\u003cli\u003eMediate existing advertising ad tags to increase revenue through algorithms\u003c/li\u003e\n\u003cli\u003eStrike direct deals with advertisers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou will focus primarily on the development of all server-side logic and ensuring high performance and responsiveness to requests from the front-end. Because you will be working with frontend developers to provide APIs, a basic understanding of front-end technologies is necessary.\u003c/p\u003e\n\u003cp\u003e** You Should Apply If **\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an experienced engineer and like working with a lean team. The team will be comprised of one executive team member, a front-end developer, a back-end developer (yourself), and a business development expert (for the first 3 months)\u003c/li\u003e\n\u003cli\u003eYou have agency and can think\u003c/li\u003e\n\u003cli\u003eYou are responsible and can be held accountable for your code\u003c/li\u003e\n\u003cli\u003eYou like working on MVPs, i.e. “move fast and break things”\u003c/li\u003e\n\u003cli\u003eYou want to work with experienced entrepreneurs and learn how to build an ROI-positive business\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e$96,000-$144,000 per year, commensurate with experience .\u003c/li\u003e\n\u003cli\u003eMonthly profit sharing.\u003c/li\u003e\n\u003cli\u003eEquity\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuilding and maintaining an Express-based Node.js API for the front-end to use\u003c/li\u003e\n\u003cli\u003eWriting reusable, testable, and efficient code\u003c/li\u003e\n\u003cli\u003eImplementing security and data protection\u003c/li\u003e\n\u003cli\u003eOptimizing the application for maximum speed and scalability\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills and Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBSc degree in Computer Science or relevant field\u003c/li\u003e\n\u003cli\u003e5+ years of experience as a backend developer\u003c/li\u003e\n\u003cli\u003eExperience working with large amounts of data which needs to be stored, processed, and accessed reliably\u003c/li\u003e\n\u003cli\u003eExperience with Kafka, Storm, Spark, Druid\u003c/li\u003e\n\u003cli\u003eStrong proficiency with JavaScript (experience in TypeScript is a plus)\u003c/li\u003e\n\u003cli\u003eKnowledge of Node.js and frameworks available for it such as Express, Mongoose, etc.\u003c/li\u003e\n\u003cli\u003eBasic understanding of front-end technologies, such as HTML5, and CSS3 (experience in Angular is a plus)\u003c/li\u003e\n\u003cli\u003eHands-on experience in Python, Ruby, Java or C# is a plus\u003c/li\u003e\n\u003cli\u003eExperience creating RESTful APIs\u003c/li\u003e\n\u003cli\u003eExperience in implementing automated testing platforms and unit tests\u003c/li\u003e\n\u003cli\u003eProficient understanding of code versioning tools such as Git\u003c/li\u003e\n\u003cli\u003eUnderstanding fundamental design principles behind a scalable application\u003c/li\u003e\n\u003cli\u003eIntegration of multiple data sources and databases into one system\u003c/li\u003e\n\u003cli\u003eExcellent analytical and time management skills\u003c/li\u003e\n\u003cli\u003eManagement of hosting environment, including database administration and scaling an application to support load changes.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eFill out our google application here\n\u003ca href=\"https://bit.ly/2SPMFi8\"\u003ehttps://bit.ly/2SPMFi8\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3hmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e535920a5d6865a08a43e1280384b5319d1a40d7/download.png"
  },
  {
    "id": "0647554c-90b9-465b-8810-5eee93ec99d9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0647554c-90b9-465b-8810-5eee93ec99d9",
    "created_at": "Tue Feb 19 19:26:07 UTC 2019",
    "company": "Articulate",
    "company_url": "https://articulate.com",
    "location": "Anywhere in United States (Remote)",
    "title": "Full-Stack Software Engineer",
    "description": "\u003cp\u003eArticulate is looking for a Full-Stack Software Engineer. We’re makers. We believe the job of a development team is more than just writing code. We are here to create experiences which delight our customers—that is always our top priority.\u003c/p\u003e\n\u003cp\u003eWe’re a fully distributed company with a high degree of autonomy and no office space. At Articulate, you’ll work closely with an awesome team of developers and designers to build industry-leading products and solve interesting problems.\u003c/p\u003e\n\u003cp\u003eThe ideal person for this job is a multitalented Full-Stack Software Engineer with a good eye. This person sweats the details, focuses on quality results instead of effort, and sees problems as opportunities to learn and level up as a team. Solid GIF skills and emojis game are big bonuses.\u003c/p\u003e\n\u003cp\u003eHere’s a smattering of the tech you’ll be working with: Node.js, React, JavaScript, CSS, AWS, GitHub, and Slack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Articulate\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eArticulate is a highly successful, fully remote software company that’s changing the way the world learns. Our award-winning e-learning tools are used by 78,000+ organizations across the globe to create engaging online and mobile courses. Our customers include 93 of the Fortune 100 and 19 of the top 20 U.S. universities. And our online community of 605,000+ members is the largest, fastest-growing community in the industry.\u003c/p\u003e\n\u003cp\u003eWe empower employees to thrive by fostering a culture of autonomy, productivity, and respect. We’re all free to exercise our crafts the best way we know how to reach our goals as individuals and teams. Each and every one of us is focused on producing results that directly impact the company’s success. And we all strive to do what’s right by people, both internally and externally, instead of taking the shortest route to the highest profits.\u003c/p\u003e\n\u003cp\u003eWe honor people’s humanity in all of our disparate experiences and social locations, accepting each person as an individual with a story worth listening to and honoring. We believe that honoring everyone’s humanity means being committed to equity and justice. We welcome different voices and viewpoints and do not discriminate on the basis of race, religion, color, national origin, ancestry, physical and/or mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, transgender status, age, sexual orientation, and military or veteran status, or any other basis protected by law. We are an equal opportunity employer and invite applicants to voluntarily disclose their race and gender on our application form to help us create a diverse company. This voluntarily disclosed information will not be shared with any hiring manager and will be kept in confidence by the Articulate human resources department and executives who are not hiring for this position.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://articulate.com/company/culture\"\u003eLearn more about our culture.\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eVisit \u003ca href=\"https://articulate.fyi/2DY6aed\"\u003ehttps://articulate.fyi/2DY6aed\u003c/a\u003e to apply.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVZlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2fd5b4cd6f9b339800a0ac04ff1985fee18bf8d/F3ijuGTr_400x400.jpg"
  },
  {
    "id": "7f4c2a62-3ef1-4dbd-8c3f-6f05bf9b5240",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7f4c2a62-3ef1-4dbd-8c3f-6f05bf9b5240",
    "created_at": "Tue Feb 19 18:21:05 UTC 2019",
    "company": "TED Conferences",
    "company_url": null,
    "location": "Remote ",
    "title": "Backend Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED is a critically acclaimed, award-winning conference and website featuring inspiring talks from the world's leading thinkers and doers. Since 2006, TED Talks have been watched more than four billion times worldwide and drawn best-in-class sponsors and partnerships. We pride ourselves on combining intelligent, forward-thinking content with leading-edge technology and intuitive design. And we're hiring!\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced Backend Engineer to work on the entire range of TED initiatives including TEDx, TED-Ed, TED Fellows, The Audacious Project, as well as the main TED.com site. The Backend Engineer is also responsible for a myriad of internal applications which, among many other things, power our video production pipeline, syndicate our video content to partners worldwide, and build a lasting archive of ideas.\u003c/p\u003e\n\u003cp\u003eThis is a remote position.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS / SKILLS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with developing APIs\u003c/li\u003e\n\u003cli\u003eWorks well in iterative development process\u003c/li\u003e\n\u003cli\u003eAbility to take code from development all the way through to production\u003c/li\u003e\n\u003cli\u003eAbility to test your code for bugs along the way\u003c/li\u003e\n\u003cli\u003eFamiliarity with application and data security best practices\u003c/li\u003e\n\u003cli\u003eFamiliarity with server side design patterns and architecture\u003c/li\u003e\n\u003cli\u003eAbility to troubleshoot issues in a calm but fast manner\u003c/li\u003e\n\u003cli\u003eAbility to balance negotiations between doing it right and doing it fast\u003c/li\u003e\n\u003cli\u003eAbility to work individually, as well as collaborating with other developers\u003c/li\u003e\n\u003cli\u003eAnalytical mind and strong problem solving skills\u003c/li\u003e\n\u003cli\u003eSelf-starter who can manage own time and project workload\u003c/li\u003e\n\u003cli\u003eValues cross-functional collaboration\u003c/li\u003e\n\u003cli\u003eValues a diverse workplace\u003c/li\u003e\n\u003cli\u003eGood communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThese are some of the tools that we require a highly-qualified candidate to be familiar with.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby / Ruby on Rails\u003c/li\u003e\n\u003cli\u003eMySql\u003c/li\u003e\n\u003cli\u003eGit/Github\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur team also works with the following tools, familiarity is desired:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNode\u003c/li\u003e\n\u003cli\u003eNginx / Varnish\u003c/li\u003e\n\u003cli\u003eElasticSearch\u003c/li\u003e\n\u003cli\u003eLogstash / Kibana / Graphite/ Ganglia\u003c/li\u003e\n\u003cli\u003eAmazon Web Services\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite clean and maintainable code that is well covered by tests and is documented\u003c/li\u003e\n\u003cli\u003eTest your code for bugs along the way\u003c/li\u003e\n\u003cli\u003eManage the stability, reliability, and maintainability of back-end code for TED\u003c/li\u003e\n\u003cli\u003eDevelop, monitor, and maintain services that power our initiatives\u003c/li\u003e\n\u003cli\u003eWillingness to contribute however possible to ensure overall effectiveness of position\u003c/li\u003e\n\u003cli\u003eOther duties and special projects as may be assigned from time to time\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWORKPLACE CONDITIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGeneral: Office environment\u003c/li\u003e\n\u003cli\u003ePhysical: Repetitive movement of wrists, hands, and/or fingers\u003c/li\u003e\n\u003cli\u003eMental/Visual: Concentrated mental and/or visual attention; work involves performing tasks to very close accuracy and quality specifications\u003c/li\u003e\n\u003cli\u003eMachines, Tools, Equipment, Electronic Devices, Computer Software, etc.:\u003c/li\u003e\n\u003cli\u003eAbility to use common office equipment such as telephone, computer and copier\u003c/li\u003e\n\u003cli\u003eComputer programs to include MS Office, Mac programs, Google Docs, functional related databases\u003c/li\u003e\n\u003cli\u003eTravel: Upon request / as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eTED Conferences LLC is an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We invite all qualified candidates to apply online with their resume.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eVisit job posting to apply: \u003ca href=\"https://tedconferencesllc.applytojob.com/apply/xAckjN53fu/Backend-Engineer\"\u003ehttps://tedconferencesllc.applytojob.com/apply/xAckjN53fu/Backend-Engineer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHBlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41fb93dd4857a3af6a7fef5198a0e6831bcbe5e8/Ted%20Logo%20.png"
  },
  {
    "id": "005cc9c7-9a5b-425b-a2d9-de1216fefc54",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/005cc9c7-9a5b-425b-a2d9-de1216fefc54",
    "created_at": "Thu Feb 14 16:06:29 UTC 2019",
    "company": "Peakon",
    "company_url": "https://peakon.com/",
    "location": "Copenhagen",
    "title": "Senior Backend Engineer",
    "description": "\u003cp\u003e\u003cem\u003eDESCRIPTION\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAt some companies you can feel the momentum building. People are engaged, they're approaching their work with energy, enthusiasm and resilience. Being part of the organisation becomes part of your own identity.\u003c/p\u003e\n\u003cp\u003eAt others, it feels impossible to get everyone pulling in the same direction. People lose sight of the company's purpose, they start looking out only for themselves – or elsewhere for new opportunities.\u003c/p\u003e\n\u003cp\u003eWe started Peakon to help companies around the world build better workplaces. Where employees know they're listened to, managers learn from their own decisions and develop as leaders, and entire organisations see a step-change in what they can achieve.\u003c/p\u003e\n\u003cp\u003eTrust and transparency guide everything we do. At Peakon you’ll find a transparent salary model, unlimited vacation, minimal hierarchy, and maximum freedom to develop and execute your own ideas. Our style of collaboration is based on honesty and friendship, and we always love making new friends…\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eABOUT YOU\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eYou are an engineer at heart, who loves to tinker and build new products. You stay up to date on the latest technology trends, and are able to evaluate the feasibility of new technologies for the problem you are trying to solve.\u003c/p\u003e\n\u003cp\u003eYou have a passion for building great products for end users, experience in running and maintaining a large scale web application, and have a good understanding of agile product development processes and what it takes to bring a product from idea into the hands of customers. You are good at breaking down problems and prioritizing the development effort, and have an understanding of the tradeoffs in developing a quality application while supporting the needs of a fast growing business.\u003c/p\u003e\n\u003cp\u003eYou are looking for an opportunity to grow your career in a startup and help define and shape the engineering team and the technology it depends on.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRESPONSIBILITIES\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAs the Peakon engineering team grows, we are looking for an experienced backend engineer to be part of and lead our technical efforts. As a Senior Backend Engineer, you will be working as a senior developer to design and develop the more complex features of the Peakon platform. You will also be a key contributor in technical and architectural discussions, and work closely with our CTO and other leaders to develop the technical roadmap.\u003c/p\u003e\n\u003cp\u003eYou will spend a significant part of your time mentoring other team members in designing and implementing new features, through f.ex. code reviews and pair programming.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eREQUIREMENTS\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOur ideal candidate has...\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of working as a Backend Engineer\u003c/li\u003e\n\u003cli\u003eIntimate knowledge of web technologies like JavaScript, REST, JSON, CSS, HTML etc\u003c/li\u003e\n\u003cli\u003eExperience running and maintaining large scale web applications\u003c/li\u003e\n\u003cli\u003eExperience designing and implementing complex web applications\u003c/li\u003e\n\u003cli\u003eExperience working with relational databases like PostgreSQL or MySQL\u003c/li\u003e\n\u003cli\u003eDetail-oriented, focusing on writing maintainable code of high quality\u003c/li\u003e\n\u003cli\u003eA product mindset - enjoys experimenting to find innovative solutions to customer challenges\u003c/li\u003e\n\u003cli\u003eBelieves in and practices automated testing at all levels\u003c/li\u003e\n\u003cli\u003eValues developer productivity, and relies on continuous integration and automation to iterate faster\u003c/li\u003e\n\u003cli\u003eIs a team player who strive to better not only themselves, but also everyone around them\u003c/li\u003e\n\u003cli\u003eExperience mentoring and giving constructive feedback to junior engineers on their work\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe welcome your application even if you do not meet all of the criteria listed above, but are excited about the challenge of mastering this role. We know that skills are not static and growth is continuous, so we are excited to help you take your career to the next level at Peakon.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTHE TECH\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWe make it a priority to stay on the cutting edge of tech. We are highly motivated by learning and growing in our roles, and constantly evolving is a key part of that.\u003c/p\u003e\n\u003cp\u003eThe tech stack of Peakon centers around Javascript, with Node.js on the server and React on the frontend. We believe there is great value in a shared toolchain across the stack, enabling engineers to work on all parts of the system. Some tasks are better solved with different tools, and thus we use f.ex. Python for the data science parts of the system.\u003c/p\u003e\n\u003cp\u003eWe are big fans of new JavaScript language features like async/await, and have made it a priority to stay up to date with the latest versions of Node. We are primarily hosted on Heroku and AWS, with an increasing number of our services moving to the latter. We use PostgreSQL (through RDS), Redis and ElasticSearch for storage.\u003c/p\u003e\n\u003cp\u003eWe rely heavily on automated testing on all levels of the application, with thousands of tests checking every commit to our code base. We use CircleCI for hosted continuous integration to make sure our most recent changes are always available to test, and we deploy code to our production environment on a daily basis.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBENEFITS\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited holiday\u003c/li\u003e\n\u003cli\u003eSubsidised lunch everyday\u003c/li\u003e\n\u003cli\u003eFlexible working\u003c/li\u003e\n\u003cli\u003eCompany wide trips\u003c/li\u003e\n\u003cli\u003eChoice of hardware\u003c/li\u003e\n\u003cli\u003eFlexible travel policy\u003c/li\u003e\n\u003cli\u003ePension\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email your CV to \u003ca href=\"mailto:lea.schmidt@peakon.com\"\u003elea.schmidt@peakon.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3BlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de3789d9e7c73910fdf74042bcde5d5864aec026/peakon-logo.png"
  },
  {
    "id": "ec4a47df-5580-4d61-87de-add4793d7ad1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ec4a47df-5580-4d61-87de-add4793d7ad1",
    "created_at": "Thu Feb 14 15:38:19 UTC 2019",
    "company": "Marfeel ",
    "company_url": "https://www.marfeel.com/",
    "location": "Barcelona",
    "title": "Senior Front End Developer- React ",
    "description": "\u003cp\u003eMarfeel helps publishers of all sizes to create, optimize and monetize their mobile websites. We have been named 16th fastest-growing European company of 2018, by The Financial Times, but we still think we have a long way to go to where we want to be.\u003c/p\u003e\n\u003cp\u003eWe are looking for talented Front-end Engineers to join our Core product team and be part of a multicultural and talented Engineering team of over 70 developers, in sunny Barcelona.\u003c/p\u003e\n\u003cp\u003eYou will be part of a team who owns the performance and the architecture of our front-end ecosystem that supports over 15 million visits a day. Currently we are in the process of redefining our architecture in React. Fancy helping us?\u003c/p\u003e\n\u003cp\u003eYou will:\u003c/p\u003e\n\u003cp\u003eBe part of a multicultural and talented company, consisting of 28 nationalities.\u003c/p\u003e\n\u003cp\u003eHelp us define and implement our new front-end architecture\u003c/p\u003e\n\u003cp\u003eHave a say in what libraries, tools and technologies we use for front-end development\u003c/p\u003e\n\u003cp\u003eJoin a fun and dynamic Core product team that follows Agile practices.\u003c/p\u003e\n\u003cp\u003eHave opportunity and support to grow and develop your career further\u003c/p\u003e\n\u003cp\u003eBe able to help us shape our rapidly growing Engineering department\u003c/p\u003e\n\u003cp\u003eWhat the team is looking for:\u003c/p\u003e\n\u003cp\u003eYou have proven experience in delivering end-to-end features in ReactJS and other modern Javascript front-end technologies for mobile applications\u003c/p\u003e\n\u003cp\u003eYou have worked with Styled Components and style sheet languages, such as SASS\u003c/p\u003e\n\u003cp\u003eYou know different ways of managing application state in the front-end\u003c/p\u003e\n\u003cp\u003eYou have a solid understanding of the web technology stack (i.e. headers, cookies, cross-domain restrictions, https, caching, optimization opportunities, hardware acceleration, junk and scroll performance, server side rendering etc.)\u003c/p\u003e\n\u003cp\u003eYou are familiar with modern development and build tools such as git, npm, babel, and webpack\u003c/p\u003e\n\u003cp\u003eYou have experience working in cross-functional collaborative teams, following Agile best practices\u003c/p\u003e\n\u003cp\u003eYou are comfortable contributing to and leading technical and/or architectural discussions\u003c/p\u003e\n\u003cp\u003eYou take ownership of your and your team's code quality. Writing tests is in your second nature, and you have a broad understanding of UI testing techniques\u003c/p\u003e\n\u003cp\u003eYou continually strive to share your knowledge around best code practices\u003c/p\u003e\n\u003cp\u003eYou have high emotional intelligence and finding it easy to empathise with others\u003c/p\u003e\n\u003cp\u003eYou don’t take yourself too seriously and enjoy a few jokes now and then\u003c/p\u003e\n\u003cp\u003eThe team will be further impressed with:\u003c/p\u003e\n\u003cp\u003eYou have experience with developing Progressive web applications, service workers, push notifications\u003c/p\u003e\n\u003cp\u003eYou know how to analyse and optimise the performance of a front-end application\u003c/p\u003e\n\u003cp\u003eYou have experience with various AWS services and understand the challenges of deploying large applications in the cloud.\u003c/p\u003e\n\u003cp\u003eYou are an active contributor to a front-end community\u003c/p\u003e\n\u003cp\u003eYou have worked with Jenkins and familiar with CI and CD release cycles\u003c/p\u003e\n\u003cp\u003eYou have experience with backend languages and frameworks such as NodeJS, Java, Python or any others\u003c/p\u003e\n\u003cp\u003eYou are familiar with #perfMatters, VueJS, Google Analytics, AdServing, Linters\u003c/p\u003e\n\u003cp\u003eAs part of Marfeel, you will also have:\u003c/p\u003e\n\u003cp\u003eFlexible working-time\u003c/p\u003e\n\u003cp\u003eFree coffee, tea, juices and other commodities\u003c/p\u003e\n\u003cp\u003eBeer tap in the kitchen\u003c/p\u003e\n\u003cp\u003ePing-pong, Mario Kart and foosball tournaments\u003c/p\u003e\n\u003cp\u003eFree language and yoga classes\u003c/p\u003e\n\u003cp\u003eTeam building events!\u003c/p\u003e\n\u003cp\u003eTransport, restaurant and kindergarten tickets\u003c/p\u003e\n\u003cp\u003eTraining, books and all you need to feel empowered\u003c/p\u003e\n\u003cp\u003eAnd a Referral Bonus if you bring other talented people like you\u003c/p\u003e\n\u003cp\u003eA little bit more about us:\u003c/p\u003e\n\u003cp\u003eMarfeel is one of the hottest European start-up companies in the mobile ad-tech world.\u003c/p\u003e\n\u003cp\u003eWe have been named:\u003c/p\u003e\n\u003cp\u003e16th out of Europe’s 1000 fastest-growing companies of 2018, by The Financial Times\u003c/p\u003e\n\u003cp\u003eNº 1 Fastest Growing Marketing and Advertising Private Company in Spain in 2017, by Inc.5000\u003c/p\u003e\n\u003cp\u003eTop 100 Startups in 2015, by Wired Magazine\u003c/p\u003e\n\u003cp\u003eWe are highly recommended by Google for our mobile design solution, and together with our partners, we have over 6 billion worldwide readers and over 20 billion page views.\u003c/p\u003e\n\u003cp\u003eCertified Google Publishing Partner\u003c/p\u003e\n\u003cp\u003eCertified Facebook Instant Articles Official Partner\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply to this link \u003ca href=\"https://marfeel.bamboohr.com/jobs/view.php?id=53\"\u003ehttps://marfeel.bamboohr.com/jobs/view.php?id=53\u003c/a\u003e or send an email to \u003ca href=\"mailto:jobs@marfeel.com\"\u003ejobs@marfeel.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1ZlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfe02b00f5b096b96e4871c9cbcbc40c308fe1a1/marfeel-logo%20(1).png"
  },
  {
    "id": "28392689-3726-4cd2-a8d7-8fddf4cf06bd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/28392689-3726-4cd2-a8d7-8fddf4cf06bd",
    "created_at": "Thu Feb 14 12:52:23 UTC 2019",
    "company": "HoloMeeting",
    "company_url": "http://www.holomeeting.io",
    "location": "Remote",
    "title": "Junior Backend Developer",
    "description": "\u003cp\u003eThis role requires a full stack web developer developer who has gathered some initial experience. Must be excited to learn and improve your skills. We are a small team, so you will shadow our Senior Backend Developer and take own bigger and bigger features as you learn. In this role you will be faced with new challenges (e.g. helping to set up Azure Managed Applications), maintain a live platform and help drive the holographic remote collaboration revolution!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities, including but not limited to:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull stack web development\u003c/li\u003e\n\u003cli\u003eDeveloping new features and fixing bugs for Holomeeting's Web Services\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1+ years Node.js experience\u003c/li\u003e\n\u003cli\u003e1+ years React.js + Redux experience\u003c/li\u003e\n\u003cli\u003eSolid understanding of HTML+CSS\u003c/li\u003e\n\u003cli\u003eExperience working with cloud-based systems and/or local servers including, but not limited to: web based protocols, REST APIs, and sockets\u003c/li\u003e\n\u003cli\u003eBS in Computer Science or equivalent experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eReact Native\u003c/li\u003e\n\u003cli\u003eAzure\u003c/li\u003e\n\u003cli\u003eAutomated testing with Mocha and Jest\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://hire.withgoogle.com/public/jobs/kazendicom/view/P_AAAAABlAAAnFZJ2fLgifBx?trackingTag=githubJobs\"\u003ehttps://hire.withgoogle.com/public/jobs/kazendicom/view/P_AAAAABlAAAnFZJ2fLgifBx?trackingTag=githubJobs\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4e8523b68463421dfb70aeb7bcf85f04984c15e3/Favicon%2048x48%20Copy.jpg"
  },
  {
    "id": "9c455180-ecca-11e8-886b-ae327644a48e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9c455180-ecca-11e8-886b-ae327644a48e",
    "created_at": "Tue Nov 20 13:52:15 UTC 2018",
    "company": "Huawei",
    "company_url": "https://www.huawei.com",
    "location": "Munich, Germany",
    "title": "Senior Software Engineer (m/f)",
    "description": "\u003cp\u003eHuawei is a leading provider of information and communications solutions. Our products have been deployed in over 140 countries serving more than one third of the world’s population. For the Trusted System Protection (TSP) team within the Cyber Security and Privacy Protection Laboratory (CSPL) in Munich, Germany we are currently looking for a Senior Software Engineer enthusiastic to work on cutting-edge security technologies and to contribute to the security architecture of future Huawei products in a diverse range of verticals, from telecom to cloud and IoT platforms.\u003c/p\u003e\n\u003ch3\u003eYour responsibilities\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and document advanced security technology prototypes for trusted computing, system integrity protection and platform resilience\u003c/li\u003e\n\u003cli\u003eAnalyze product architecture and source code and collaborate with product line engineers to adapt the developed prototypes to product architectures\u003c/li\u003e\n\u003cli\u003eContribute to joint research projects with our European partners from academia and industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOur requirements\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, implementing and debugging embedded firmware and applications in C, for ARMv7/8-A, ARMv7/8-M, other embedded architectures or x86\u003c/li\u003e\n\u003cli\u003eProfessional knowledge in one or more of following areas:\n\u003cul\u003e\n\u003cli\u003eMicrocontroller and application processor architectures, DeviceTree, board bring-up, Secure Boot, flash storage, buses, Secure Update\u003c/li\u003e\n\u003cli\u003eLinux OS kernel internals, memory management, containers, virtualization, security features\u003c/li\u003e\n\u003cli\u003eDevelopment with common security protocols (e.g. TLS, IPSec, OAuth 2.0 etc.), crypto libraries (e.g. OpenSSL, mbedTLS), PKCS#11 or Linux kernel crypto API, X.509 certificates and PKI\u003c/li\u003e\n\u003cli\u003eLinux – network / system tools / command line interface / scripting\u003c/li\u003e\n\u003cli\u003eCode debugging techniques\u003c/li\u003e\n\u003cli\u003eProficiency in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eFollowing are desirable:\n\u003cul\u003e\n\u003cli\u003eTrusted Computing\u003c/li\u003e\n\u003cli\u003eHardware security architectures and best practices\u003c/li\u003e\n\u003cli\u003ePython, Go; Javascript, Node.JS and micro service architectures\u003c/li\u003e\n\u003cli\u003eExperience with cloud technologies such as OpenStack and containers (Docker/Kubernetes)\u003c/li\u003e\n\u003cli\u003eDevOps methodologies such as agile development and continuous delivery\u003c/li\u003e\n\u003cli\u003eExperience in contributing to open-source projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCandidate should be self-motivated to research and compare new software technologies and be in a position to rapidly become accustomed to them in a relatively short period of time.\u003c/p\u003e\n\u003cp\u003eAble to independently design, build, and maintain efficient, reusable and secure code. Identify potential bottlenecks and bugs and devise solutions to the problems. Analyze existing code and identify points of improvement.\u003c/p\u003e\n\u003cp\u003eCapable to analyze complex software architectures and prioritize development tasks to maximize efficiency and output. Able to troubleshoot problems in an existing code base with limited documentation.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease send your CV to \u003ca href=\"mailto:jane.jeffreys@huawei.com\"\u003ejane.jeffreys@huawei.com\u003c/a\u003e.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb8499ec0b8cfed521539de0c702dd3bf1c2b87f/8ed5a22c-7b16-41b0-9320-c538c2717293"
  },
  {
    "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "created_at": "Tue Nov 20 12:09:59 UTC 2018",
    "company": "Mindhive",
    "company_url": "http://www.mindhive.org",
    "location": "Brisbane CBD Australia",
    "title": "Senior Front End and Backend Developers",
    "description": "\u003cp\u003e\u003cstrong\u003eMINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMindhive\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.\u003c/p\u003e\n\u003cp\u003eSince completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR BACKEND DEVELOPER ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a backend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eCloud services\nDatabase\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:\u003c/p\u003e\n\u003cp\u003eDevelop cloud-based API services\nDevelop in-house \u0026amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDetailed understanding of cloud architecture(s)\nDetailed knowledge of Python \u0026amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols \u0026amp; certificates\nBonus: detailed knowledge of machine learning \u0026amp; AI\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR FRONTEND DEVELOPER ROLE OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eWeb application\nMobile application\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement UX/UI for mobile first web and mobile apps\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional key responsibilities include:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUtilise any and all relevant frameworks, libraries and techniques:\u003c/p\u003e\n\u003cp\u003eJavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house \u0026amp; third party)\nReview and inform database models are in alignment with frontend view models \u0026amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExperience with current industry design tools (e.g. Figma)\u003c/p\u003e\n\u003cp\u003eUnderstanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking \u0026amp; abstract, technical problem solving\nProactivity\nCollaboration\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:career@mindhive.it\"\u003ecareer@mindhive.it\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
  },
  {
    "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
    "created_at": "Mon Nov 19 20:08:09 UTC 2018",
    "company": "Prezi",
    "company_url": "http://prezi.com",
    "location": "San Francisco ",
    "title": "Senior Full Stack Engineer ",
    "description": "\u003cp\u003ePrezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.\u003c/p\u003e\n\u003cp\u003eTo help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eMake significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRelease early, release often, deploy to production from day one.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCoordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eParticipate in hackathons and engineering days\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearn from and share your knowledge with your team and colleagues on the go.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills and traits we are looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for delivering value to users\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent communication skills, both verbal and written\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficiency with servers, linux, cloud infrastructure, build systems, continuous integration\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for clean, maintainable, well-tested code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience working with applications at scale\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe ability to structure and build complex client side applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of test automation of backend and frontend applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtensive knowledge of responsive design, web standards and modern browsers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility and willingness to learn fast and pick up new things easily\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA work environment where people from all backgrounds can thrive and grow\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePeople who listen to your opinions and value them\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to spend time working at our Budapest office\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to go to tech conferences anywhere in the world\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFlexible working hours and untracked vacations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eQuality meals, snacks, drinks every day\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA centrally located office in downtown San Francisco\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k plan\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHealth, dental and vision insurance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommuter benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://grnh.se/d5687acb1\"\u003ehttps://grnh.se/d5687acb1\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
    "created_at": "Mon Nov 19 15:44:44 UTC 2018",
    "company": "Aon Cyber Solutions",
    "company_url": "http://www.strozfriedberg.com/careers",
    "location": "NY or LA",
    "title": "Cybersecurity Firm Seeks Senior Developer",
    "description": "\u003cp\u003eAon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.\u003c/p\u003e\n\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePosition Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of this position include but are not limited to the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.\u003c/li\u003e\n\u003cli\u003eServe as a senior developer on multiple product teams.\u003c/li\u003e\n\u003cli\u003eCreate user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.\u003c/li\u003e\n\u003cli\u003eTranslate high-level requirements into working prototypes to generate user feedback and discussion.\u003c/li\u003e\n\u003cli\u003eAdapt and apply cutting edge computer science to highly technical domains.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.\u003c/li\u003e\n\u003cli\u003eMentor other developers.\u003c/li\u003e\n\u003cli\u003eContribute to a positive, collaborative culture for innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineer experience.\u003c/li\u003e\n\u003cli\u003eProficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTTP and REST web services implementation.\u003c/li\u003e\n\u003cli\u003eTest driven development and unit testing frameworks.\u003c/li\u003e\n\u003cli\u003eModern DevOps experience.\u003c/li\u003e\n\u003cli\u003eStandard software engineering tools (git, Jenkins, JIRA).\u003c/li\u003e\n\u003cli\u003eThe proven ability to see things as they should be, and to realize that vision.\u003c/li\u003e\n\u003cli\u003eComfort with agile development and remote team environments.\u003c/li\u003e\n\u003cli\u003eExcellence in verbal and written communication.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003cli\u003ePython 3 and web frameworks such as Django or Flask.\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; relational database modeling.\u003c/li\u003e\n\u003cli\u003eExperience in deployment to AWS, especially serverless technologies.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of JWT and various web security models.\u003c/li\u003e\n\u003cli\u003eD3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).\u003c/li\u003e\n\u003cli\u003eElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.\u003c/li\u003e\n\u003cli\u003eJava 8 and other JVM-based languages.\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and optimization.\u003c/li\u003e\n\u003cli\u003eMobile development using Native or Cross-platform (Xamarin, Ionic, React Native).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "ea94c57c-d0a1-11e8-9676-0d02532e57f6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ea94c57c-d0a1-11e8-9676-0d02532e57f6",
    "created_at": "Fri Nov 16 20:14:47 UTC 2018",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "location": "North America",
    "title": "Solutions Architect - IoT/Python/React (US/Canada)",
    "description": "\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Solutions Architect to help us scale our execution to support additional new high-tech sectors.\u003c/p\u003e\n\u003cp\u003eAnalytics Fire is a deeply technical engineering organization. Most of us are software engineers and spend the majority of our time on heads down engineering activities like coding. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the personality and the technical skill set to collaborate directly with clients and senior members of the technical team in order to help steer technical decision making and requirements gathering, especially early in the project lifecycle.\u003c/p\u003e\n\u003cp\u003eThis position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.\u003c/p\u003e\n\u003cp\u003eAs a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background. However, it is a hard requirement that you are able to support the following 3 types of responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(a) Represent Analytics Fire software engineering teams in client-facing interactions (and sometimes interactions with potential clients)\u003c/li\u003e\n\u003cli\u003e(b) Technical writing responsibilities such as documenting requirements, project plans, system architecture, etc.\u003c/li\u003e\n\u003cli\u003e(c) Making meaningful contributions to the execution of complex software projects.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor reference, here is a list of some technologies we are currently actively using on a day-to-day basis:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFront-end: JavaScript / React / Angular\u003c/li\u003e\n\u003cli\u003eBack-end: Ruby / Python / Node.js\u003c/li\u003e\n\u003cli\u003eEmbedded: Embedded Linux, Yocto, C, MQTT\u003c/li\u003e\n\u003cli\u003eCV: OpenCV, PCL, object identification and tracking\u003c/li\u003e\n\u003cli\u003eML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms\u003c/li\u003e\n\u003cli\u003eModern software techniques: RESTful APIs, SOA, PaaS, etc\u003c/li\u003e\n\u003cli\u003eAgile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc\u003c/li\u003e\n\u003cli\u003eOther technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour primary responsibility will be to assist in guiding new projects through sales, planning, development, and deployment. This will be accomplished through a combination of client interactions, technical writing, and participation in formal sales, program management, and engineering related processes. Your contributions will naturally be slightly front-loaded towards the sales and planning phases, however you will remain deeply connected to each project through the entire lifecycle in order to ensure conceptual integrity is maintained from design to final implementation.\u003c/p\u003e\n\u003cp\u003eThis is a remote position but is only open to candidates living in the US or Canada. We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Must have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years relevant hands-on experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.\u003c/li\u003e\n\u003cli\u003eFluency around current modern best practices around software development, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003eSoft skills necessary to navigate and negotiate with multiple teams, both internal and external to Analytics Fire.\u003c/li\u003e\n\u003cli\u003eAbility and willingness to familiarize yourself with our technical stack.\u003c/li\u003e\n\u003cli\u003eSuperior organization and detail orientation.\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills.\u003c/li\u003e\n\u003cli\u003eWillingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e“Nice to have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFormer work experience or training as a technical Program Management.\u003c/li\u003e\n\u003cli\u003eDeep technical experience with C, Python, or ReactJS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Analytics Fire\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.\u003c/p\u003e\n\u003cp\u003e“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:join-us@analyticsfire.com\"\u003ejoin-us@analyticsfire.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b27fcb2989980ffe97f523d96c3b02c68b72a096/bd4a117a-d891-43d1-ba57-e24930cd01ab"
  },
  {
    "id": "0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
    "created_at": "Fri Nov 16 20:13:18 UTC 2018",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "location": "North America",
    "title": "Release Manager - IoT/Python/React (US/Canada)",
    "description": "\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Release Manager to help us scale our execution to support additional new high-tech sectors.\u003c/p\u003e\n\u003cp\u003eAnalytics Fire is a deeply technical engineering organization. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the technical skillset and the personality to maintain highly coordinated relationships with key internal and client-side stakeholders in order to help proactively guide projects through planning, development, deployment, release, and DevOps.\u003c/p\u003e\n\u003cp\u003eThis position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.\u003c/p\u003e\n\u003cp\u003eAs a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background and skill set    . However, ability to support client-facing interactions (clarifying requirements, negotiating technical approaches, reporting on status, etc) as well as make meaningful internal contributions in a highly technical environment is a hard requirement.\u003c/p\u003e\n\u003cp\u003eFor reference, here is a list of some technologies we are currently actively using on a day-to-day basis:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFront-end: JavaScript / React / Angular\u003c/li\u003e\n\u003cli\u003eBack-end: Ruby / Python / Node.js\u003c/li\u003e\n\u003cli\u003eEmbedded: Embedded Linux, Yocto, C, MQTT\u003c/li\u003e\n\u003cli\u003eCV: OpenCV, PCL, object identification and tracking\u003c/li\u003e\n\u003cli\u003eML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms\u003c/li\u003e\n\u003cli\u003eModern software techniques: RESTful APIs, SOA, PaaS, etc\u003c/li\u003e\n\u003cli\u003eAgile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc\u003c/li\u003e\n\u003cli\u003eOther technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription of responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003eParticipate in collaborative planning discussions and technical decision making early in the project lifecycle to ensure that key decisions are made with reliability, testability, and maintenance in mind.\u003c/li\u003e\n\u003cli\u003eMonitor and oversee coordination, integration, flow of development, testing, and deployment around multiple parallel projects and threads of engineering execution.\u003c/li\u003e\n\u003cli\u003eDrive planning and delivery of high quality software releases: Manage change control process during releases, Continuously improve company release processes, Proactively identify and mitigate risks and remove obstacles to releases\u003c/li\u003e\n\u003cli\u003ePersonally plan and lead the team through our most important software releases. Advise and support the team so that they can take on less critical releases on a day-to-day basis.\u003c/li\u003e\n\u003cli\u003eContinually integrate the QA team and testing engineers into both the requirements gathering and software development processes and report status to clients on a very frequent basis.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a remote position but is only open to candidates living in the US or Canada. (Note: we may be open to US or Canadian citizens living abroad in US-overlapping time zones on a case by case basis.) We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Must have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoft skills necessary to develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003e3+ years hands experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.\u003c/li\u003e\n\u003cli\u003eFamiliarity with current modern best practices around software development, data engineering, and DevOps\u003c/li\u003e\n\u003cli\u003eAbility and willingness to familiarize yourself with the specific technical stacks that we use.\u003c/li\u003e\n\u003cli\u003eSuperior organization and detail orientation.\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills.\u003c/li\u003e\n\u003cli\u003eWillingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e“Nice to have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHands-on technical experience writing code in C, C++, Python, ReactJS\u003c/li\u003e\n\u003cli\u003ePrevious experience as a technical Program Manager.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Analytics Fire\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.\u003c/p\u003e\n\u003cp\u003e“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:join-us@analyticsfire.com\"\u003ejoin-us@analyticsfire.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84c33b065f8858b28e9e161159f1d7f0a1333cd7/5c0bda92-4866-495d-a81e-7dd119cfae7b"
  },
  {
    "id": "2744c836-e97b-11e8-8236-5be6ba23f176",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176",
    "created_at": "Fri Nov 16 08:41:52 UTC 2018",
    "company": "Piktochart Sdn Bhd",
    "company_url": null,
    "location": "Europe",
    "title": "DevOps (Remote - Europe)",
    "description": "\u003cp\u003eDear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!\u003c/p\u003e\n\u003cp\u003eYour mission:\u003c/p\u003e\n\u003cp\u003eDesign scalable and secure web infrastructure on GCP \u0026amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting\u003c/p\u003e\n\u003cp\u003eYou offer :\u003c/p\u003e\n\u003cp\u003e3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack\u003c/p\u003e\n\u003cp\u003eExtra points if you have:\u003c/p\u003e\n\u003cp\u003eExperience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations\u003c/p\u003e\n\u003cp\u003eLocation :\u003c/p\u003e\n\u003cp\u003eRemote (Already based in Europe or willing to work in EU timezone)\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply here : \u003ca href=\"https://grnh.se/e0769a2c1\"\u003ehttps://grnh.se/e0769a2c1\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"
  },
  {
    "id": "47328346-e90c-11e8-9429-c09930ae6ec9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/47328346-e90c-11e8-9429-c09930ae6ec9",
    "created_at": "Thu Nov 15 19:26:24 UTC 2018",
    "company": "Acadian Asset Management",
    "company_url": "http://acadian-asset.com",
    "location": "Boston, MA",
    "title": "Full Stack Developer \u0026 Senior Analyst (Investment Analytics)",
    "description": "\u003cp\u003ePosition Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms\u003c/li\u003e\n\u003cli\u003eEngineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools\u003c/li\u003e\n\u003cli\u003eTeam up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building browser-based applications using JavaScript, CSS, and HTML\u003c/li\u003e\n\u003cli\u003eExperience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent knowledge and technical work experience\u003c/li\u003e\n\u003cli\u003eHands on experience running http server such as Apache / NGINX\u003c/li\u003e\n\u003cli\u003ePrior investment/financial industry knowledge is not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther technologies we use:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSQL, NoSQL, MongoDB, Redis\u003c/li\u003e\n\u003cli\u003eNumpy, Scipy, Pandas\u003c/li\u003e\n\u003cli\u003eD3, AngularJS, Node\u003c/li\u003e\n\u003cli\u003eDocker, Slurm, ZeroMQ, AWS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--703f54fc6dc8eda27790b08f4867a4593f252f09/e875225d-b3cc-454b-9e2f-a7e80cdb65fa"
  },
  {
    "id": "77077cda-e8d4-11e8-8a2f-200c8d1abebd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/77077cda-e8d4-11e8-8a2f-200c8d1abebd",
    "created_at": "Thu Nov 15 12:46:54 UTC 2018",
    "company": "Centraal bureau voor de statistiek",
    "company_url": null,
    "location": "Den Haag",
    "title": "Software Engineer Information Dialogue",
    "description": "\u003ch2\u003e\u003cstrong\u003eSoftware Engineer Information Dialogue\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eStandplaats\u003c/strong\u003e: Den Haag\u003c/p\u003e\n\u003cp\u003eBreng jij bij het CBS AI tot leven?\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eOver het CBS\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eIn een samenleving waarin informatie explosief toeneemt, is het vrij kunnen beschikken over betrouwbare en integrale data cruciaal. Het CBS levert als hét statistische bureau van Nederland met betrouwbare statistische informatie en data inzicht in maatschappelijke vraagstukken. Daarmee voedt het CBS het maatschappelijk debat, de beleidsontwikkeling en de besluitvorming en draagt zo bij aan welvaart, welzijn en democratie.\u003c/p\u003e\n\u003cp\u003eHet CBS werd in 1899 opgericht vanuit de behoefte aan onafhankelijke, betrouwbare informatie om maatschappelijke vraagstukken te begrijpen. Deze rol heeft het CBS nog altijd. De organisatie is inmiddels uitgegroeid tot een innovatieve kennisorganisatie, die voortdurend nieuwe technologieën en ontwikkelingen toepast om de kwaliteit van de gegevens en de onafhankelijke positie te kunnen blijven borgen.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe werkt aan het ambitieuze innovatieve product Information Dialogue dat alle statistische informatie van het CBS via toepassing van AI ontsluit, zodat een gebruiker precies díe informatie krijgt die hij nodig heeft. Dit doen we door een computergestuurde dialoog, zo menselijk mogelijk, te ontwikkelen die alle informatie die nu in onze open data database beschikbaar is aan te bieden. We zijn het eerste statistiekbureau in de wereld dat deze uitdaging aangaat.\nJe gaat de software ontwikkelen die de verbinding maakt tussen deze open data en de spraakrobot (bijvoorbeeld Google Assistant).\nVoor een impressie waaraan je gaat werken klik hier\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWie zoeken wij\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe bent een Software Engineer met kennis van C#, node.js en Xamarin waarbij kennis van AI-bots zoals Google Dialogflow (Assistent), Cortana, Alexa of Siri een pré is. Vanzelfsprekend kun je user stories opstellen en gemaakte software systematisch testen. Je bent analytisch, creatief, denkt in oplossingen, leert snel, bent een pionier en kan ingewikkelde materie op aansprekende wijze uitleggen aan collega’s die minder van techniek weten. Daarnaast ben je bekend met de principes van Agile en Scrum. Uiteraard heb je uitstekende samenwerkingsvaardigheden.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWaar kom je te werken\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe komt te werken in een jong agile team dat verantwoordelijk is voor ontwikkeling van de Information Dialogue, één van de cutting edge innovaties die er voor zorgen dat het CBS tot één van de beste en meest vooruitstrevende statistiekbureaus ter wereld blijft behoren. De sfeer van dit team is die van een Start-up, met hoge ambities, grote uitdagingen en de gedrevenheid om de Information Dialogue tot een succes te maken.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eAanbod\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEen salaris van minimaal €2631 en maximaal €4809 bruto per maand op basis van 36 uur. De inschaling is afhankelijk van kennis en ervaring.\u003c/li\u003e\n\u003cli\u003eEen uitdagende baan in een dynamisch werkveld waar eigen verantwoordelijkheid nemen binnen passende eigen regelruimte voorop staat.\u003c/li\u003e\n\u003cli\u003eEen vaste eindejaarsuitkering van 8,3%.\u003c/li\u003e\n\u003cli\u003eVakantiegeld uitkering van 8%.\u003c/li\u003e\n\u003cli\u003eFlexibele werktijden en thuiswerkmogelijkheden.\u003c/li\u003e\n\u003cli\u003eVoor het woon-werkverkeer ontvang je een NS Businesscard.\u003c/li\u003e\n\u003cli\u003eDe mogelijkheid om bij een fulltime aanstelling (36 uur) 4 uur per week compensatieverlof op te bouwen.\u003c/li\u003e\n\u003cli\u003eEen studiefaciliteitenregeling.\u003c/li\u003e\n\u003cli\u003eIndividuele Keuzen Arbeidsvoorwaarden Pakket; de IKAP-regeling stelt je in staat om bijvoorbeeld extra vakantiedagen te kopen of te sporten met korting door middel van belastingvoordeel.\u003c/li\u003e\n\u003cli\u003eEen werkplek met voldoende ruimte voor jouw persoonlijke en professionele ontwikkeling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe zijn op zoek naar meerdere software engineers en bieden een tijdelijke aanstelling die na enige tijd kan worden omgezet in een vaste aanstelling.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eContactinformatie\u003c/strong\u003e\nVoor inhoudelijke informatie over de functie kun je contact opnemen met Gabriëlle van Mourik, telefoon 06 52464072.\u003c/p\u003e\n\u003cp\u003eVoor vragen over de procedure kun je contact opnemen met Hilda Folkerts, Corporate recruiter, \u003ca href=\"mailto:h.folkerts@cbs.nl\"\u003eh.folkerts@cbs.nl\u003c/a\u003e, telefoon:070-3375574.\u003c/p\u003e\n\u003cp\u003eDe bevestiging van je sollicitatie wordt mogelijk gezien als spam. Controleer daarom je map ‘ongewenste e-mail’.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003eAlleen sollicitaties via deze link worden in behandeling genomen:\n\u003cstrong\u003e\u003ca href=\"https://cbs.redirect.your-jobresponse.com/software_engineer_information_dialogue_den_haag/236455/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://cbs.redirect.your-jobresponse.com/software_engineer_information_dialogue_den_haag/236455/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f323b086b0d7131427118caed32b27ccc8e4bb2/cbac23b1-3b1e-4c28-a8fc-49df1095e6ef"
  },
  {
    "id": "18f5af34-e8c7-11e8-85f6-109da02adff9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/18f5af34-e8c7-11e8-85f6-109da02adff9",
    "created_at": "Thu Nov 15 11:12:09 UTC 2018",
    "company": "Sterblue",
    "company_url": "https://www.sterblue.com",
    "location": "Remote Job",
    "title": "Lead front-end engineer",
    "description": "\u003cp\u003eLead front-end engineer\n\nJob description\nSterblue builds software for Drones to inspect Wind Turbines and Power Lines automatically using Artificial Intelligence. From automatic 3D navigation around infrastructures to online reports and automatic defect detection, we automate the entire inspection process to help energy and utility companies strive for a cleaner future.\n\nWe are looking for a Senior or Lead web front-end and mobile developer with experience in UI/UX, that will be able to help manage our team operationally and technically. At Sterblue, you will:\u003c/p\u003e\n\n\n\n",
    "how_to_apply": "\u003cp\u003eApply here\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d17ed9dcb168d5f4124e2fab7b976d8f9c27947c/659f247c-8395-473d-956d-ff1c0b1ec3f6"
  },
  {
    "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
    "created_at": "Wed Nov 14 22:16:02 UTC 2018",
    "company": "The Atlantic",
    "company_url": "http://theatlantic.com",
    "location": "Washington, DC \u0026 New York, NY",
    "title": "Lead Front End Developer",
    "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer with proven leadership and management experience.\u003c/p\u003e\n\u003cp\u003eYou are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.\u003c/p\u003e\n\u003cp\u003eYour experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews\u003c/li\u003e\n\u003cli\u003eHelp plan and execute team and individual goals, with an eye on team growth and development\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eAct as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features\u003c/li\u003e\n\u003cli\u003eAct as a expert who can provide technical help and guidance to the other front end developers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven experience with technical leadership and management\u003c/li\u003e\n\u003cli\u003eExperience architecting a front end codebase at scale\u003c/li\u003e\n\u003cli\u003eStrong technical and non-technical communication skills\u003c/li\u003e\n\u003cli\u003eAble to look at a design and break it into well organized reusable components\u003c/li\u003e\n\u003cli\u003eExperience planning, ticketing, and executing team projects\u003c/li\u003e\n\u003cli\u003eComfortable with Git for version control\u003c/li\u003e\n\u003cli\u003eEffective time management when working on multiple projects\u003c/li\u003e\n\u003cli\u003ePassionate about front end performance with up-to-date knowledge of current techniques\u003c/li\u003e\n\u003cli\u003eFamiliar with Node.js and modern frontend build tooling\u003c/li\u003e\n\u003cli\u003eKnowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS\u003c/li\u003e\n\u003cli\u003eAble to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
  },
  {
    "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
    "created_at": "Wed Nov 14 22:11:05 UTC 2018",
    "company": "The Atlantic",
    "company_url": "http://theatlantic.com",
    "location": "Washington, DC \u0026 New York, NY",
    "title": "Senior Front End Developer",
    "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer and solid communicator with an interest in journalism and the media business.\u003c/p\u003e\n\u003cp\u003eYou’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary\u003c/li\u003e\n\u003cli\u003eMentor junior developers and act as a subject expert\u003c/li\u003e\n\u003cli\u003eThinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eWork to continually reduce our front end website load time\u003c/li\u003e\n\u003cli\u003eCommunicate and collaborate with both technical and non-technical members of the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
  },
  {
    "id": "96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
    "created_at": "Mon Nov 12 16:56:33 UTC 2018",
    "company": "Bene Studio Ltd.",
    "company_url": "http://www.benestudio.co",
    "location": "Budapest",
    "title": "Senior Full-stack React and Node Engineer - Full Relocation to Budapest",
    "description": "\u003cp\u003eTO BUILD PRODUCTS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewhich are diverse, from healthcare to real estate\u003c/li\u003e\n\u003cli\u003emaking better the lives of the people globally\u003c/li\u003e\n\u003cli\u003ewith the latest JavaScript technologies\u003c/li\u003e\n\u003cli\u003eusing your creativity, empowerment and team player attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO GAIN EXPERIENCE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efrom the varied, 1-6 months long projects\u003c/li\u003e\n\u003cli\u003ewithin the English-speaking, international, growing team of highly skilled engineers,\u003c/li\u003e\n\u003cli\u003ewho passed the famously challenging bene : studio assessment\u003c/li\u003e\n\u003cli\u003eduring the journey of your Professional Development Plan\u003c/li\u003e\n\u003cli\u003ewith the help of your dedicated Mentor\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO REFRESH YOURSELF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eby enjoying the flexible schedule\u003c/li\u003e\n\u003cli\u003erelying on the stable, calculable job and salary\u003c/li\u003e\n\u003cli\u003ein the team which won the Loveable Workplace Prize\u003c/li\u003e\n\u003cli\u003eat the bike, dog and family friendly Office of the Year 2016, where you can have a massage, play ping\npong or drink a coffee/fröccs at the in-house café\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO SHARE YOUR KNOWLEDGE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eas a Mentor within the team\u003c/li\u003e\n\u003cli\u003eat our blog or one of the leading meetups, conferences\u003c/li\u003e\n\u003cli\u003eat bene : studio Workshops!, the most popular cutting-edge tech workshops in Hungary\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RELOCATE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einto the heart of Europe, to the beautiful, safe and cheap Budapest\u003c/li\u003e\n\u003cli\u003ewith the adaptation guidance, flight ticket, temporary housing and visa services provided by us\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RECEIVE FROM US\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea MacBook Pro\u003c/li\u003e\n\u003cli\u003eHUF 450 000 – HUF 710 000 net salary (calculated for full time)\u003c/li\u003e\n\u003cli\u003ewith paid leaves and sick-leaves\u003c/li\u003e\n\u003cli\u003epromotion reflecting the improvement of your skills, experiences and your contribution to the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIF YOU MET THE REQUIREMENTS OF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in software engineering\u003c/li\u003e\n\u003cli\u003eJavaScript ES6\u003c/li\u003e\n\u003cli\u003eHTML5, CSS3\u003c/li\u003e\n\u003cli\u003eReact.js\u003c/li\u003e\n\u003cli\u003eRedux\u003c/li\u003e\n\u003cli\u003eNode.js\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; noSQL\u003c/li\u003e\n\u003cli\u003eAlgorithms, data structures\u003c/li\u003e\n\u003cli\u003eAWS \u0026amp;/or Azure\u003c/li\u003e\n\u003cli\u003eStrong systems design skills\u003c/li\u003e\n\u003cli\u003eexperienced in all phases of the software development lifecycle\u003c/li\u003e\n\u003cli\u003ebeing the tech lead of one or more projects at a time\u003c/li\u003e\n\u003cli\u003eDeeper knowledge of a CI tool\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOR EVEN GET ADVANTAGES HAVING\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMobile development experience\u003c/li\u003e\n\u003cli\u003eKnowledge of infrastructure as code software tools\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eApply here:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://benestudio.co/joinus/#seniorfullstackengineer\"\u003ehttps://benestudio.co/joinus/#seniorfullstackengineer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXhnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--451cdbb2938bf00033ff40309db16df3e64d3710/YouTube%20Video%20Thumbnail.png"
  },
  {
    "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
    "created_at": "Sat Nov 10 02:02:55 UTC 2018",
    "company": "Sesame",
    "company_url": "http://sesamecare.com",
    "location": "New York; Berlin",
    "title": "Software engineer (back end)",
    "description": "\u003cp\u003eWe’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.\u003c/p\u003e\n\u003cp\u003eOur all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.\u003c/p\u003e\n\u003cp\u003eWe believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.\u003c/p\u003e\n\u003cp\u003eWe’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.\u003c/p\u003e\n\u003cp\u003eWe must be on to something, since we’re proud to say:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have engineering teams in New York and Berlin\u003c/li\u003e\n\u003cli\u003eWe've raised millions in funding to grow U.S. operations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWant to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComfortable with Java and microservices.\u003c/li\u003e\n\u003cli\u003eYou seek and prefer simple solutions to complex problems.\u003c/li\u003e\n\u003cli\u003eYou strive to write clean, quality code and enjoy doing it.\u003c/li\u003e\n\u003cli\u003eYou maintain a healthy balance between perfectionism and actually getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.\u003c/li\u003e\n\u003cli\u003eYou love developing software. You have 2+ years of industry experience.\u003c/li\u003e\n\u003cli\u003eYou are a strong team player, have strong writing skills, and enjoy collaborating with others.\u003c/li\u003e\n\u003cli\u003eYou are attuned to the fundamentals of user design and user experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur technology stack includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava 10\u003c/li\u003e\n\u003cli\u003eSpring Boot\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePub/Sub\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eNodeJs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur Offer:\u003c/strong\u003e\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePerks:\u003c/strong\u003e\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.\u003c/p\u003e\n\u003cp\u003eSesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
  },
  {
    "id": "24c31152-e440-11e8-9240-8dede5d34cb0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0",
    "created_at": "Fri Nov 09 16:54:38 UTC 2018",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "location": "Cupertino, CA",
    "title": "Full Stack Engineer",
    "description": "\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://apple.com\"\u003ehttp://apple.com\u003c/a\u003e is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.\u003c/p\u003e\n\u003cp\u003eDescription:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability\u003c/p\u003e\n\u003cp\u003eManages expectations and provides ongoing status updates to team members.\u003c/p\u003e\n\u003cp\u003eResponsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.\u003c/p\u003e\n\u003cp\u003eUses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,\u003c/p\u003e\n\u003cp\u003eEnsures robust and lasting solutions are selected and embraced.\u003c/p\u003e\n\u003cp\u003eWorks under tight deadlines and keeps producers updated on an ongoing basis.\u003c/p\u003e\n\u003cp\u003eDevelops positive multi-functional relationships and works well with all levels of management.\u003c/p\u003e\n\u003cp\u003eProvides solutions to complex problems in a concise and articulate way.\u003c/p\u003e\n\u003cp\u003eSeen as the 'go to\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"
  },
  {
    "id": "6087faee-e298-11e8-9e1d-f95949c20e77",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6087faee-e298-11e8-9e1d-f95949c20e77",
    "created_at": "Wed Nov 07 14:22:29 UTC 2018",
    "company": "Attest",
    "company_url": "http://www.askattest.com",
    "location": "London",
    "title": "Engineering Manager",
    "description": "\u003cp\u003eWe’re on the look-out for a seasoned Engineering Manager to lead and empower our team of creative engineers in identifying and delivering features, systems and products they’re proud of. As our first Engineering Manager, this is a greenfield opportunity that will see you having immediate impact from day one. You’ll be trusted to:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAttract top engineering talent.\u003c/strong\u003e You’ll play an integral part in hiring Attest’s engineers by actively sourcing (either via channels such as LinkedIn, relevant events/ meet-ups etc), interviewing, and assessing high-quality candidates for exemplary technical chops, culture-add, potential, and emergent leadership traits.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevelop our engineers.\u003c/strong\u003e We’ll support you in enabling our team of engineers to deliver their greatest work to date by designing meaningful work that encourages personal and professional growth. You’ll do this by mentoring and coaching them during regular 1:1s, as well as performance and development conversations; embedding continual feedback loops for not only course-correction but praise and acknowledgement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLead our engineering team.\u003c/strong\u003e You’ll dutifully galvanise the engineering team by communicating a clear, exciting mission and purpose that we’re all aligned on. You’ll work closely with our Technology Director to help shape Attest’s engineering strategy, and translate that to the wider engineering team through context and scene-setting; enabling them to autonomously collaborate on finding solutions.\u003c/p\u003e\n\u003cp\u003eYou’ll enable our engineers to ship high-value, high-quality features regularly by acting as a conduit for information by working cross-functionally across departments: always aware of relevant activities in other teams; attending product reviews etc. All the while, you’ll be thinking ahead to ensure we are appropriately structured and adequately resourced to achieve our plans in the near, medium and longer terms.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRetain members of our engineering team.\u003c/strong\u003e You’ll play an integral part in driving a high-performing engineering team by ensuring the its members are engaged in the work they produce and feel their contribution makes a genuine difference not just to the company but our users.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCulture advocate.\u003c/strong\u003e You’ll be trusted to enable the team to identify and solve unique problems. To do this, we need your help in building upon our culture of psychological safety, trust, experimentation, and innovation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA people person with an engineering background with  a passion for working with and developing engineers at different stages of their profession career;\u003c/li\u003e\n\u003cli\u003eAn individual with an incredibly high level of EQ – you’ll be fascinated with learning about people on an ongoing basis. Your role will require you to express compassion and empathy and understanding, as well as work effectively with individuals of varying seniority levels, backgrounds and experiences;\u003c/li\u003e\n\u003cli\u003eApproachable and accessible to all members of the team - a trusted confidant, great listener, and trouble-shooter;\u003c/li\u003e\n\u003cli\u003eAn inspiring communicator with an acute ability to know when to appropriately switch from supportive and encouraging to prescriptive;\u003c/li\u003e\n\u003cli\u003eAbility to manage conflict and devise swift resolution;\u003c/li\u003e\n\u003cli\u003eAdaptable – you’ll be comfortable context-switching multiple times, as there’ll be a variety of tasks and activities you’ll need to effectively and efficiently juggle during the day;\u003c/li\u003e\n\u003cli\u003eEnthusiastic about working in a culture of testing and code review;\u003c/li\u003e\n\u003cli\u003ePassionate about technology, and excited about being hands-on where necessary, but highly motivated about bringing out the best in our engineers by coaching and mentoring them.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced building user-centric digital products, with an awareness of complex user interfaces development, distributed systems and technologies across our stack: Java / Go / TypeScript / Node / SQL (Postgres) / AWS\u003c/li\u003e\n\u003cli\u003eYou will have proven leadership skills, with experience line managing a high-performing team\u003c/li\u003e\n\u003cli\u003eCommercial acumen – being able to understand the market and our users as well as the commercial implications and impact our products have on their lives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we’ll offer in return\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA competitive salary that fairly recognises your experience and potential\u003c/li\u003e\n\u003cli\u003eAn equipment budget to spend on the right tools to help you do your best work\n25 days paid holiday – we care about our team’s wellbeing, so getting enough rest to recharge is vital\u003c/li\u003e\n\u003cli\u003eFlexible working hours and working from home\u003c/li\u003e\n\u003cli\u003e£900 Growth \u0026amp; Development budget to spend on the resources and tools that will help you grow in your role\u003c/li\u003e\n\u003cli\u003e10% adventure time to invest in charitable things, or side projects for Attest\u003c/li\u003e\n\u003cli\u003eA values-led working environment that encourages putting people first, honesty, curiosity and leadership\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout our people and culture\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith our team, we take a human-first approach, optimising for joy and adventure (ingrained in everything we do).\u003c/p\u003e\n\u003cp\u003eWe’re a very flat, friendly, non-hierarchical team. You’ll be working with an experienced commercial and technical team that delivers and adapts the Attest platform to continuously evolve and delight every client and every user.\u003c/p\u003e\n\u003cp\u003eWe value putting people (our team, clients and consumers) first; honesty, curiosity, empowerment and leadership are core to our team working style. Decisions are made with careful and quick consideration at Attest, to support fast and efficient growth. You can learn more about Attest on our website.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Attest\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGreat companies put consumers and data at the heart of every decision. Attest makes that simple and open for anyone at every business, continuously, at global scale.\u003c/p\u003e\n\u003cp\u003eWe call it Scalable Intelligence. Through our platform, hundreds of companies of all sizes connect to networks of 100 million consumers across 80 different countries, to learn, grow and innovate better every day.\u003c/p\u003e\n\u003cp\u003eClients like Unilever, Fever-Tree, EE, Publicis and Twitter rely on Attest to learn more about their consumers, markets and competitors. They use Attest to develop new products, test creatives, measure their brand, gain real-time feedback on trends and make better decisions, faster.\u003c/p\u003e\n\u003cp\u003eWe’re backed by leading VCs, including Oxford Capital and Episode 1 (investors behind LoveFilm, Zoopla, Betfair, Shazam, CarWow and many other greats), plus several high-powered amazing Angel investors.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease submit your application via this link: \u003ca href=\"https://team.askattest.com/jobs/139761-engineering-manager\"\u003ehttps://team.askattest.com/jobs/139761-engineering-manager\u003c/a\u003e Feel free to email \u003ca href=\"mailto:careers@askattest.com\"\u003ecareers@askattest.com\u003c/a\u003e if you have any questions.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1pXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3736f7a28b084e631d978b685d41fdff31bad0f/292a96a0-15e6-40fe-b25a-cfe1954fd730"
  },
  {
    "id": "a412770a-e1d3-11e8-8b9f-cf224f66af92",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a412770a-e1d3-11e8-8b9f-cf224f66af92",
    "created_at": "Tue Nov 06 14:54:06 UTC 2018",
    "company": "moovel Group GmbH",
    "company_url": "https://www.moovel.com/de/DE",
    "location": "Berlin",
    "title": "Backend Engineer (f/m) Node.js",
    "description": "\u003cp\u003eTransit Squad seeks Backend Engineer (f/m)\u003c/p\u003e\n\u003cp\u003eHi,\nwe’re the transit team at moovel. We build services, munch data and process real-time information in all things transit - and we’re looking for a backend engineer in the Berlin office to\njoin us in our effort to provide great public transit APIs as one of the pillars for moovel’s rapidly expanding mobility platform.\u003c/p\u003e\n\u003cp\u003eFIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003cp\u003eHOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions.\u003c/p\u003e\n\u003cp\u003eWith us you’ll use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools\nof their choice and a friendly environment in which they can thrive.\u003c/p\u003e\n\u003cp\u003eSOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it). On the Frontend (IOS, Android and Web) we adopted and embraced Technologies like Swift, Kotlin, Rx or React.\u003c/p\u003e\n\u003cp\u003eBreaking down concrete tasks for this position is not that easy, but that's what makes it so exciting. Here are some things we want to entrust you right away:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou write, monitor, scale and architect microservices that comprise our transit backend\u003c/li\u003e\n\u003cli\u003eYou build infrastructure and tooling for importing data into our data stores\u003c/li\u003e\n\u003cli\u003eYou develop services using Node.js \u0026amp; Python\u003c/li\u003e\n\u003cli\u003eYou perform analysis to enable data driven decisions\u003c/li\u003e\n\u003cli\u003eYou write processing pipelines in Python\u003c/li\u003e\n\u003cli\u003eCollaborate with cross-functional teams to define, design and ship new features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT YOU\nYou should have experience in writing, maintaining \u0026amp; debugging web services. You should be concerned about quality and maintainable code. Some exposure to functional programming, async concepts and micro services would be useful. While having working experience in the Node.js or Python web stack is a plus, it’s not a show-stopper in case you’re flexible and well versed in alternatives like Rails or Play. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud technologies and methodologies like 12 Factor.\u003c/p\u003e\n\u003cp\u003eYou should be familiar with SQL. Additionally, it would be nice if you have experience with any of Elasticsearch, Lucene, Solr or similar search technologies. \u003c/p\u003e\n\u003cp\u003eAs it is our corporate language, you should have good written and verbal communication skills in English.\u003c/p\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eCompany pension plan\u003c/li\u003e\n\u003cli\u003eFree breakfast, coffee \u0026amp; water\u003c/li\u003e\n\u003cli\u003eMobility allowance\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eChild care allowance\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSounds good?\nWe are more than happy to meet you soon! Just click the application form.\u003c/p\u003e\n\u003cp\u003eYour Transit Squad\nMagnus, Engineering Manager Search\u003c/p\u003e\n\u003cp\u003eClick here for the application!\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549073811\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eClick here for the application!\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3516d50eaf556f5817391b6fa7484e24bfe85f1/412aec9a-9ac1-46bd-b50f-c0bbafeb2d09"
  },
  {
    "id": "6bec4df4-e1b2-11e8-90e8-fe865b8dff7c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6bec4df4-e1b2-11e8-90e8-fe865b8dff7c",
    "created_at": "Tue Nov 06 10:55:50 UTC 2018",
    "company": "51nodes",
    "company_url": "https://www.51nodes.io/jobs",
    "location": "Stuttgart",
    "title": "Softwareentwickler/in Blockchain",
    "description": "\u003cp\u003eDu bist von den Möglichkeiten der Blockchain-Technologie genauso begeistert wie wir? Als leidenschaftlicher Programmierprofi möchtest Du mit Deiner Expertise die revolutionäre Technologie vorantreiben und Kundenanfragen in leistungsstarke Lösungen verwandeln? Du übernimmst gerne Verantwortung für herausfordernde Projekte und hast Lust, zusammen mit einem offenen und motivierten Team in einem flexiblem Arbeitsumfeld produktiv zu sein? Dann sollten wir uns kennenlernen!\u003c/p\u003e\n\u003cp\u003eFür unseren Standort in Stuttgart suchen wir Dich zum nächstmöglichen Zeitpunkt in Vollzeit oder Teilzeit als\u003c/p\u003e\n\u003cp\u003eSoftwareentwickler/in Blockchain\u003c/p\u003e\n\u003cp\u003eDiese spannenden Aufgaben erwarten Dich als Softwareentwickler/in\u0026lt;/b\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFür herausfordernde IT-Projekte mit wirtschaftlicher und gesellschaftlicher Relevanz entwickelst Du verschiedene Blockchain-basierte Lösungskomponenten für Anwendungen\u003c/li\u003e\n\u003cli\u003eAls Spezialist/in für Blockchain-Technologie unterstützt Du unsere Kunden intensiv dabei, die Möglichkeiten der Crypto Economy zu nutzen\u003c/li\u003e\n\u003cli\u003eDu setzt Dich mit aktuellen Trends der Blockchain-Architektur auseinander und bleibst zu Weiterentwicklungen immer up-to-date\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas Du als Softwareentwickler/in mitbringst\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium der Informatik, Elektrotechnik oder Mathematik bzw. eine vergleichbare IT-Ausbildung (z. B. Fachinformatiker/in)\u003c/li\u003e\n\u003cli\u003eEinschlägige Berufserfahrung in allen Phasen der Softwareentwicklung in Kundenprojekten mit Bezug zu WebTechnologien und verteilten Systemen, z. B. Frontend, Backend, Service-Architekturen, Datenintegration und Cloud-Technologien\u003c/li\u003e\n\u003cli\u003eVerhandlungssichere Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003cli\u003eAusgeprägtes Interesse an Blockchain-Technologie und Freude an der selbstständigen Entwicklung von komplexen Softwarelösungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas bieten wir Dir\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEine branchenübliche und leistungsgerechte Vergütung mit erfolgsabhängiger Bonuskomponente\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten in einem modernen, hellen Büro sowie Homeoffice-Möglichkeiten für eine ausgewogene Work-Life-Balance\u003c/li\u003e\n\u003cli\u003eHochwertige IT-Ausstattung mit Hardware Deiner Wahl für optimale Arbeitsbedingungen\u003c/li\u003e\n\u003cli\u003eIntensive Einarbeitung durch unser talentiertes Entwicklerteam\u003c/li\u003e\n\u003cli\u003eIndividuelle Unterstützung beim Erreichen Deiner Entwicklungsziele in einem dynamischen Unternehmen mit flachen Hierarchien\u003c/li\u003e\n\u003cli\u003eDie Möglichkeit, 20% der Arbeitszeit an eigenen Projekten zu arbeiten\u003c/li\u003e\n\u003cli\u003eZentrale Lage mit sehr guter Anbindung an öffentliche Verkehrsmittel (U-Bahn- und S-Bahn-Stationen in unmittelbarer Nähe)\u003c/li\u003e\n\u003cli\u003eDie Teilnahme an Meetups, Mob-Programming, Hackathons im Rahmen unseres Engagements in der lokalen Blockchain-Community\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eÜber 51nodes\n51nodes bietet als Softwareentwicklungsunternehmen die technologische Beratung und Implementierung von Blockchain-basierten Lösungskomponenten. Unser Angebot umfasst Blockchain-Infrastruktur und dezentrale Blockchain-Applikationen, Verknüpfung von IoT / Industrie 4.0 mit Blockchain-Komponenten sowie die Tokenisierung von Assetklassen. Unsere Vision ist es, mit Blockchain-Technologie unsere Kunden zu erfolgreichen Akteuren der Crypto Economy und unsere Mitarbeiter zu aktiven Gestaltern des Internets of Value zu machen.\u003c/p\u003e\n\u003cp\u003eDu möchtest Teil unserer Lösung werden?\nDann bewirb Dich jetzt als „Softwareentwickler/in Blockchain“ und sende uns Deinen CV oder den Link zu einem Deiner Social-Media-Accounts mit der Angabe Deines frühestmöglichen Startdatums über diesen Link!. Wir freuen uns auf Deine Bewerbung!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!!\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0bd75ddd28da625cdc4a9dc6ef16556973d733fc/4b7788fc-4a2c-4b0b-bac2-5ed87b3b5d59"
  },
  {
    "id": "9636b280-e12a-11e8-819f-7c947fed1ee2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9636b280-e12a-11e8-819f-7c947fed1ee2",
    "created_at": "Mon Nov 05 20:22:43 UTC 2018",
    "company": "Homestars",
    "company_url": "http://homestars.com",
    "location": "Toronto",
    "title": "Salesforce Engineer ",
    "description": "\u003cp\u003eWHO WE ARE:\nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs by allowing them to search our database of companies and hundreds of thousands of reviews. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars has recently been acquired by ANGI Homeservices Inc., the #1 marketplace in the US for helping homeowners connect with the best home service providers.\u003c/p\u003e\n\u003cp\u003eWHY JOIN US:\nHomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be work or be a part of organization with an exceptional environment, we want to hear from you!\u003c/p\u003e\n\u003cp\u003ePerks of working at HomeStars:\n-We are growing fast. HomeStars is part of the ANGI Homeservices Inc. family.\u003c/p\u003e\n\u003cp\u003e-Excellent Benefits Package. We want a healthy and productive team.\u003c/p\u003e\n\u003cp\u003e-Company wide social events and team building activities.\u003c/p\u003e\n\u003cp\u003e-December Break. The office is closed the week before New Year’s.\u003c/p\u003e\n\u003cp\u003e-Personal Growth. We seek to provide employees with constructive feedback to foster their career growth.\u003c/p\u003e\n\u003cp\u003e-Beautiful brick \u0026amp; beam office in the heart of the entertainment district in Toronto.\u003c/p\u003e\n\u003cp\u003e-Rec room with lounge, ping pong, darts and foosball.\u003c/p\u003e\n\u003cp\u003eABOUT THE ROLE:\nWe are looking for a Salesforce.com Developer who will drive the implementation of Salesforce and its utilization across our organization. The Salesforce Engineer will manage the technical aspects of Salesforce CRM application.\u003c/p\u003e\n\u003cp\u003eTHE OPPORTUNITY:\n-Work in a fast-paced, agile project environment with small, focused teams.\u003c/p\u003e\n\u003cp\u003e-An opportunity to work on a range of platforms such as: Salesforce, Web Applications, Android, iOS.\u003c/p\u003e\n\u003cp\u003e-Gain hands on experience with the latest technologies.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork closely with both the Salesforce and Engineering team at HomeStars.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eResponsible for the technical aspects of Salesforce.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e-Develop custom solutions in VisualForce, Apex, Java, AJAX, and other key technologies.\u003c/p\u003e\n\u003cp\u003e-Develop and maintain Visualforce, Apex, and Integration tools to other third party solutions.\u003c/p\u003e\n\u003cp\u003e-Working closely with the other departments in order to respond to user’s questions and issues.\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS:\n-2-3 years of experience with software development (Java and/or C# preferred).\u003c/p\u003e\n\u003cp\u003e-Ability to organize and prioritize responsibilities effectively in order to meet deadlines\u003c/p\u003e\n\u003cp\u003e-Understanding of multiple programming environments and tools.\u003c/p\u003e\n\u003cp\u003e-Experience with Cloud or Saas solutions.\u003c/p\u003e\n\u003cp\u003e-Knowledge of data management, SQL, SOA design principles.\u003c/p\u003e\n\u003cp\u003e-Understanding of Ruby on Rails, NodeJS, JavaScript,HTML, CSS, and JSON, and exposure to REST based web services.\u003c/p\u003e\n\u003cp\u003e-Understanding of the Salesforce platform (Admin/Config, Apex, VisualForce, Triggers, etc.).\u003c/p\u003e\n\u003cp\u003e-Salesforce experience as a developer or end user.\u003c/p\u003e\n\u003cp\u003eBENEFITS:\nWe are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail resume directly to:\n\u003ca href=\"mailto:jessica.chester@homestars.com\"\u003ejessica.chester@homestars.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cda082695a7f08b5567363aa9531c30e29fe648/3de2fb1b-53e9-414f-b371-b04b36617c7d"
  },
  {
    "id": "e10970ae-df31-11e8-8043-db2f2a1252c8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e10970ae-df31-11e8-8043-db2f2a1252c8",
    "created_at": "Sat Nov 03 06:31:26 UTC 2018",
    "company": "Live Graphic Systems",
    "company_url": "https://www.ligrsystems.com/careers/senior-full-stack-javascript-engineer",
    "location": "Australia and/or Remote",
    "title": "Senior Full-Stack Javascript Engineer",
    "description": "\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eLiGr systems is a growing startup in the sports and media tech industry which creates automated, real-time data-driven graphic displays (scoreboards, team lists, infographics) for sports organisations from grassroots to professional for use primarily over live video broadcasts.\u003c/p\u003e\n\u003cp\u003eWho we're looking for:\u003c/p\u003e\n\u003cp\u003eThis is a unique opportunity to build exciting, bleeding edge technology in the sports and broadcast industry, and we are looking for a talented, experienced javascript/web engineer to join our team and help build on our ideas.\u003c/p\u003e\n\u003cp\u003eThe successful applicant will be able to assist us in meeting the challenges of scale as we expand our operation internationally. You will have an immediate opportunity to influence the product strategy and organisational culture.\u003c/p\u003e\n\u003cp\u003eSuccessful candidates will be invited to meet our leadership team in person or over video chat.\u003c/p\u003e\n\u003cp\u003eThe following skills are required\u003c/p\u003e\n\u003cp\u003eStrong engineering ability,\nFluent / Advanced English,\nExcellent practical problem-solving,\nA passion for software,\nGreat written communication skills,\nOrganisational skills,\nContinuous Learner,\nAbility to work unsupervised\u003c/p\u003e\n\u003cp\u003eThe following skills are highly valued\u003c/p\u003e\n\u003cp\u003eCloud infrastructure e.g. containers(docker), Kubernetes, GCP, cloud functions,\nReact, webpack, babel, redux\nSvg, gsap, animation/motion graphics\nEvent-driven architectures, event sourcing,\nTesting unit/integration/e2e/CI/CD,\nUnderstanding of design systems,\nCSS\u003c/p\u003e\n\u003cp\u003eThe following is also valued\u003c/p\u003e\n\u003cp\u003eSome understanding of sport,\nVideo streaming - encoding/hls/rtmp/storage/facebook/youtube\u003c/p\u003e\n\u003cp\u003eOur current stack:\u003c/p\u003e\n\u003cp\u003eReact,\nNode.js,\nDocker,\nKubernetes,\nGCP,\nGoogle Firestore\u003c/p\u003e\n\u003cp\u003eWhat you”ll be doing\u003c/p\u003e\n\u003cp\u003eCreating web interfaces/content management systems,\nImplementing graphic components,\nImproving event-driven architecture and building backend services\u003c/p\u003e\n\u003cp\u003eBenefits of the role\u003c/p\u003e\n\u003cp\u003eIn addition to being a part of a great team, working in a fun and creative environment and learning from the best technical minds in the sports industry, we offer:\u003c/p\u003e\n\u003cp\u003eCompetitive salary,\nAccess to the latest tools and technologies,\nWork with global sporting bodies and sports leagues,\nRemote work with a virtual and regular communication environment (Trello, Slack, Github etc),\nStart-up sized company, where you can make an immediate impact,\nBuild software that will have a global impact on sports and the future of sports broadcast,\nOur team is technical and understands developer needs\u003c/p\u003e\n\u003cp\u003eApply\u003c/p\u003e\n\u003cp\u003eApplying is easy. Send an email with your resume, website, Github account, links to apps or anything else you're proud of. If we like what we see, we’ll get in touch and organise a catchup in person or over video chat. We’ll then tell you more about the role and we can decide if there's a fit.\u003c/p\u003e\n\u003cp\u003eEmail applications to \u003ca href=\"mailto:luke@ligrsystems.com\"\u003eluke@ligrsystems.com\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail \u003ca href=\"mailto:luke@ligrsystems.com\"\u003eluke@ligrsystems.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f0edf89d5fad53a1a86e8ac0472360882eb11af/b1bdfcc7-18e7-4394-83e2-0f539fb92289"
  },
  {
    "id": "2d215050-dea2-11e8-9a31-2431d393de1e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2d215050-dea2-11e8-9a31-2431d393de1e",
    "created_at": "Fri Nov 02 13:22:25 UTC 2018",
    "company": "Aera Technology",
    "company_url": "https://www.aeratechnology.com/careers",
    "location": "Bucharest",
    "title": "Senior User Interface Software Engineer",
    "description": "\u003cp\u003eDo you want to shape the future of enterprise software?\u003c/p\u003e\n\u003cp\u003eAt Aera Technology, we apply Internet scale technology to the challenges facing enterprise businesses. Think of the self-driving car: connected, always-on, thinking, and autonomous. Our mission is to enable companies in the same way.\u003c/p\u003e\n\u003cp\u003eWe're hiring exceptionally talented UI developers to join our top-notch engineering team. This is a great opportunity to be part of a team developing cutting-edge enterprise cloud platform. You must be highly motivated, independent, result oriented and enjoy working in a start-up atmosphere.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop new features and components in our existing web application.\u003c/li\u003e\n\u003cli\u003eBuild reusable code and libraries for future use.\u003c/li\u003e\n\u003cli\u003eWork with PM and UX designer to understand the requirement and ensure the technical feasibility of UI/UX design.\u003c/li\u003e\n\u003cli\u003eOptimize application for maximum speed and scalability.\u003c/li\u003e\n\u003cli\u003eLearn and research latest JavaScript frameworks and work on PoC projects to integrate and upgrade existing application.\u003c/li\u003e\n\u003cli\u003eCollaborate with other team members and with cross-functional teams and stakeholders across geographies.\u003c/li\u003e\n\u003cli\u003eCreate and execute unit test cases and contribute to test automation.\u003c/li\u003e\n\u003cli\u003eParticipate in design and code reviews.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA passion for UI/UX\u003c/li\u003e\n\u003cli\u003eYou are an experienced UI developer with a proven track record of delivering great software.\u003c/li\u003e\n\u003cli\u003eExperience with HTML, CSS, HTML5, OO Javascript, modern frameworks such as ReactJS, Polymer, VueJS or ExtJS/Sencha.\u003c/li\u003e\n\u003cli\u003eExperience with NodeJS, Browserify, Babelify, Gulp, Bower.\u003c/li\u003e\n\u003cli\u003eAn ability to write code for responsive UI and implement common widgets.\u003c/li\u003e\n\u003cli\u003eHave a passion for quality and writing clean, solid, readable code that scales and performs well.\u003c/li\u003e\n\u003cli\u003eA firm grasp of Computer Science fundamentals including object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.\u003c/li\u003e\n\u003cli\u003eExperience with Java, Rest API is a big plus.\u003c/li\u003e\n\u003cli\u003eExperience with cloud services. Experience with microservices would be a bonus.\u003c/li\u003e\n\u003cli\u003eAn urge to collaborate with other architects, designers, product managers, and software developers to influence product direction and functional requirements.\u003c/li\u003e\n\u003cli\u003eAbility to coach and collaborate inside and outside the team - You enjoy working closely with others, teaching, and learning, and are comfortable showing off your work.\u003c/li\u003e\n\u003cli\u003eHave a positive energy and enthusiasm - cultural fit is a big deal for us, we’re looking for smart people who are excited about solving big problems and are self-motivated to get things done.\u003c/li\u003e\n\u003cli\u003eAre highly organized and have a professional attitude towards work - You're an exceptional communicator, you are pragmatic, and you know how to build trust.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Aera, we're on a mission to solve the biggest, most intractable challenges of enterprise software. We envision the rise of the Self-Driving Enterprise: a more autonomously functioning business with a central operating system that connects and orchestrates business operations. Our platform is increasingly used by the world's largest companies to identify and respond to market opportunities faster.\u003c/p\u003e\n\u003cp\u003eIf you share our passion for building the next generation of enterprise software and implementing it for the most sophisticated customers in the world, you’ve met your match. Headquartered in Mountain View, California, we're growing fast, with teams in Mountain View and San Francisco (California), Portland (Oregon), Bucharest and Cluj-Napoca (Romania), Paris (France), Munich (Germany), London (UK), Pune (India), and Sydney (Australia).  So join us, and let’s build this!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply here: \u003ca href=\"https://bit.ly/2Jx6mmO\"\u003ehttps://bit.ly/2Jx6mmO\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE5XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--05413e1280c79b2290bac2120cb451141c7922b6/d676ca56-df82-4c76-8f5e-bd7778190625"
  },
  {
    "id": "d5955556-de1b-11e8-97e2-45ff61609ad8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d5955556-de1b-11e8-97e2-45ff61609ad8",
    "created_at": "Thu Nov 01 21:20:36 UTC 2018",
    "company": "PlayVS",
    "company_url": "http://www.playvs.com",
    "location": "Santa Monica, CA",
    "title": "Software Engineer, Full Stack",
    "description": "\u003cp\u003ePlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.\u003c/p\u003e\n\u003cp\u003eAs an engineer, you’ll be expected to do the normal tech startup duties including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWriting clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDebugging, documentation, and unit testing. Everyone loves a smooth game day.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave a natural knack for user experience and pixel-perfect design. You should know CSS like it’s the back of your hand, and be extremely comfortable building modern responsive web apps.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBeing flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines. You will wear many hats here.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImproving our internal tooling and engineering process by contributing your knowledge and unique background.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we’re looking for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years of technical experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterest in gaming or esports, though no prior experience is required\nExperience using NodeJS or NoSQL data stores like Redis, RethinkDB or Mongo\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExpert developing interfaces using ReactJS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTop-notch CSS skills\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eComfortable working with WebSockets\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDegree in Computer Science preferred\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant. This role is $110K+.  If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail us at \u003ca href=\"mailto:careers@playvs.com\"\u003ecareers@playvs.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2xXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--02900ed15126cfa0983ebd48ddba2b07539f4c62/7f3abee5-837b-49da-93f7-b44fbe23fc0a"
  },
  {
    "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45",
    "created_at": "Thu Nov 01 13:09:37 UTC 2018",
    "company": "Jane Street",
    "company_url": "http://janestreet.com",
    "location": "New York, NY; London, UK; Hong Kong",
    "title": "Software Developer (Functional Programming)",
    "description": "\u003cp\u003eSoftware Developer\u003c/p\u003e\n\u003cp\u003eJane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.\u003c/p\u003e\n\u003cp\u003eThe markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.\u003c/p\u003e\n\u003cp\u003eWe are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.\u003c/p\u003e\n\u003cp\u003eThe atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.\u003c/p\u003e\n\u003cp\u003eYou can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (\u003ca href=\"http://ocaml.janestreet.com/?q=node/61\"\u003ehttp://ocaml.janestreet.com/?q=node/61\u003c/a\u003e), and our programming blog (\u003ca href=\"http://ocaml.janestreet.com\"\u003ehttp://ocaml.janestreet.com\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWe also have extensive benefits, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e90% book reimbursement for work-related books\u003c/li\u003e\n\u003cli\u003e90% tuition reimbursement for continuing education\u003c/li\u003e\n\u003cli\u003eExcellent, zero-premium medical and dental insurance\u003c/li\u003e\n\u003cli\u003eFree lunch delivered daily from a selection of restaurants\u003c/li\u003e\n\u003cli\u003eCatered breakfasts and fresh brewed Peet's coffee\u003c/li\u003e\n\u003cli\u003eAn on-site, private gym in New York with towel service\u003c/li\u003e\n\u003cli\u003eKitchens fully stocked with a variety of snack choices\u003c/li\u003e\n\u003cli\u003eFull company 401(k) match up to 6% of salary, vests immediately\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMore information at \u003ca href=\"http://janestreet.com/culture/benefits/\"\u003ehttp://janestreet.com/culture/benefits/\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply through our web app form at  \u003ca href=\"https://www.janestreet.com/join-jane-street/apply/\"\u003ehttps://www.janestreet.com/join-jane-street/apply/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6dec9502d27094bbc9c7ff6c33806d0cdbb6faf/ac79023f-6a10-488b-be9f-751264dd8d06"
  },
  {
    "id": "597d15fc-dda9-11e8-8d8c-9919a5047170",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/597d15fc-dda9-11e8-8d8c-9919a5047170",
    "created_at": "Thu Nov 01 07:40:23 UTC 2018",
    "company": "Shiftling",
    "company_url": null,
    "location": "remote",
    "title": "Full Stack Developer ",
    "description": "\u003cp\u003eLooking for an awesome full-stack web developer with experience on both Node.js and React technologies.\u003c/p\u003e\n\u003cp\u003eThe role requires a product-focused, self-driven engineer who takes pride in delivering a quality application, and also cares about all the details that will make our users happier.\u003c/p\u003e\n\u003cp\u003eRequired technical skills:\nNode.js (ability to build a quality backend application that will power-up all web/mobile clients)\nPostgreSQL (use as primary database from the backend application)\nReact (ability to build a modern web application using the React ecosystem)\nCSS (ability to produce a responsive website from given designs)\nGit / GitHub (working with git and GitHub flow)\nContinuous-Integration (CI) (ability to setup and use any CI platform of choice for automated testing and deployments)\nDevops: be familiar with at least one of Heroku, AWS, Google Cloud, Azure.\u003c/p\u003e\n\u003cp\u003eNice to have technical skills:\nGraphQL (ability to build a GraphQL API on the backend, as well as consume it on the React web client)\nExperience on integrating with 3rd party payment APIs\u003c/p\u003e\n\u003cp\u003eOther required skills:\nFluent in English (both written and verbal)\nExperienced on working remotely in a fast-paced environment\u003c/p\u003e\n\u003cp\u003eConditions:\nEngagement: full-time (40hr / week), long-term\nLocation: remote, minimum overlap of 4 working hrs with Gulf Standard Time (GST).\nCompensation: negotiable, plus stock options\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:bella@shiftling.com\"\u003ebella@shiftling.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1JXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31ea7282927da02f0d01e5ecf9a7a08ba1bf4864/29a56b2b-08c7-43fe-a2b1-b64ed771d13c"
  },
  {
    "id": "adfadaec-dd63-11e8-859f-cbc9965a7cd1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/adfadaec-dd63-11e8-859f-cbc9965a7cd1",
    "created_at": "Wed Oct 31 23:21:52 UTC 2018",
    "company": "Game Closure",
    "company_url": "https://www.gameclosure.com",
    "location": "Tokyo // Mountain View // Eugene",
    "title": "Systems Engineer",
    "description": "\u003cp\u003eGame Closure is on the hunt for Systems Engineers to help us build the social games that guide the development of our mobile game engine. We are a 70 ­strong and growing team with offices in Mountain View, California, Oregon and Tokyo, Japan. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eAs a Systems Engineer at Game Closure, you will play a pivotal role in creating a platform to revolutionize the mobile game development industry. Our engineers are generally amazing at something and great at everything else. We write cross-­compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js \u0026amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003eThe Role:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team.\u003c/li\u003e\n\u003cli\u003ePlay a critical role in day-­to-­day coding, performance profiling, optimization, and general troubleshooting.\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.\u003c/li\u003e\n\u003cli\u003eArchitect and code sophisticated client/server systems for mobile gaming.\u003c/li\u003e\n\u003cli\u003eLearn from and mentor other engineers on your team.\u003c/li\u003e\n\u003cli\u003eTake ownership of your projects to make them the best they can possibly be.\u003c/li\u003e\n\u003cli\u003eProvide valuable input on the company's long-term engineering roadmap and help identify areas of opportunity for improvement.\u003c/li\u003e\n\u003cli\u003eDefine the cutting edge of social gaming!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience.\u003c/li\u003e\n\u003cli\u003eExperience writing clean, testable, high­-quality code with a special focus on mobile performance.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.\u003c/li\u003e\n\u003cli\u003eAbility to interact with peers in a constructive and productive style.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn, or other VCS.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eBoth Android and iOS game development experience\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eAPPLY HERE\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a58c79dfaea2375731d403d9d9f6a1e95f5d3407/0e7a7952-d150-4ac5-b78f-1cd813de1d40"
  },
  {
    "id": "041ee91a-dd62-11e8-9c45-21fe88164ff0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/041ee91a-dd62-11e8-9c45-21fe88164ff0",
    "created_at": "Wed Oct 31 23:11:37 UTC 2018",
    "company": "Game Closure",
    "company_url": "https://www.gameclosure.com",
    "location": "Tokyo // Mountain View // Eugene",
    "title": "Game Engineer (HTML5)",
    "description": "\u003cp\u003eGame Closure is on the hunt for Game Engineers to help us build the social games that guide the development of our mobile game engine. We are a 60 ­strong and growing team with offices in Mountain View, California; Eugene, Oregon, and Tokyo, Japan. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass mobile games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js \u0026amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003eThe Role:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user! Insist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eWe expect you to be good at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eYou must be pretty knowledgeable with what jQuery can do, and what functionality you are better off custom coding.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­ oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf ­starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eBoth Android and iOS game development experience\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eAPPLY HERE\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ebd7c63eaa45634e45c75fc9422d2133fc002c0/df5f52c6-ee20-4a9c-b9c9-a18e6785f918"
  },
  {
    "id": "1ef41916-dd5f-11e8-98aa-d336cb7192b8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1ef41916-dd5f-11e8-98aa-d336cb7192b8",
    "created_at": "Wed Oct 31 22:54:08 UTC 2018",
    "company": "playvs-inc",
    "company_url": null,
    "location": "Santa Monica, CA",
    "title": "Software Engineer, Backend",
    "description": "\u003cp\u003ePlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.\u003c/p\u003e\n\u003cp\u003eAs an engineer, you’ll be expected to do the normal tech startup duties including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWriting clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDebugging, documentation, and unit testing. Everyone loves a smooth game day.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBuilding and integrating APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBeing flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImproving our internal tooling and engineering process by contributing your knowledge and unique background.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we’re looking for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years of technical experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterest in gaming or esports\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience using NodeJS or NoSQL data stores like Redis, RethinkDB or Mongo\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eComfortable working with WebSockets\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDegree in Computer Science preferred\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant. This role is 90k and up. If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email us at \u003ca href=\"mailto:careers@playvs.com\"\u003ecareers@playvs.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13c421e8ce9526b4489d8262c8e069636a4a6285/967eb69a-ee1a-490c-b2cc-8ea54070fc36"
  },
  {
    "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
    "created_at": "Wed Oct 31 19:45:06 UTC 2018",
    "company": "Traction",
    "company_url": "https://www.tractionco.com/",
    "location": "Sunnyvale, CA ",
    "title": "Lead Full Stack Developer",
    "description": "\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  }
]